
enum {
	KTMOH_CommitTransaction_Result = 0x1,
	KTMOH_RollbackTransaction_Result = 0x2
};

struct BATTERY_REPORTING_SCALE {
	/*0000*/ ULONG Granularity;
	/*0004*/ ULONG Capacity;
	/*0008*/
};

enum BUS_QUERY_ID_TYPE {
	BusQueryDeviceID = 0x0,
	BusQueryHardwareIDs = 0x1,
	BusQueryCompatibleIDs = 0x2,
	BusQueryInstanceID = 0x3,
	BusQueryDeviceSerialNumber = 0x4,
	BusQueryContainerID = 0x5
};

struct CMP_OFFSET_ARRAY {
	/*0000*/ ULONG FileOffset;
	/*0008*/ void * DataBuffer;
	/*0010*/ ULONG DataLength;
	/*0018*/
};

struct DEBUG_DEVICE_ADDRESS {
	/*0000*/ UCHAR Type;
	/*0001*/ UCHAR Valid;
	/*0002*/ UCHAR Reserved[0x2];
	/*0002*/ UCHAR BitWidth;
	/*0003*/ UCHAR AccessSize;
	/*0008*/ UCHAR * TranslatedAddress;
	/*0010*/ ULONG Length;
	/*0018*/
};

struct DEBUG_MEMORY_REQUIREMENTS {
	/*0000*/ _LARGE_INTEGER Start;
	/*0008*/ _LARGE_INTEGER MaxEnd;
	/*0010*/ void * VirtualAddress;
	/*0018*/ ULONG Length;
	/*001c*/ UCHAR Cached;
	/*001d*/ UCHAR Aligned;
	/*0020*/
};

enum DEVICE_TEXT_TYPE {
	DeviceTextDescription = 0x0,
	DeviceTextLocationInformation = 0x1
};

struct DOCK_INTERFACE {
	/*0000*/ USHORT Size;
	/*0002*/ USHORT Version;
	/*0008*/ void * Context;
	/*0010*/ void (* InterfaceReference)( void * );
	/*0018*/ void (* InterfaceDereference)( void * );
	/*0020*/ ULONG (* ProfileDepartureSetMode)( void * , PROFILE_DEPARTURE_STYLE );
	/*0028*/ ULONG (* ProfileDepartureUpdate)( void * );
	/*0030*/
};

enum ETW_COMPRESSION_RESUMPTION_MODE {
	EtwCompressionModeRestart = 0x0,
	EtwCompressionModeNoDisable = 0x1,
	EtwCompressionModeNoRestart = 0x2
};

enum FEATURE_CHANGE_TIME {
	FEATURE_CHANGE_TIME_READ = 0x0,
	FEATURE_CHANGE_TIME_MODULE_RELOAD = 0x1,
	FEATURE_CHANGE_TIME_SESSION = 0x2,
	FEATURE_CHANGE_TIME_REBOOT = 0x3,
	FEATURE_CHANGE_TIME_USER_FLAG = 0x80
};

enum FEATURE_ENABLED_STATE {
	FEATURE_ENABLED_STATE_DEFAULT = 0x0,
	FEATURE_ENABLED_STATE_DISABLED = 0x1,
	FEATURE_ENABLED_STATE_ENABLED = 0x2,
	FEATURE_ENABLED_STATE_HAS_NOTIFICATION = 0x80,
	FEATURE_ENABLED_STATE_HAS_VARIANT_CONFIGURATION = 0x40
};

struct FEATURE_ERROR {
	/*0000*/ HRESULT hr;
	/*0004*/ USHORT lineNumber;
	/*0008*/ CHAR const * file;
	/*0010*/ CHAR const * process;
	/*0018*/ CHAR const * modulePath;
	/*0020*/ UINT callerReturnAddressOffset;
	/*0028*/ CHAR const * callerModule;
	/*0030*/ CHAR const * message;
	/*0038*/ USHORT originLineNumber;
	/*0040*/ CHAR const * originFile;
	/*0048*/ CHAR const * originModule;
	/*0050*/ UINT originCallerReturnAddressOffset;
	/*0058*/ CHAR const * originCallerModule;
	/*0060*/ CHAR const * originName;
	/*0068*/
};

struct FEATURE_LOGGED_TRAITS {
	/*0000*/ USHORT version;
	/*0002*/ USHORT baseVersion;
	/*0004*/ UCHAR stage;
	/*0006*/
};

struct FEATURE_STATE_CHANGE_SUBSCRIPTION__ {
	/*0000*/ INT unused;
	/*0004*/
};

enum HAL_APIC_DESTINATION_MODE {
	ApicDestinationModePhysical = 0x1,
	ApicDestinationModeLogicalFlat = 0x2,
	ApicDestinationModeLogicalClustered = 0x3,
	ApicDestinationModeUnknown = 0x4
};

struct HAL_PRIVATE_DISPATCH {
	/*0000*/ ULONG Version;
	/*0008*/ _BUS_HANDLER * (* HalHandlerForBus)( _INTERFACE_TYPE , ULONG );
	/*0010*/ _BUS_HANDLER * (* HalHandlerForConfigSpace)( _BUS_DATA_TYPE , ULONG );
	/*0018*/ void (* HalLocateHiberRanges)( void * );
	/*0020*/ LONG (* HalRegisterBusHandler)( _INTERFACE_TYPE , _BUS_DATA_TYPE , ULONG , _INTERFACE_TYPE , ULONG , ULONG , LONG (* )( _BUS_HANDLER * ), _BUS_HANDLER * * );
	/*0028*/ void (* HalSetWakeEnable)( UCHAR );
	/*0030*/ LONG (* HalSetWakeAlarm)( ULONGLONG , ULONGLONG );
	/*0038*/ UCHAR (* HalPciTranslateBusAddress)( _INTERFACE_TYPE , ULONG , _LARGE_INTEGER , ULONG * , _LARGE_INTEGER * );
	/*0040*/ LONG (* HalPciAssignSlotResources)( _UNICODE_STRING * , _UNICODE_STRING * , _DRIVER_OBJECT * , _DEVICE_OBJECT * , _INTERFACE_TYPE , ULONG , ULONG , _CM_RESOURCE_LIST * * );
	/*0048*/ void (* HalHaltSystem)();
	/*0050*/ UCHAR (* HalFindBusAddressTranslation)( _LARGE_INTEGER , ULONG * , _LARGE_INTEGER * , ULONGLONG * , UCHAR );
	/*0058*/ UCHAR (* HalResetDisplay)();
	/*0060*/ LONG (* HalAllocateMapRegisters)( _ADAPTER_OBJECT * , ULONG , ULONG , _MAP_REGISTER_ENTRY * );
	/*0068*/ LONG (* KdSetupPciDeviceForDebugging)( void * , _DEBUG_DEVICE_DESCRIPTOR * );
	/*0070*/ LONG (* KdReleasePciDeviceForDebugging)( _DEBUG_DEVICE_DESCRIPTOR * );
	/*0078*/ void * (* KdGetAcpiTablePhase0)( _LOADER_PARAMETER_BLOCK * , ULONG );
	/*0080*/ void (* KdCheckPowerButton)();
	/*0088*/ UCHAR (* HalVectorToIDTEntry)( ULONG );
	/*0090*/ void * (* KdMapPhysicalMemory64)( _LARGE_INTEGER , ULONG , UCHAR );
	/*0098*/ void (* KdUnmapVirtualAddress)( void * , ULONG , UCHAR );
	/*00a0*/ ULONG (* KdGetPciDataByOffset)( ULONG , ULONG , void * , ULONG , ULONG );
	/*00a8*/ ULONG (* KdSetPciDataByOffset)( ULONG , ULONG , void * , ULONG , ULONG );
	/*00b0*/ ULONG (* HalGetInterruptVectorOverride)( _INTERFACE_TYPE , ULONG , ULONG , ULONG , UCHAR * , ULONGLONG * );
	/*00b8*/ LONG (* HalGetVectorInputOverride)( ULONG , _GROUP_AFFINITY * , ULONG * , _KINTERRUPT_POLARITY * , _INTERRUPT_REMAPPING_INFO * );
	/*00c0*/ LONG (* HalLoadMicrocode)( void * );
	/*00c8*/ LONG (* HalUnloadMicrocode)();
	/*00d0*/ LONG (* HalPostMicrocodeUpdate)();
	/*00d8*/ LONG (* HalAllocateMessageTargetOverride)( _DEVICE_OBJECT * , _GROUP_AFFINITY * , ULONG , _KINTERRUPT_MODE , UCHAR , ULONG * , UCHAR * , ULONG * );
	/*00e0*/ void (* HalFreeMessageTargetOverride)( _DEVICE_OBJECT * , ULONG , _GROUP_AFFINITY * );
	/*00e8*/ LONG (* HalDpReplaceBegin)( _HAL_DP_REPLACE_PARAMETERS * , void * * );
	/*00f0*/ void (* HalDpReplaceTarget)( void * );
	/*00f8*/ LONG (* HalDpReplaceControl)( ULONG , void * );
	/*0100*/ void (* HalDpReplaceEnd)( void * );
	/*0108*/ void (* HalPrepareForBugcheck)( ULONG );
	/*0110*/ UCHAR (* HalQueryWakeTime)( ULONGLONG * , ULONGLONG * );
	/*0118*/ void (* HalReportIdleStateUsage)( UCHAR , _KAFFINITY_EX * );
	/*0120*/ void (* HalTscSynchronization)( UCHAR , ULONG * );
	/*0128*/ LONG (* HalWheaInitProcessorGenericSection)( _WHEA_ERROR_RECORD_SECTION_DESCRIPTOR * , _WHEA_PROCESSOR_GENERIC_ERROR_SECTION * );
	/*0130*/ void (* HalStopLegacyUsbInterrupts)( _SYSTEM_POWER_STATE );
	/*0138*/ LONG (* HalReadWheaPhysicalMemory)( _LARGE_INTEGER , ULONG , void * );
	/*0140*/ LONG (* HalWriteWheaPhysicalMemory)( _LARGE_INTEGER , ULONG , void * );
	/*0148*/ LONG (* HalDpMaskLevelTriggeredInterrupts)();
	/*0150*/ LONG (* HalDpUnmaskLevelTriggeredInterrupts)();
	/*0158*/ LONG (* HalDpGetInterruptReplayState)( void * , void * * );
	/*0160*/ LONG (* HalDpReplayInterrupts)( void * );
	/*0168*/ UCHAR (* HalQueryIoPortAccessSupported)();
	/*0170*/ LONG (* KdSetupIntegratedDeviceForDebugging)( void * , _DEBUG_DEVICE_DESCRIPTOR * );
	/*0178*/ LONG (* KdReleaseIntegratedDeviceForDebugging)( _DEBUG_DEVICE_DESCRIPTOR * );
	/*0180*/ void (* HalGetEnlightenmentInformation)( _HAL_INTEL_ENLIGHTENMENT_INFORMATION * );
	/*0188*/ void * (* HalAllocateEarlyPages)( _LOADER_PARAMETER_BLOCK * , ULONG , ULONGLONG * , ULONG );
	/*0190*/ void * (* HalMapEarlyPages)( ULONGLONG , ULONG , ULONG );
	/*0198*/ void * Dummy1;
	/*01a0*/ void * Dummy2;
	/*01a8*/ void (* HalNotifyProcessorFreeze)( UCHAR , UCHAR );
	/*01b0*/ LONG (* HalPrepareProcessorForIdle)( ULONG );
	/*01b8*/ void (* HalRegisterLogRoutine)( _HAL_LOG_REGISTER_CONTEXT * );
	/*01c0*/ void (* HalResumeProcessorFromIdle)();
	/*01c8*/ void * Dummy;
	/*01d0*/ ULONG (* HalVectorToIDTEntryEx)( ULONG );
	/*01d8*/ LONG (* HalSecondaryInterruptQueryPrimaryInformation)( _INTERRUPT_VECTOR_DATA * , ULONG * );
	/*01e0*/ LONG (* HalMaskInterrupt)( ULONG , ULONG );
	/*01e8*/ LONG (* HalUnmaskInterrupt)( ULONG , ULONG );
	/*01f0*/ UCHAR (* HalIsInterruptTypeSecondary)( ULONG , ULONG );
	/*01f8*/ LONG (* HalAllocateGsivForSecondaryInterrupt)( CHAR * , USHORT , ULONG * );
	/*0200*/ LONG (* HalAddInterruptRemapping)( ULONG , ULONG , _PCI_BUSMASTER_DESCRIPTOR * , UCHAR , _INTERRUPT_VECTOR_DATA * , ULONG );
	/*0208*/ void (* HalRemoveInterruptRemapping)( ULONG , ULONG , _PCI_BUSMASTER_DESCRIPTOR * , UCHAR , _INTERRUPT_VECTOR_DATA * , ULONG );
	/*0210*/ void (* HalSaveAndDisableHvEnlightenment)();
	/*0218*/ void (* HalRestoreHvEnlightenment)();
	/*0220*/ void (* HalFlushIoBuffersExternalCache)( _MDL * , UCHAR );
	/*0228*/ void (* HalFlushExternalCache)( UCHAR );
	/*0230*/ LONG (* HalPciEarlyRestore)( _SYSTEM_POWER_STATE );
	/*0238*/ LONG (* HalGetProcessorId)( ULONG , ULONG * , ULONG * );
	/*0240*/ LONG (* HalAllocatePmcCounterSet)( ULONG , _KPROFILE_SOURCE * , ULONG , _HAL_PMC_COUNTERS * * );
	/*0248*/ void (* HalCollectPmcCounters)( _HAL_PMC_COUNTERS * , ULONGLONG * );
	/*0250*/ void (* HalFreePmcCounterSet)( _HAL_PMC_COUNTERS * );
	/*0258*/ LONG (* HalProcessorHalt)( ULONG , void * , LONG (* )( void * ));
	/*0260*/ ULONGLONG (* HalTimerQueryCycleCounter)( ULONGLONG * );
	/*0268*/ void * Dummy3;
	/*0270*/ void (* HalPciMarkHiberPhase)();
	/*0278*/ LONG (* HalQueryProcessorRestartEntryPoint)( _LARGE_INTEGER * );
	/*0280*/ LONG (* HalRequestInterrupt)( ULONG );
	/*0288*/ LONG (* HalEnumerateUnmaskedInterrupts)( UCHAR (* )( void * , _HAL_UNMASKED_INTERRUPT_INFORMATION * ), void * , _HAL_UNMASKED_INTERRUPT_INFORMATION * );
	/*0290*/ void (* HalFlushAndInvalidatePageExternalCache)( _LARGE_INTEGER );
	/*0298*/ LONG (* KdEnumerateDebuggingDevices)( void * , _DEBUG_DEVICE_DESCRIPTOR * , KD_CALLBACK_ACTION (* )( _DEBUG_DEVICE_DESCRIPTOR * ));
	/*02a0*/ void (* HalFlushIoRectangleExternalCache)( _MDL * , ULONG , ULONG , ULONG , ULONG , UCHAR );
	/*02a8*/ void (* HalPowerEarlyRestore)( ULONG );
	/*02b0*/ LONG (* HalQueryCapsuleCapabilities)( void * , ULONG , ULONGLONG * , ULONG * );
	/*02b8*/ LONG (* HalUpdateCapsule)( void * , ULONG , _LARGE_INTEGER );
	/*02c0*/ UCHAR (* HalPciMultiStageResumeCapable)();
	/*02c8*/ void (* HalDmaFreeCrashDumpRegisters)( ULONG );
	/*02d0*/ UCHAR (* HalAcpiAoacCapable)();
	/*02d8*/ LONG (* HalInterruptSetDestination)( _INTERRUPT_VECTOR_DATA * , _GROUP_AFFINITY * , ULONG * );
	/*02e0*/ void (* HalGetClockConfiguration)( _HAL_CLOCK_TIMER_CONFIGURATION * );
	/*02e8*/ void (* HalClockTimerActivate)( UCHAR );
	/*02f0*/ void (* HalClockTimerInitialize)();
	/*02f8*/ void (* HalClockTimerStop)();
	/*0300*/ LONG (* HalClockTimerArm)( _HAL_CLOCK_TIMER_MODE , ULONGLONG , ULONGLONG * );
	/*0308*/ UCHAR (* HalTimerOnlyClockInterruptPending)();
	/*0310*/ void * (* HalAcpiGetMultiNode)();
	/*0318*/ void (* (* HalPowerSetRebootHandler)( void (* )( ULONG , LONG volatile * )))( ULONG , LONG volatile * );
	/*0320*/ void (* HalIommuRegisterDispatchTable)( _HAL_IOMMU_DISPATCH * );
	/*0328*/ void (* HalTimerWatchdogStart)();
	/*0330*/ void (* HalTimerWatchdogResetCountdown)();
	/*0338*/ void (* HalTimerWatchdogStop)();
	/*0340*/ UCHAR (* HalTimerWatchdogGeneratedLastReset)();
	/*0348*/ LONG (* HalTimerWatchdogTriggerSystemReset)( UCHAR );
	/*0350*/ LONG (* HalInterruptVectorDataToGsiv)( _INTERRUPT_VECTOR_DATA * , ULONG * );
	/*0358*/ LONG (* HalInterruptGetHighestPriorityInterrupt)( ULONG * , UCHAR * );
	/*0360*/ LONG (* HalProcessorOn)( ULONG );
	/*0368*/ LONG (* HalProcessorOff)();
	/*0370*/ LONG (* HalProcessorFreeze)();
	/*0378*/ LONG (* HalDmaLinkDeviceObjectByToken)( ULONGLONG , _DEVICE_OBJECT * );
	/*0380*/ LONG (* HalDmaCheckAdapterToken)( ULONGLONG );
	/*0388*/ void * Dummy4;
	/*0390*/ LONG (* HalTimerConvertPerformanceCounterToAuxiliaryCounter)( ULONGLONG , ULONGLONG * , ULONGLONG * );
	/*0398*/ LONG (* HalTimerConvertAuxiliaryCounterToPerformanceCounter)( ULONGLONG , ULONGLONG * , ULONGLONG * );
	/*03a0*/ LONG (* HalTimerQueryAuxiliaryCounterFrequency)( ULONGLONG * );
	/*03a8*/ LONG (* HalConnectThermalInterrupt)( UCHAR (* )( _KINTERRUPT * , void * ));
	/*03b0*/ UCHAR (* HalIsEFIRuntimeActive)();
	/*03b8*/ UCHAR (* HalTimerQueryAndResetRtcErrors)( UCHAR );
	/*03c0*/ void (* HalAcpiLateRestore)();
	/*03c8*/ LONG (* KdWatchdogDelayExpiration)( ULONGLONG * );
	/*03d0*/ LONG (* HalGetProcessorStats)( _HAL_PROCESSOR_STAT_TYPE , ULONG , ULONG , ULONGLONG * );
	/*03d8*/ ULONGLONG (* HalTimerWatchdogQueryDueTime)();
	/*03e0*/ LONG (* HalConnectSyntheticInterrupt)( UCHAR (* )( _KINTERRUPT * , void * ));
	/*03e8*/ void (* HalPreprocessNmi)( ULONG );
	/*03f0*/ LONG (* HalEnumerateEnvironmentVariablesWithFilter)( ULONG , UCHAR (* )( _GUID const * , WCHAR const * ), void * , ULONG * );
	/*03f8*/ LONG (* HalCaptureLastBranchRecordStack)( ULONG , _HAL_LBR_ENTRY * , ULONG * );
	/*0400*/ UCHAR (* HalClearLastBranchRecordStack)();
	/*0408*/ LONG (* HalConfigureLastBranchRecord)( ULONG , ULONG );
	/*0410*/ UCHAR (* HalGetLastBranchInformation)( ULONG * , ULONG * );
	/*0418*/ void (* HalResumeLastBranchRecord)( UCHAR );
	/*0420*/ LONG (* HalStartLastBranchRecord)( ULONG , ULONG * );
	/*0428*/ LONG (* HalStopLastBranchRecord)( ULONG );
	/*0430*/ LONG (* HalIommuBlockDevice)( void * );
	/*0438*/ LONG (* HalIommuUnblockDevice)( _EXT_IOMMU_DEVICE_ID * , void * * );
	/*0440*/ LONG (* HalGetIommuInterface)( ULONG , _DMA_IOMMU_INTERFACE * );
	/*0448*/ LONG (* HalRequestGenericErrorRecovery)( void * , ULONG * );
	/*0450*/ LONG (* HalTimerQueryHostPerformanceCounter)( ULONGLONG * );
	/*0458*/ LONG (* HalTopologyQueryProcessorRelationships)( ULONG , ULONG , UCHAR * , UCHAR * , UCHAR * , ULONG * , ULONG * );
	/*0460*/ void (* HalInitPlatformDebugTriggers)();
	/*0468*/ void (* HalRunPlatformDebugTriggers)( UCHAR );
	/*0470*/ void * (* HalTimerGetReferencePage)();
	/*0478*/ LONG (* HalGetHiddenProcessorPowerInterface)( _HIDDEN_PROCESSOR_POWER_INTERFACE * );
	/*0480*/ ULONG (* HalGetHiddenProcessorPackageId)( ULONG );
	/*0488*/ ULONG (* HalGetHiddenPackageProcessorCount)( ULONG );
	/*0490*/ LONG (* HalGetHiddenProcessorApicIdByIndex)( ULONG , ULONG * );
	/*0498*/ LONG (* HalRegisterHiddenProcessorIdleState)( ULONG , ULONGLONG );
	/*04a0*/
};

enum HSTORAGE_TYPE {
	Stable = 0x0,
	Volatile = 0x1,
	InvalidStorage = 0x2
};

enum INTERRUPT_CONNECTION_TYPE {
	InterruptTypeControllerInput = 0x0,
	InterruptTypeXapicMessage = 0x1,
	InterruptTypeHypertransport = 0x2,
	InterruptTypeMessageRequest = 0x3
};

enum IRPLOCK {
	IRPLOCK_CANCELABLE = 0x0,
	IRPLOCK_CANCEL_STARTED = 0x1,
	IRPLOCK_CANCEL_COMPLETE = 0x2,
	IRPLOCK_COMPLETED = 0x3
};

enum JOB_OBJECT_IO_RATE_CONTROL_FLAGS {
	JOB_OBJECT_IO_RATE_CONTROL_ENABLE = 0x1,
	JOB_OBJECT_IO_RATE_CONTROL_STANDALONE_VOLUME = 0x2,
	JOB_OBJECT_IO_RATE_CONTROL_FORCE_UNIT_ACCESS_ALL = 0x4,
	JOB_OBJECT_IO_RATE_CONTROL_FORCE_UNIT_ACCESS_ON_SOFT_CAP = 0x8,
	JOB_OBJECT_IO_RATE_CONTROL_VALID_FLAGS = 0xf
};

enum JOB_OBJECT_NET_RATE_CONTROL_FLAGS {
	JOB_OBJECT_NET_RATE_CONTROL_ENABLE = 0x1,
	JOB_OBJECT_NET_RATE_CONTROL_MAX_BANDWIDTH = 0x2,
	JOB_OBJECT_NET_RATE_CONTROL_DSCP_TAG = 0x4,
	JOB_OBJECT_NET_RATE_CONTROL_VALID_FLAGS = 0x7
};

enum KD_CALLBACK_ACTION {
	KdConfigureDeviceAndContinue = 0x0,
	KdSkipDeviceAndContinue = 0x1,
	KdConfigureDeviceAndStop = 0x2,
	KdSkipDeviceAndStop = 0x3
};

enum KD_NAMESPACE_ENUM {
	KdNameSpacePCI = 0x0,
	KdNameSpaceACPI = 0x1,
	KdNameSpaceAny = 0x2,
	KdNameSpaceNone = 0x3,
	KdNameSpaceMax = 0x4
};

enum KTM_STATE {
	KKtmUninitialized = 0x0,
	KKtmInitialized = 0x1,
	KKtmRecovering = 0x2,
	KKtmOnline = 0x3,
	KKtmRecoveryFailed = 0x4,
	KKtmOffline = 0x5
};

struct LIST_ENTRY32 {
	/*0000*/ ULONG Flink;
	/*0004*/ ULONG Blink;
	/*0008*/
};

struct LIST_ENTRY64 {
	/*0000*/ ULONGLONG Flink;
	/*0008*/ ULONGLONG Blink;
	/*0010*/
};

enum LSA_FOREST_TRUST_RECORD_TYPE {
	ForestTrustTopLevelName = 0x0,
	ForestTrustTopLevelNameEx = 0x1,
	ForestTrustDomainInfo = 0x2,
	ForestTrustRecordTypeLast = 0x2
};

enum PDCCLIENTID {
	PDC_INVALID_CLIENT = 0x0,
	PDC_PLM_CLIENT = 0x1,
	PDC_NQM_CLIENT = 0x2,
	PDC_WNS_CLIENT = 0x3,
	PDC_DAM_CLIENT = 0x4,
	PDC_WCM_CLIENT = 0x5,
	PDC_NCSI_CLIENT = 0x7,
	PDC_DHCP_CLIENT = 0x8,
	PDC_TCPIP_CLIENT = 0x9,
	PDC_WU_CLIENT = 0xb,
	PDC_GP_CLIENT = 0xc,
	PDC_NCA_CLIENT = 0xe,
	PDC_BI_CLIENT = 0xf,
	PDC_MSCHED_CLIENT = 0x10,
	PDC_SUSPENDRESUME_CLIENT = 0x11,
	PDC_INTERNAL_CLIENT = 0x12,
	PDC_ACTIVATION_TEST_CLIENT = 0x13,
	PDC_PLM_PHASE_TEST_CLIENT = 0x14,
	PDC_DAM_PHASE_TEST_CLIENT = 0x15,
	PDC_LOW_POWER_PHASE_TEST_CLIENT = 0x16,
	PDC_RESILIENCY_NOTIFICATION_PHASE_TEST_CLIENT = 0x17,
	PDC_NQM_RESILIENCY_TEST_CLIENT = 0x18,
	PDC_DAM_RESILIENCY_TEST_CLIENT = 0x19,
	PDC_DAM_KM_TEST_CLIENT = 0x1a,
	PDC_DAM_UM_TEST_CLIENT = 0x1b,
	PDC_SINGLETON_TEST_CLIENT = 0x1c,
	PDC_NETWORK_SERVICE_TEST_CLIENT = 0x1d,
	PDC_NETWORK_SERVICE2_TEST_CLIENT = 0x1e,
	PDC_SYSTEM_SERVICE_TEST_CLIENT = 0x1f,
	PDC_ACTIV_NOTIF_DAM_RESIL_TEST_CLIENT = 0x20,
	PDC_ACTIV_NOTIF_NET_RESIL_TEST_CLIENT = 0x21,
	PDC_SHELL_CLIENT = 0x22,
	PDC_MAINTENANCE_CLIENT = 0x23,
	PDC_SYNC_CLIENT = 0x24,
	PDC_IDM_CLIENT = 0x25,
	PDC_CORTANA_VOICE_ACTIVATION_CLIENT = 0x26,
	PDC_TETHERING_CLIENT = 0x27,
	PDC_AUDIO_CLIENT = 0x28,
	PDC_LOCK_SCREEN = 0x29,
	PDC_LREC_CLIENT = 0x2a,
	PDC_WP_BW_CLIENT = 0x2b,
	PDC_WP_MEDIA_STREAMING_CLIENT = 0x2c,
	PDC_WP_MAPS_CLIENT = 0x2e,
	PDC_WP_SYNC_CLIENT = 0x2f,
	PDC_SETTING_SYNC_CLIENT = 0x30,
	PDC_WP_EDM_CLIENT = 0x31,
	PDC_WP_WALLET_CLIENT = 0x32,
	PDC_WP_LOCATION_CLIENT = 0x33,
	PDC_WP_CM_CLIENT = 0x35,
	PDC_WP_DCP_CLIENT = 0x36,
	PDC_WP_WIFIAUTO_CLIENT = 0x37,
	PDC_BITLOCKER_CLIENT = 0x38,
	PDC_MDM_CERTINSTALLER_CLIENT = 0x39,
	PDC_WP_IM_CLIENT = 0x3a,
	PDC_WP_MMS_CLIENT = 0x3b,
	PDC_DEVICEENROLLER_CLIENT = 0x3c,
	PDC_WP_WIFI_SCANNING_CLIENT = 0x3d,
	PDC_WP_OMADM_CLIENT = 0x3e,
	PDC_WP_TELEMETRY_CHECK_CLIENT = 0x3f,
	PDC_WP_DIS_CLIENT = 0x40,
	PDC_BITS_CLIENT = 0x41,
	PDC_WP_VOIP_EXECUTION_CLIENT = 0x42,
	PDC_WP_RESERVED_CLIENT3 = 0x43,
	PDC_SLEEP_STUDY_CLIENT = 0x44,
	PDC_WP_AUTOTIMEUPDATE_CLIENT = 0x45,
	PDC_HYPERV_CLIENT = 0x46,
	PDC_KM_SIGNAL_CLIENT = 0x47,
	PDC_UM_SIGNAL_CLIENT = 0x48,
	PDC_DEVICE_HEALTH_ATTESTATION_CLIENT = 0x49,
	PDC_XB_SYSTEM_CLIENT = 0x4a,
	PDC_XB_HOST_CLIENT = 0x4b,
	PDC_PRINT_JOB_MANAGER_CLIENT = 0x4c,
	PDC_TELEMETRY_CLIENT = 0x4d,
	PDC_ERROR_REPORTING_CLIENT = 0x4e,
	PDC_XBOX_NTM = 0x4f,
	PDC_CBE_CLIENT = 0x50,
	PDC_FIND_MY_PHONE_CLIENT = 0x51,
	PDC_COMMAND_CHANNEL_CLIENT = 0x52,
	PDC_PPM_PROFILES_CLIENT = 0x53,
	PDC_WIFI_CALLING_CLIENT = 0x54,
	PDC_WU_REBOOT_CLIENT = 0x55,
	PDC_SYSMAIN_CLIENT = 0x56,
	PDC_XBOX_UPDATE_CLIENT = 0x57,
	PDC_CHAT_SERVICE_CLIENT = 0x58,
	PDC_FIND_MY_DEVICE_CLIENT = 0x59,
	PDC_NOTIFICATION_FORWARDING_AND_ACTION_CLIENT = 0x5a,
	PDC_INSTALL_AGENT_CLIENT = 0x5b,
	PDC_XBOX_WAKE_ON_VOICE = 0x5c,
	PDC_PLM_AUDIO_CLIENT = 0x5d,
	PDC_WP_BCKAUDIO_CLIENT = 0x5e,
	PDC_WAKE_ON_LAN_CLIENT = 0x5f,
	PDC_WP_CLOUD_MESSAGING_CLIENT = 0x60,
	PDC_DATA_MIGRATION_MANAGER = 0x61,
	PDC_EVENT_SOUND_MANAGER_CLIENT = 0x62,
	PDC_WWAN_DORMANCY_HINT_CLIENT = 0x63,
	PDC_HAM_CLIENT = 0x64,
	PDC_FILESHARINGSERVER_CLIENT = 0x65,
	PDC_DIRECTED_DRIPS_TASK_CLIENT = 0x66,
	PDC_DIRECTED_DRIPS_LPE_CLIENT = 0x67,
	PDC_DIRECTED_DRIPS_PLM_CLIENT = 0x68,
	PDC_HTTPSDATASOURCE_CLIENT = 0x69,
	PDC_TERMINALSERVER_CONNECTION_CLIENT = 0x6a,
	PDC_TERMINALSERVER_SESSION_CLIENT = 0x6b,
	PDC_ANYNETWORK_RESILIENCY_CLIENT = 0x6c,
	PDC_XBOX_NUI_CLIENT = 0x6e,
	PDC_WIFI_CALLING_IMS_CLIENT = 0x6f,
	PDC_SLEEPSTUDY_HELPER_USER_CLIENT = 0x70,
	PDC_SLEEPSTUDY_HELPER_KERNEL_CLIENT = 0x71,
	PDC_NUMBER_OF_CLIENTS = 0x72
};

enum PDC_ACTIVITY_TYPE {
	PdcNetwork = 0x0,
	PdcSystem = 0x1,
	PdcTimer = 0x2,
	PdcAllNetworks = 0x3,
	PdcAnyNetwork = 0x4,
	PdcInvalidActivity = 0x5,
	PdcMaxActivity = 0x5
};

enum PDC_CS_PHASE {
	PdcNoCsPhase = 0x0,
	PdcConnectionPhase = 0x1,
	PdcShellPhase = 0x2,
	PdcPlmPhase = 0x3,
	PdcMaintenancePhase = 0x4,
	PdcDamPhase = 0x5,
	PdcLowPowerPhase = 0x6,
	PdcResiliencyNotificationPhase = 0x7,
	PdcResiliencyPhase = 0x8,
	PdcInvalidPhase = 0x9,
	PdcMaxPhase = 0x9
};

enum PDC_RESOURCE {
	PdcResourceSystemForeground = 0x0,
	PdcResourceUniversalApplications = 0x1,
	PdcResourceWin32 = 0x2,
	PdcResourceNetwork = 0x3,
	PdcResourceSystemBackground = 0x4,
	PdcResourceMin = 0x0,
	PdcResourceMax = 0x4
};

struct PEPHANDLE__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct POHANDLE__ {
	/*0000*/ INT unused;
	/*0004*/
};

enum POWER_ACTION {
	PowerActionNone = 0x0,
	PowerActionReserved = 0x1,
	PowerActionSleep = 0x2,
	PowerActionHibernate = 0x3,
	PowerActionShutdown = 0x4,
	PowerActionShutdownReset = 0x5,
	PowerActionShutdownOff = 0x6,
	PowerActionWarmEject = 0x7,
	PowerActionDisplayOff = 0x8
};

struct POWER_ACTION_POLICY {
	/*0000*/ POWER_ACTION Action;
	/*0004*/ ULONG Flags;
	/*0008*/ ULONG EventCode;
	/*000c*/
};

enum POWER_POLICY_DEVICE_TYPE {
	PolicyDeviceSystemButton = 0x0,
	PolicyDeviceThermalZone = 0x1,
	PolicyDeviceBattery = 0x2,
	PolicyDeviceMemory = 0x3,
	PolicyInitiatePowerActionAPI = 0x4,
	PolicySetPowerStateAPI = 0x5,
	PolicyImmediateDozeS4 = 0x6,
	PolicySystemIdle = 0x7,
	PolicyDeviceWakeAlarm = 0x8,
	PolicyDeviceFan = 0x9,
	PolicyCsBatterySaver = 0xa,
	PolicyImmediateDozeS4Predicted = 0xb,
	PolicyImmediateDozeS4PredictedNoWake = 0xc,
	PolicyImmediateDozeS4AdaptiveBudget = 0xd,
	PolicyImmediateDozeS4AdaptiveReserveNoWake = 0xe,
	PolicySystemInitiatedShutdown = 0xf,
	PolicyDeviceMax = 0x10
};

struct PO_MEMORY_IMAGE {
	/*0000*/ ULONG Signature;
	/*0004*/ ULONG ImageType;
	/*0008*/ ULONG CheckSum;
	/*000c*/ ULONG LengthSelf;
	/*0010*/ ULONGLONG PageSelf;
	/*0018*/ ULONG PageSize;
	/*0020*/ _LARGE_INTEGER SystemTime;
	/*0028*/ ULONGLONG InterruptTime;
	/*0030*/ ULONGLONG FeatureFlags;
	/*0038*/ UCHAR HiberFlags;
	/*0039*/ UCHAR spare[0x3];
	/*003c*/ ULONG NoHiberPtes;
	/*0040*/ ULONGLONG HiberVa;
	/*0048*/ ULONG NoFreePages;
	/*004c*/ ULONG FreeMapCheck;
	/*0050*/ ULONG WakeCheck;
	/*0058*/ ULONGLONG NumPagesForLoader;
	/*0060*/ ULONGLONG FirstSecureRestorePage;
	/*0068*/ ULONGLONG FirstBootRestorePage;
	/*0070*/ ULONGLONG FirstKernelRestorePage;
	/*0078*/ ULONGLONG FirstChecksumRestorePage;
	/*0080*/ ULONGLONG NoChecksumEntries;
	/*0088*/ _PO_HIBER_PERF PerfInfo;
	/*0280*/ ULONG FirmwareRuntimeInformationPages;
	/*0288*/ ULONGLONG FirmwareRuntimeInformation[0x1];
	/*0290*/ ULONG SpareUlong;
	/*0294*/ ULONG NoBootLoaderLogPages;
	/*0298*/ ULONGLONG BootLoaderLogPages[0x18];
	/*0358*/ ULONG NotUsed;
	/*035c*/ ULONG ResumeContextCheck;
	/*0360*/ ULONG ResumeContextPages;
	/*0364*/ UCHAR Hiberboot;
	/*0365*/ UCHAR SecureLaunched;
	/*0366*/ UCHAR SecureBoot;
	/*0368*/ ULONGLONG HvPageTableRoot;
	/*0370*/ ULONGLONG HvEntryPoint;
	/*0378*/ ULONGLONG HvReservedTransitionAddress;
	/*0380*/ ULONGLONG HvReservedTransitionAddressSize;
	/*0388*/ ULONGLONG BootFlags;
	/*0390*/ ULONGLONG RestoreProcessorStateRoutine;
	/*0398*/ ULONGLONG HighestPhysicalPage;
	/*03a0*/ ULONGLONG BitlockerKeyPfns[0x4];
	/*03c0*/ ULONG HardwareSignature;
	/*03c8*/ _LARGE_INTEGER SMBiosTablePhysicalAddress;
	/*03d0*/ ULONG SMBiosTableLength;
	/*03d4*/ UCHAR SMBiosMajorVersion;
	/*03d5*/ UCHAR SMBiosMinorVersion;
	/*03d6*/ UCHAR HiberResumeXhciHandoffSkip;
	/*03d7*/ UCHAR InitializeUSBCore;
	/*03d8*/ UCHAR ValidUSBCoreId;
	/*03d9*/ UCHAR USBCoreId;
	/*03da*/ UCHAR SkipMemoryMapValidation;
	/*03e0*/
};

enum PPM_IDLE_BUCKET_TIME_TYPE {
	PpmIdleBucketTimeInQpc = 0x0,
	PpmIdleBucketTimeIn100ns = 0x1,
	PpmIdleBucketTimeMaximum = 0x2
};

struct PROCESSOR_IDLESTATE_INFO {
	/*0000*/ ULONG TimeCheck;
	/*0004*/ UCHAR DemotePercent;
	/*0005*/ UCHAR PromotePercent;
	/*0006*/ UCHAR Spare[0x2];
	/*0008*/
};

struct PROCESSOR_IDLESTATE_POLICY {
	/*0000*/ USHORT Revision;
	union {
		/*0002*/ USHORT AsUSHORT;
		/*0002*/ USHORT AllowScaling : 01; // 0x0001;
		/*0002*/ USHORT Disabled : 01; // 0x0002;
		/*0002*/ USHORT Reserved : 14; // 0xfffc;
		/*0004*/
	} Flags;
	/*0004*/ ULONG PolicyCount;
	/*0008*/ PROCESSOR_IDLESTATE_INFO Policy[0x3];
	/*0020*/
};

struct PROCESSOR_PERFSTATE_POLICY {
	/*0000*/ ULONG Revision;
	/*0004*/ UCHAR MaxThrottle;
	/*0005*/ UCHAR MinThrottle;
	/*0006*/ UCHAR BusyAdjThreshold;
	/*0007*/ UCHAR Spare;
	union {
		/*0007*/ UCHAR AsUCHAR;
		/*0007*/ UCHAR NoDomainAccounting : 01; // 0x01;
		/*0007*/ UCHAR IncreasePolicy : 02; // 0x06;
		/*0007*/ UCHAR DecreasePolicy : 02; // 0x18;
		/*0007*/ UCHAR Reserved : 03; // 0xe0;
		/*0008*/
	} Flags;
	/*0008*/ ULONG TimeCheck;
	/*000c*/ ULONG IncreaseTime;
	/*0010*/ ULONG DecreaseTime;
	/*0014*/ ULONG IncreasePercent;
	/*0018*/ ULONG DecreasePercent;
	/*001c*/
};

enum PROFILE_DEPARTURE_STYLE {
	PDS_UPDATE_DEFAULT = 0x1,
	PDS_UPDATE_ON_REMOVE = 0x2,
	PDS_UPDATE_ON_INTERFACE = 0x3,
	PDS_UPDATE_ON_EJECT = 0x4
};

enum PROFILE_STATUS {
	DOCK_NOTDOCKDEVICE = 0x0,
	DOCK_QUIESCENT = 0x1,
	DOCK_ARRIVING = 0x2,
	DOCK_DEPARTING = 0x3,
	DOCK_EJECTIRP_COMPLETED = 0x4
};

enum PS_CREATE_STATE {
	PsCreateInitialState = 0x0,
	PsCreateFailOnFileOpen = 0x1,
	PsCreateFailOnSectionCreate = 0x2,
	PsCreateFailExeFormat = 0x3,
	PsCreateFailMachineMismatch = 0x4,
	PsCreateFailExeName = 0x5,
	PsCreateSuccess = 0x6,
	PsCreateMaximumStates = 0x7
};

enum RTLP_CSPARSE_BITMAP_STATE {
	CommitBitmapInvalid = 0x0,
	UserBitmapInvalid = 0x1,
	UserBitmapValid = 0x2
};

union RTLP_HP_LFH_PERF_FLAGS {
	/*0000*/ ULONG HotspotDetection : 01; // 0x00000001;
	/*0000*/ ULONG HotspotFullCommit : 01; // 0x00000002;
	/*0000*/ ULONG ActiveSubsegment : 01; // 0x00000004;
	/*0000*/ ULONG SmallerSubsegment : 01; // 0x00000008;
	/*0000*/ ULONG SingleAffinitySlot : 01; // 0x00000010;
	/*0000*/ ULONG ApplyLfhDecommitPolicy : 01; // 0x00000020;
	/*0000*/ ULONG EnableGarbageCollection : 01; // 0x00000040;
	/*0000*/ ULONG LargePagePreCommit : 01; // 0x00000080;
	/*0000*/ ULONG OpportunisticLargePreCommit : 01; // 0x00000100;
	/*0000*/ ULONG LfhForcedAffinity : 01; // 0x00000200;
	/*0000*/ ULONG LfhCachelinePadding : 01; // 0x00000400;
	/*0000*/ ULONG AllFlags;
	/*0004*/
};

struct RTL_HP_ENV_HANDLE {
	/*0000*/ void * h[0x2];
	/*0010*/
};

enum ReplacesCorHdrNumericDefines {
	COMIMAGE_FLAGS_ILONLY = 0x1,
	COMIMAGE_FLAGS_32BITREQUIRED = 0x2,
	COMIMAGE_FLAGS_IL_LIBRARY = 0x4,
	COMIMAGE_FLAGS_STRONGNAMESIGNED = 0x8,
	COMIMAGE_FLAGS_NATIVE_ENTRYPOINT = 0x10,
	COMIMAGE_FLAGS_TRACKDEBUGDATA = 0x10000,
	COMIMAGE_FLAGS_32BITPREFERRED = 0x20000,
	COR_VERSION_MAJOR_V2 = 0x2,
	COR_VERSION_MAJOR = 0x2,
	COR_VERSION_MINOR = 0x5,
	COR_DELETED_NAME_LENGTH = 0x8,
	COR_VTABLEGAP_NAME_LENGTH = 0x8,
	NATIVE_TYPE_MAX_CB = 0x1,
	COR_ILMETHOD_SECT_SMALL_MAX_DATASIZE = 0xff,
	IMAGE_COR_MIH_METHODRVA = 0x1,
	IMAGE_COR_MIH_EHRVA = 0x2,
	IMAGE_COR_MIH_BASICBLOCK = 0x8,
	COR_VTABLE_32BIT = 0x1,
	COR_VTABLE_64BIT = 0x2,
	COR_VTABLE_FROM_UNMANAGED = 0x4,
	COR_VTABLE_FROM_UNMANAGED_RETAIN_APPDOMAIN = 0x8,
	COR_VTABLE_CALL_MOST_DERIVED = 0x10,
	IMAGE_COR_EATJ_THUNK_SIZE = 0x20,
	MAX_CLASS_NAME = 0x400,
	MAX_PACKAGE_NAME = 0x400
};

enum SE_WS_APPX_SIGNATURE_ORIGIN {
	SE_WS_APPX_SIGNATURE_ORIGIN_NOT_VALIDATED = 0x0,
	SE_WS_APPX_SIGNATURE_ORIGIN_UNKNOWN = 0x1,
	SE_WS_APPX_SIGNATURE_ORIGIN_APPSTORE = 0x2,
	SE_WS_APPX_SIGNATURE_ORIGIN_WINDOWS = 0x3,
	SE_WS_APPX_SIGNATURE_ORIGIN_ENTERPRISE = 0x4
};

enum SLEEPSTUDY_SPM_SCENARIO_CS_EXIT {
	SpmScenarioStopReasonUnspecified = 0x10,
	SpmScenarioStopReasonCsExit = 0x11,
	SpmScenarioStopReasonMax = 0x12
};

struct SYSTEM_POWER_CAPABILITIES {
	/*0000*/ UCHAR PowerButtonPresent;
	/*0001*/ UCHAR SleepButtonPresent;
	/*0002*/ UCHAR LidPresent;
	/*0003*/ UCHAR SystemS1;
	/*0004*/ UCHAR SystemS2;
	/*0005*/ UCHAR SystemS3;
	/*0006*/ UCHAR SystemS4;
	/*0007*/ UCHAR SystemS5;
	/*0008*/ UCHAR HiberFilePresent;
	/*0009*/ UCHAR FullWake;
	/*000a*/ UCHAR VideoDimPresent;
	/*000b*/ UCHAR ApmPresent;
	/*000c*/ UCHAR UpsPresent;
	/*000d*/ UCHAR ThermalControl;
	/*000e*/ UCHAR ProcessorThrottle;
	/*000f*/ UCHAR ProcessorMinThrottle;
	/*0010*/ UCHAR ProcessorMaxThrottle;
	/*0011*/ UCHAR FastSystemS4;
	/*0012*/ UCHAR Hiberboot;
	/*0013*/ UCHAR WakeAlarmPresent;
	/*0014*/ UCHAR AoAc;
	/*0015*/ UCHAR DiskSpinDown;
	/*0016*/ UCHAR HiberFileType;
	/*0017*/ UCHAR AoAcConnectivitySupported;
	/*0018*/ UCHAR spare3[0x6];
	/*001e*/ UCHAR SystemBatteriesPresent;
	/*001f*/ UCHAR BatteriesAreShortTerm;
	/*0020*/ BATTERY_REPORTING_SCALE BatteryScale[0x3];
	/*0038*/ _SYSTEM_POWER_STATE AcOnLineWake;
	/*003c*/ _SYSTEM_POWER_STATE SoftLidWake;
	/*0040*/ _SYSTEM_POWER_STATE RtcWake;
	/*0044*/ _SYSTEM_POWER_STATE MinDeviceWakeState;
	/*0048*/ _SYSTEM_POWER_STATE DefaultLowLatencyWake;
	/*004c*/
};

enum SYSTEM_POWER_CONDITION {
	PoAc = 0x0,
	PoDc = 0x1,
	PoHot = 0x2,
	PoConditionMaximum = 0x3
};

struct SYSTEM_POWER_LEVEL {
	/*0000*/ UCHAR Enable;
	/*0001*/ UCHAR Spare[0x3];
	/*0004*/ ULONG BatteryLevel;
	/*0008*/ POWER_ACTION_POLICY PowerPolicy;
	/*0014*/ _SYSTEM_POWER_STATE MinSystemState;
	/*0018*/
};

enum TlgIn_t {
	TlgInNULL = 0x0,
	TlgInUNICODESTRING = 0x1,
	TlgInANSISTRING = 0x2,
	TlgInINT8 = 0x3,
	TlgInUINT8 = 0x4,
	TlgInINT16 = 0x5,
	TlgInUINT16 = 0x6,
	TlgInINT32 = 0x7,
	TlgInUINT32 = 0x8,
	TlgInINT64 = 0x9,
	TlgInUINT64 = 0xa,
	TlgInFLOAT = 0xb,
	TlgInDOUBLE = 0xc,
	TlgInBOOL32 = 0xd,
	TlgInBINARY = 0xe,
	TlgInGUID = 0xf,
	_TlgInPOINTER_unsupported = 0x10,
	TlgInFILETIME = 0x11,
	TlgInSYSTEMTIME = 0x12,
	TlgInSID = 0x13,
	TlgInHEXINT32 = 0x14,
	TlgInHEXINT64 = 0x15,
	TlgInCOUNTEDSTRING = 0x16,
	TlgInCOUNTEDANSISTRING = 0x17,
	_TlgInSTRUCT = 0x18,
	TlgInCOUNTEDBINARY = 0x19,
	_TlgInMax = 0x1a,
	TlgInINTPTR = 0x9,
	TlgInUINTPTR = 0xa,
	TlgInPOINTER = 0x15,
	_TlgInCcount = 0x20,
	TlgInVcount = 0x40,
	_TlgInChain = 0x80,
	_TlgInCustom = 0x60,
	_TlgInTypeMask = 0x1f,
	_TlgInCountMask = 0x60,
	_TlgInFlagMask = 0xe0
};

enum TlgOut_t {
	TlgOutNULL = 0x0,
	TlgOutNOPRINT = 0x1,
	TlgOutSTRING = 0x2,
	TlgOutBOOLEAN = 0x3,
	TlgOutHEX = 0x4,
	TlgOutPID = 0x5,
	TlgOutTID = 0x6,
	TlgOutPORT = 0x7,
	TlgOutIPV4 = 0x8,
	TlgOutIPV6 = 0x9,
	TlgOutSOCKETADDRESS = 0xa,
	TlgOutXML = 0xb,
	TlgOutJSON = 0xc,
	TlgOutWIN32ERROR = 0xd,
	TlgOutNTSTATUS = 0xe,
	TlgOutHRESULT = 0xf,
	TlgOutFILETIME = 0x10,
	TlgOutSIGNED = 0x11,
	TlgOutUNSIGNED = 0x12,
	TlgOutUTF8 = 0x23,
	TlgOutPKCS7_WITH_TYPE_INFO = 0x24,
	TlgOutCODE_POINTER = 0x25,
	TlgOutDATETIME_UTC = 0x26,
	_TlgOutMax = 0x27,
	_TlgOutChain = 0x80,
	_TlgOutTypeMask = 0x7f
};

enum UoWActionType {
	UoWAddThisKey = 0x0,
	UoWAddChildKey = 0x1,
	UoWDeleteThisKey = 0x2,
	UoWDeleteChildKey = 0x3,
	UoWSetValueNew = 0x4,
	UoWSetValueExisting = 0x5,
	UoWDeleteValue = 0x6,
	UoWSetKeyUserFlags = 0x7,
	UoWSetLastWriteTime = 0x8,
	UoWSetSecurityDescriptor = 0x9,
	UoWRenameSubKey = 0xa,
	UoWRenameOldSubKey = 0xb,
	UoWRenameNewSubKey = 0xc,
	UoWIsolation = 0xd,
	UoWInvalid = 0xe
};

struct VACB_LEVEL_ALLOCATION_LIST {
	/*0000*/ _LIST_ENTRY VacbLevelList;
	/*0010*/ void * VacbLevelWithBcbListHeads;
	/*0018*/ ULONG VacbLevelsAllocated;
	/*0020*/
};

struct _ACCESS_REASONS {
	/*0000*/ ULONG Data[0x20];
	/*0080*/
};

struct _ACCESS_STATE {
	/*0000*/ _LUID OperationID;
	/*0008*/ UCHAR SecurityEvaluated;
	/*0009*/ UCHAR GenerateAudit;
	/*000a*/ UCHAR GenerateOnClose;
	/*000b*/ UCHAR PrivilegesAllocated;
	/*000c*/ ULONG Flags;
	/*0010*/ ULONG RemainingDesiredAccess;
	/*0014*/ ULONG PreviouslyGrantedAccess;
	/*0018*/ ULONG OriginalDesiredAccess;
	/*0020*/ _SECURITY_SUBJECT_CONTEXT SubjectSecurityContext;
	/*0040*/ void * SecurityDescriptor;
	/*0048*/ void * AuxData;
	union {
		/*0050*/ _INITIAL_PRIVILEGE_SET InitialPrivilegeSet;
		/*0050*/ _PRIVILEGE_SET PrivilegeSet;
		/*007c*/
	} Privileges;
	/*007c*/ UCHAR AuditPrivileges;
	/*0080*/ _UNICODE_STRING ObjectName;
	/*0090*/ _UNICODE_STRING ObjectTypeName;
	/*00a0*/
};

struct _ACL {
	/*0000*/ UCHAR AclRevision;
	/*0001*/ UCHAR Sbz1;
	/*0002*/ USHORT AclSize;
	/*0004*/ USHORT AceCount;
	/*0006*/ USHORT Sbz2;
	/*0008*/
};

struct _ACPI_METHOD_ARGUMENT_V1 {
	/*0000*/ USHORT Type;
	/*0002*/ USHORT DataLength;
	/*0004*/ ULONG Argument;
	/*0004*/ UCHAR Data[0x1];
	/*0008*/
};

struct _ACTIVATION_CONTEXT;

struct _ACTIVATION_CONTEXT_DATA;

struct _ACTIVATION_CONTEXT_STACK {
	/*0000*/ _RTL_ACTIVATION_CONTEXT_STACK_FRAME * ActiveFrame;
	/*0008*/ _LIST_ENTRY FrameListCache;
	/*0018*/ ULONG Flags;
	/*001c*/ ULONG NextCookieSequenceNumber;
	/*0020*/ ULONG StackId;
	/*0028*/
};

struct _ACTIVATION_CONTEXT_STACK32 {
	/*0000*/ ULONG ActiveFrame;
	/*0004*/ LIST_ENTRY32 FrameListCache;
	/*000c*/ ULONG Flags;
	/*0010*/ ULONG NextCookieSequenceNumber;
	/*0014*/ ULONG StackId;
	/*0018*/
};

struct _ACTIVATION_CONTEXT_STACK64 {
	/*0000*/ ULONGLONG ActiveFrame;
	/*0008*/ LIST_ENTRY64 FrameListCache;
	/*0018*/ ULONG Flags;
	/*001c*/ ULONG NextCookieSequenceNumber;
	/*0020*/ ULONG StackId;
	/*0028*/
};

struct _ADAPTER_OBJECT;

enum _ADD_DRIVER_STAGE {
	ClassConfigFilters = 0x0,
	LowerDeviceFilters = 0x1,
	LowerClassFilters = 0x2,
	DeviceService = 0x3,
	UpperDeviceFilters = 0x4,
	UpperClassFilters = 0x5,
	MaximumAddStage = 0x6
};

union _AER_BRIDGE_DESCRIPTOR_FLAGS {
	/*0000*/ USHORT UncorrectableErrorMaskRW : 01; // 0x0001;
	/*0000*/ USHORT UncorrectableErrorSeverityRW : 01; // 0x0002;
	/*0000*/ USHORT CorrectableErrorMaskRW : 01; // 0x0004;
	/*0000*/ USHORT AdvancedCapsAndControlRW : 01; // 0x0008;
	/*0000*/ USHORT SecondaryUncorrectableErrorMaskRW : 01; // 0x0010;
	/*0000*/ USHORT SecondaryUncorrectableErrorSevRW : 01; // 0x0020;
	/*0000*/ USHORT SecondaryCapsAndControlRW : 01; // 0x0040;
	/*0000*/ USHORT Reserved : 09; // 0xff80;
	/*0000*/ USHORT AsUSHORT;
	/*0002*/
};

union _AER_ENDPOINT_DESCRIPTOR_FLAGS {
	/*0000*/ USHORT UncorrectableErrorMaskRW : 01; // 0x0001;
	/*0000*/ USHORT UncorrectableErrorSeverityRW : 01; // 0x0002;
	/*0000*/ USHORT CorrectableErrorMaskRW : 01; // 0x0004;
	/*0000*/ USHORT AdvancedCapsAndControlRW : 01; // 0x0008;
	/*0000*/ USHORT Reserved : 12; // 0xfff0;
	/*0000*/ USHORT AsUSHORT;
	/*0002*/
};

union _AER_ROOTPORT_DESCRIPTOR_FLAGS {
	/*0000*/ USHORT UncorrectableErrorMaskRW : 01; // 0x0001;
	/*0000*/ USHORT UncorrectableErrorSeverityRW : 01; // 0x0002;
	/*0000*/ USHORT CorrectableErrorMaskRW : 01; // 0x0004;
	/*0000*/ USHORT AdvancedCapsAndControlRW : 01; // 0x0008;
	/*0000*/ USHORT RootErrorCommandRW : 01; // 0x0010;
	/*0000*/ USHORT Reserved : 11; // 0xffe0;
	/*0000*/ USHORT AsUSHORT;
	/*0002*/
};

struct _AGGREGATED_PAYLOAD_FILTER {
	/*0000*/ USHORT MagicValue : 12; // 0x0fff;
	/*0000*/ USHORT DescriptorVersion : 04; // 0xf000;
	/*0002*/ USHORT Size;
	/*0004*/ USHORT PredicateCount;
	/*0006*/ USHORT Reserved;
	/*0008*/ ULONGLONG HashedEventIdBitmap;
	/*0010*/ _GUID ProviderGuid;
	/*0020*/ USHORT EachEventTableOffset;
	/*0022*/ USHORT EachEventTableLength;
	/*0024*/ USHORT PayloadDecoderTableOffset;
	/*0026*/ USHORT PayloadDecoderTableLength;
	/*0028*/ USHORT EventFilterTableOffset;
	/*002a*/ USHORT EventFilterTableLength;
	/*002c*/ USHORT UNICODEStringTableOffset;
	/*002e*/ USHORT UNICODEStringTableLength;
	/*0030*/ USHORT ANSIStringTableOffset;
	/*0032*/ USHORT ANSIStringTableLength;
	/*0038*/ _EVENT_PAYLOAD_PREDICATE PredicateTable[0x1];
	/*0050*/
};

struct _ALPC_COMMUNICATION_INFO {
	/*0000*/ _ALPC_PORT * ConnectionPort;
	/*0008*/ _ALPC_PORT * ServerCommunicationPort;
	/*0010*/ _ALPC_PORT * ClientCommunicationPort;
	/*0018*/ _LIST_ENTRY CommunicationList;
	/*0028*/ _ALPC_HANDLE_TABLE HandleTable;
	/*0040*/ _KALPC_MESSAGE * CloseMessage;
	/*0048*/
};

struct _ALPC_COMPLETION_LIST {
	/*0000*/ _LIST_ENTRY Entry;
	/*0010*/ _EPROCESS * OwnerProcess;
	/*0018*/ _EX_PUSH_LOCK CompletionListLock;
	/*0020*/ _MDL * Mdl;
	/*0028*/ void * UserVa;
	/*0030*/ void * UserLimit;
	/*0038*/ void * DataUserVa;
	/*0040*/ void * SystemVa;
	/*0048*/ ULONGLONG TotalSize;
	/*0050*/ _ALPC_COMPLETION_LIST_HEADER * Header;
	/*0058*/ void * List;
	/*0060*/ ULONGLONG ListSize;
	/*0068*/ void * Bitmap;
	/*0070*/ ULONGLONG BitmapSize;
	/*0078*/ void * Data;
	/*0080*/ ULONGLONG DataSize;
	/*0088*/ ULONG BitmapLimit;
	/*008c*/ ULONG BitmapNextHint;
	/*0090*/ ULONG ConcurrencyCount;
	/*0094*/ ULONG AttributeFlags;
	/*0098*/ ULONG AttributeSize;
	/*00a0*/
};

struct _ALPC_COMPLETION_LIST_HEADER {
	/*0000*/ ULONGLONG StartMagic;
	/*0008*/ ULONG TotalSize;
	/*000c*/ ULONG ListOffset;
	/*0010*/ ULONG ListSize;
	/*0014*/ ULONG BitmapOffset;
	/*0018*/ ULONG BitmapSize;
	/*001c*/ ULONG DataOffset;
	/*0020*/ ULONG DataSize;
	/*0024*/ ULONG AttributeFlags;
	/*0028*/ ULONG AttributeSize;
	/*0040*/ _ALPC_COMPLETION_LIST_STATE volatile State;
	/*0048*/ ULONG volatile LastMessageId;
	/*004c*/ ULONG volatile LastCallbackId;
	/*0080*/ ULONG volatile PostCount;
	/*00c0*/ ULONG volatile ReturnCount;
	/*0100*/ ULONG volatile LogSequenceNumber;
	/*0140*/ _RTL_SRWLOCK UserLock;
	/*0148*/ ULONGLONG EndMagic;
	/*0180*/
};

struct _ALPC_COMPLETION_LIST_STATE {
	union {
		struct {
			/*0000*/ ULONGLONG Head : 24; // 0x0000000000ffffff;
			/*0000*/ ULONGLONG Tail : 24; // 0x0000ffffff000000;
			/*0000*/ ULONGLONG ActiveThreadCount : 16; // 0xffff000000000000;
			/*0008*/
		} s1;
		/*0000*/ LONGLONG Value;
		/*0008*/
	} u1;
	/*0008*/
};

struct _ALPC_COMPLETION_PACKET_LOOKASIDE {
	/*0000*/ ULONGLONG Lock;
	/*0008*/ ULONG Size;
	/*000c*/ ULONG ActiveCount;
	/*0010*/ ULONG PendingNullCount;
	/*0014*/ ULONG PendingCheckCompletionListCount;
	/*0018*/ ULONG PendingDelete;
	/*0020*/ _SINGLE_LIST_ENTRY FreeListHead;
	/*0028*/ void * CompletionPort;
	/*0030*/ void * CompletionKey;
	/*0038*/ _ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY Entry[0x1];
	/*0050*/
};

struct _ALPC_COMPLETION_PACKET_LOOKASIDE_ENTRY {
	/*0000*/ _SINGLE_LIST_ENTRY ListEntry;
	/*0008*/ _IO_MINI_COMPLETION_PACKET_USER * Packet;
	/*0010*/ _ALPC_COMPLETION_PACKET_LOOKASIDE * Lookaside;
	/*0018*/
};

struct _ALPC_DISPATCH_CONTEXT {
	/*0000*/ _ALPC_PORT * PortObject;
	/*0008*/ _KALPC_MESSAGE * Message;
	/*0010*/ _ALPC_COMMUNICATION_INFO * CommunicationInfo;
	/*0018*/ _ETHREAD * TargetThread;
	/*0020*/ _ALPC_PORT * TargetPort;
	/*0028*/ _KALPC_DIRECT_EVENT DirectEvent;
	/*0030*/ ULONG Flags;
	/*0034*/ USHORT TotalLength;
	/*0036*/ USHORT Type;
	/*0038*/ USHORT DataInfoOffset;
	/*003a*/ UCHAR SignalCompletion;
	/*003b*/ UCHAR PostedToCompletionList;
	/*0040*/
};

struct _ALPC_HANDLE_ENTRY {
	/*0000*/ void * Object;
	/*0008*/
};

struct _ALPC_HANDLE_TABLE {
	/*0000*/ _ALPC_HANDLE_ENTRY * Handles;
	/*0008*/ ULONG TotalHandles;
	/*000c*/ ULONG Flags;
	/*0010*/ _EX_PUSH_LOCK Lock;
	/*0018*/
};

struct _ALPC_MESSAGE_ATTRIBUTES {
	/*0000*/ ULONG AllocatedAttributes;
	/*0004*/ ULONG ValidAttributes;
	/*0008*/
};

struct _ALPC_PORT {
	/*0000*/ _LIST_ENTRY PortListEntry;
	/*0010*/ _ALPC_COMMUNICATION_INFO * CommunicationInfo;
	/*0018*/ _EPROCESS * OwnerProcess;
	/*0020*/ void * CompletionPort;
	/*0028*/ void * CompletionKey;
	/*0030*/ _ALPC_COMPLETION_PACKET_LOOKASIDE * CompletionPacketLookaside;
	/*0038*/ void * PortContext;
	/*0040*/ _SECURITY_CLIENT_CONTEXT StaticSecurity;
	/*0088*/ _EX_PUSH_LOCK IncomingQueueLock;
	/*0090*/ _LIST_ENTRY MainQueue;
	/*00a0*/ _LIST_ENTRY LargeMessageQueue;
	/*00b0*/ _EX_PUSH_LOCK PendingQueueLock;
	/*00b8*/ _LIST_ENTRY PendingQueue;
	/*00c8*/ _EX_PUSH_LOCK DirectQueueLock;
	/*00d0*/ _LIST_ENTRY DirectQueue;
	/*00e0*/ _EX_PUSH_LOCK WaitQueueLock;
	/*00e8*/ _LIST_ENTRY WaitQueue;
	/*00f8*/ _KSEMAPHORE * Semaphore;
	/*00f8*/ _KEVENT * DummyEvent;
	/*0100*/ _ALPC_PORT_ATTRIBUTES PortAttributes;
	/*0148*/ _EX_PUSH_LOCK ResourceListLock;
	/*0150*/ _LIST_ENTRY ResourceListHead;
	/*0160*/ _EX_PUSH_LOCK PortObjectLock;
	/*0168*/ _ALPC_COMPLETION_LIST * CompletionList;
	/*0170*/ _CALLBACK_OBJECT * CallbackObject;
	/*0178*/ void * CallbackContext;
	/*0180*/ _LIST_ENTRY CanceledQueue;
	/*0190*/ LONG SequenceNo;
	/*0194*/ LONG ReferenceNo;
	/*0198*/ _PALPC_PORT_REFERENCE_WAIT_BLOCK * ReferenceNoWait;
	union {
		struct {
			/*01a0*/ ULONG Initialized : 01; // 0x00000001;
			/*01a0*/ ULONG Type : 02; // 0x00000006;
			/*01a0*/ ULONG ConnectionPending : 01; // 0x00000008;
			/*01a0*/ ULONG ConnectionRefused : 01; // 0x00000010;
			/*01a0*/ ULONG Disconnected : 01; // 0x00000020;
			/*01a0*/ ULONG Closed : 01; // 0x00000040;
			/*01a0*/ ULONG NoFlushOnClose : 01; // 0x00000080;
			/*01a0*/ ULONG ReturnExtendedInfo : 01; // 0x00000100;
			/*01a0*/ ULONG Waitable : 01; // 0x00000200;
			/*01a0*/ ULONG DynamicSecurity : 01; // 0x00000400;
			/*01a0*/ ULONG Wow64CompletionList : 01; // 0x00000800;
			/*01a0*/ ULONG Lpc : 01; // 0x00001000;
			/*01a0*/ ULONG LpcToLpc : 01; // 0x00002000;
			/*01a0*/ ULONG HasCompletionList : 01; // 0x00004000;
			/*01a0*/ ULONG HadCompletionList : 01; // 0x00008000;
			/*01a0*/ ULONG EnableCompletionList : 01; // 0x00010000;
			/*01a4*/
		} s1;
		/*01a0*/ ULONG State;
		/*01a4*/
	} u1;
	/*01a8*/ _ALPC_PORT * TargetQueuePort;
	/*01b0*/ _ALPC_PORT * TargetSequencePort;
	/*01b8*/ _KALPC_MESSAGE * CachedMessage;
	/*01c0*/ ULONG MainQueueLength;
	/*01c4*/ ULONG LargeMessageQueueLength;
	/*01c8*/ ULONG PendingQueueLength;
	/*01cc*/ ULONG DirectQueueLength;
	/*01d0*/ ULONG CanceledQueueLength;
	/*01d4*/ ULONG WaitQueueLength;
	/*01d8*/
};

struct _ALPC_PORT_ATTRIBUTES {
	/*0000*/ ULONG Flags;
	/*0004*/ _SECURITY_QUALITY_OF_SERVICE SecurityQos;
	/*0010*/ ULONGLONG MaxMessageLength;
	/*0018*/ ULONGLONG MemoryBandwidth;
	/*0020*/ ULONGLONG MaxPoolUsage;
	/*0028*/ ULONGLONG MaxSectionSize;
	/*0030*/ ULONGLONG MaxViewSize;
	/*0038*/ ULONGLONG MaxTotalSectionSize;
	/*0040*/ ULONG DupObjectTypes;
	/*0044*/ ULONG Reserved;
	/*0048*/
};

struct _ALPC_PROCESS_CONTEXT {
	/*0000*/ _EX_PUSH_LOCK Lock;
	/*0008*/ _LIST_ENTRY ViewListHead;
	/*0018*/ ULONGLONG volatile PagedPoolQuotaCache;
	/*0020*/
};

struct _ALPC_WORK_ON_BEHALF_TICKET {
	/*0000*/ ULONG ThreadId;
	/*0004*/ ULONG ThreadCreationTimeLow;
	/*0008*/
};

enum _ALTERNATIVE_ARCHITECTURE_TYPE {
	StandardDesign = 0x0,
	NEC98x86 = 0x1,
	EndAlternatives = 0x2
};

struct _AMD64_DBGKD_CONTROL_SET {
	/*0000*/ ULONG TraceFlag;
	/*0004*/ ULONGLONG Dr7;
	/*000c*/ ULONGLONG CurrentSymbolStart;
	/*0014*/ ULONGLONG CurrentSymbolEnd;
	/*001c*/
};

enum _ARBITER_ACTION {
	ArbiterActionTestAllocation = 0x0,
	ArbiterActionRetestAllocation = 0x1,
	ArbiterActionCommitAllocation = 0x2,
	ArbiterActionRollbackAllocation = 0x3,
	ArbiterActionQueryAllocatedResources = 0x4,
	ArbiterActionWriteReservedResources = 0x5,
	ArbiterActionQueryConflict = 0x6,
	ArbiterActionQueryArbitrate = 0x7,
	ArbiterActionAddReserved = 0x8,
	ArbiterActionBootAllocation = 0x9
};

struct _ARBITER_ADD_RESERVED_PARAMETERS {
	/*0000*/ _DEVICE_OBJECT * ReserveDevice;
	/*0008*/
};

struct _ARBITER_ALLOCATION_STATE {
	/*0000*/ ULONGLONG Start;
	/*0008*/ ULONGLONG End;
	/*0010*/ ULONGLONG CurrentMinimum;
	/*0018*/ ULONGLONG CurrentMaximum;
	/*0020*/ _ARBITER_LIST_ENTRY * Entry;
	/*0028*/ _ARBITER_ALTERNATIVE * CurrentAlternative;
	/*0030*/ ULONG AlternativeCount;
	/*0038*/ _ARBITER_ALTERNATIVE * Alternatives;
	/*0040*/ USHORT Flags;
	/*0042*/ UCHAR RangeAttributes;
	/*0043*/ UCHAR RangeAvailableAttributes;
	/*0048*/ ULONGLONG WorkSpace;
	/*0050*/
};

struct _ARBITER_ALTERNATIVE {
	/*0000*/ ULONGLONG Minimum;
	/*0008*/ ULONGLONG Maximum;
	/*0010*/ ULONGLONG Length;
	/*0018*/ ULONGLONG Alignment;
	/*0020*/ LONG Priority;
	/*0024*/ ULONG Flags;
	/*0028*/ _IO_RESOURCE_DESCRIPTOR * Descriptor;
	/*0030*/ ULONG Reserved[0x3];
	/*0040*/
};

struct _ARBITER_BOOT_ALLOCATION_PARAMETERS {
	/*0000*/ _LIST_ENTRY * ArbitrationList;
	/*0008*/
};

struct _ARBITER_CONFLICT_INFO {
	/*0000*/ _DEVICE_OBJECT * OwningObject;
	/*0008*/ ULONGLONG Start;
	/*0010*/ ULONGLONG End;
	/*0018*/
};

struct _ARBITER_INSTANCE {
	/*0000*/ ULONG Signature;
	/*0008*/ _KEVENT * MutexEvent;
	/*0010*/ WCHAR * Name;
	/*0018*/ WCHAR * OrderingName;
	/*0020*/ INT ResourceType;
	/*0028*/ _RTL_RANGE_LIST * Allocation;
	/*0030*/ _RTL_RANGE_LIST * PossibleAllocation;
	/*0038*/ _ARBITER_ORDERING_LIST OrderingList;
	/*0048*/ _ARBITER_ORDERING_LIST ReservedList;
	/*0058*/ LONG ReferenceCount;
	/*0060*/ _ARBITER_INTERFACE * Interface;
	/*0068*/ ULONG AllocationStackMaxSize;
	/*0070*/ _ARBITER_ALLOCATION_STATE * AllocationStack;
	/*0078*/ LONG (* UnpackRequirement)( _IO_RESOURCE_DESCRIPTOR * , ULONGLONG * , ULONGLONG * , ULONGLONG * , ULONGLONG * );
	/*0080*/ LONG (* PackResource)( _IO_RESOURCE_DESCRIPTOR * , ULONGLONG , _CM_PARTIAL_RESOURCE_DESCRIPTOR * );
	/*0088*/ LONG (* UnpackResource)( _CM_PARTIAL_RESOURCE_DESCRIPTOR * , ULONGLONG * , ULONGLONG * );
	/*0090*/ LONG (* ScoreRequirement)( _IO_RESOURCE_DESCRIPTOR * );
	/*0098*/ LONG (* TestAllocation)( _ARBITER_INSTANCE * , _ARBITER_TEST_ALLOCATION_PARAMETERS * );
	/*00a0*/ LONG (* RetestAllocation)( _ARBITER_INSTANCE * , _ARBITER_RETEST_ALLOCATION_PARAMETERS * );
	/*00a8*/ LONG (* CommitAllocation)( _ARBITER_INSTANCE * );
	/*00b0*/ LONG (* RollbackAllocation)( _ARBITER_INSTANCE * );
	/*00b8*/ LONG (* BootAllocation)( _ARBITER_INSTANCE * , _ARBITER_BOOT_ALLOCATION_PARAMETERS * );
	/*00c0*/ LONG (* QueryArbitrate)( _ARBITER_INSTANCE * , _ARBITER_QUERY_ARBITRATE_PARAMETERS * );
	/*00c8*/ LONG (* QueryConflict)( _ARBITER_INSTANCE * , _ARBITER_QUERY_CONFLICT_PARAMETERS * );
	/*00d0*/ LONG (* AddReserved)( _ARBITER_INSTANCE * , _ARBITER_ADD_RESERVED_PARAMETERS * );
	/*00d8*/ LONG (* StartArbiter)( _ARBITER_INSTANCE * , _CM_RESOURCE_LIST * );
	/*00e0*/ LONG (* PreprocessEntry)( _ARBITER_INSTANCE * , _ARBITER_ALLOCATION_STATE * );
	/*00e8*/ LONG (* AllocateEntry)( _ARBITER_INSTANCE * , _ARBITER_ALLOCATION_STATE * );
	/*00f0*/ UCHAR (* GetNextAllocationRange)( _ARBITER_INSTANCE * , _ARBITER_ALLOCATION_STATE * );
	/*00f8*/ UCHAR (* FindSuitableRange)( _ARBITER_INSTANCE * , _ARBITER_ALLOCATION_STATE * );
	/*0100*/ void (* AddAllocation)( _ARBITER_INSTANCE * , _ARBITER_ALLOCATION_STATE * );
	/*0108*/ void (* BacktrackAllocation)( _ARBITER_INSTANCE * , _ARBITER_ALLOCATION_STATE * );
	/*0110*/ UCHAR (* OverrideConflict)( _ARBITER_INSTANCE * , _ARBITER_ALLOCATION_STATE * );
	/*0118*/ LONG (* InitializeRangeList)( _ARBITER_INSTANCE * , ULONG , _CM_PARTIAL_RESOURCE_DESCRIPTOR * , _RTL_RANGE_LIST * );
	/*0120*/ LONG (* DeleteOwnerRanges)( _ARBITER_INSTANCE * , void * );
	/*0128*/ UCHAR TransactionInProgress;
	/*0130*/ _KEVENT * TransactionEvent;
	/*0138*/ void * Extension;
	/*0140*/ _DEVICE_OBJECT * BusDeviceObject;
	/*0148*/ void * ConflictCallbackContext;
	/*0150*/ UCHAR (* ConflictCallback)( void * , _RTL_RANGE * );
	/*0158*/
};

struct _ARBITER_INTERFACE {
	/*0000*/ USHORT Size;
	/*0002*/ USHORT Version;
	/*0008*/ void * Context;
	/*0010*/ void (* InterfaceReference)( void * );
	/*0018*/ void (* InterfaceDereference)( void * );
	/*0020*/ LONG (* ArbiterHandler)( void * , _ARBITER_ACTION , _ARBITER_PARAMETERS * );
	/*0028*/ ULONG Flags;
	/*0030*/
};

struct _ARBITER_LIST_ENTRY {
	/*0000*/ _LIST_ENTRY ListEntry;
	/*0010*/ ULONG AlternativeCount;
	/*0018*/ _IO_RESOURCE_DESCRIPTOR * Alternatives;
	/*0020*/ _DEVICE_OBJECT * PhysicalDeviceObject;
	/*0028*/ _ARBITER_REQUEST_SOURCE RequestSource;
	/*002c*/ ULONG Flags;
	/*0030*/ LONGLONG WorkSpace;
	/*0038*/ _INTERFACE_TYPE InterfaceType;
	/*003c*/ ULONG SlotNumber;
	/*0040*/ ULONG BusNumber;
	/*0048*/ _CM_PARTIAL_RESOURCE_DESCRIPTOR * Assignment;
	/*0050*/ _IO_RESOURCE_DESCRIPTOR * SelectedAlternative;
	/*0058*/ _ARBITER_RESULT Result;
	/*0060*/
};

struct _ARBITER_ORDERING {
	/*0000*/ ULONGLONG Start;
	/*0008*/ ULONGLONG End;
	/*0010*/
};

struct _ARBITER_ORDERING_LIST {
	/*0000*/ USHORT Count;
	/*0002*/ USHORT Maximum;
	/*0008*/ _ARBITER_ORDERING * Orderings;
	/*0010*/
};

struct _ARBITER_PARAMETERS {
	union {
		/*0000*/ _ARBITER_TEST_ALLOCATION_PARAMETERS TestAllocation;
		/*0000*/ _ARBITER_RETEST_ALLOCATION_PARAMETERS RetestAllocation;
		/*0000*/ _ARBITER_BOOT_ALLOCATION_PARAMETERS BootAllocation;
		/*0000*/ _ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS QueryAllocatedResources;
		/*0000*/ _ARBITER_QUERY_CONFLICT_PARAMETERS QueryConflict;
		/*0000*/ _ARBITER_QUERY_ARBITRATE_PARAMETERS QueryArbitrate;
		/*0000*/ _ARBITER_ADD_RESERVED_PARAMETERS AddReserved;
		/*0020*/
	} Parameters;
	/*0020*/
};

struct _ARBITER_QUERY_ALLOCATED_RESOURCES_PARAMETERS {
	/*0000*/ _CM_PARTIAL_RESOURCE_LIST * * AllocatedResources;
	/*0008*/
};

struct _ARBITER_QUERY_ARBITRATE_PARAMETERS {
	/*0000*/ _LIST_ENTRY * ArbitrationList;
	/*0008*/
};

struct _ARBITER_QUERY_CONFLICT_PARAMETERS {
	/*0000*/ _DEVICE_OBJECT * PhysicalDeviceObject;
	/*0008*/ _IO_RESOURCE_DESCRIPTOR * ConflictingResource;
	/*0010*/ ULONG * ConflictCount;
	/*0018*/ _ARBITER_CONFLICT_INFO * * Conflicts;
	/*0020*/
};

enum _ARBITER_REQUEST_SOURCE {
	ArbiterRequestUndefined = 0xffffffff,
	ArbiterRequestLegacyReported = 0x0,
	ArbiterRequestHalReported = 0x1,
	ArbiterRequestLegacyAssigned = 0x2,
	ArbiterRequestPnpDetected = 0x3,
	ArbiterRequestPnpEnumerated = 0x4
};

enum _ARBITER_RESULT {
	ArbiterResultUndefined = 0xffffffff,
	ArbiterResultSuccess = 0x0,
	ArbiterResultExternalConflict = 0x1,
	ArbiterResultNullRequest = 0x2
};

struct _ARBITER_RETEST_ALLOCATION_PARAMETERS {
	/*0000*/ _LIST_ENTRY * ArbitrationList;
	/*0008*/ ULONG AllocateFromCount;
	/*0010*/ _CM_PARTIAL_RESOURCE_DESCRIPTOR * AllocateFrom;
	/*0018*/
};

struct _ARBITER_TEST_ALLOCATION_PARAMETERS {
	/*0000*/ _LIST_ENTRY * ArbitrationList;
	/*0008*/ ULONG AllocateFromCount;
	/*0010*/ _CM_PARTIAL_RESOURCE_DESCRIPTOR * AllocateFrom;
	/*0018*/
};

struct _ARC_DISK_INFORMATION {
	/*0000*/ _LIST_ENTRY DiskSignatures;
	/*0010*/
};

struct _ARM64_DBGKD_CONTROL_SET {
	/*0000*/ ULONG Continue;
	/*0004*/ ULONG TraceFlag;
	/*0008*/ ULONGLONG CurrentSymbolStart;
	/*0010*/ ULONGLONG CurrentSymbolEnd;
	/*0018*/
};

struct _ARMCE_DBGKD_CONTROL_SET {
	/*0000*/ ULONG Continue;
	/*0004*/ ULONG CurrentSymbolStart;
	/*0008*/ ULONG CurrentSymbolEnd;
	/*000c*/
};

struct _ARM_DBGKD_CONTROL_SET {
	/*0000*/ ULONG Continue;
	/*0004*/ ULONG CurrentSymbolStart;
	/*0008*/ ULONG CurrentSymbolEnd;
	/*000c*/
};

struct _ARM_LOADER_BLOCK {
	/*0000*/ ULONG PlaceHolder;
	/*0004*/
};

struct _ASSEMBLY_STORAGE_MAP;

struct _ASYNC_READ_THREAD_STATS {
	/*0000*/ ULONG CurrentLoad[0x65];
	/*0194*/
};

struct _AUTHZBASEP_CLAIM_ATTRIBUTES_COLLECTION {
	/*0000*/ ULONG DeviceGroupsCount;
	/*0008*/ _SID_AND_ATTRIBUTES * pDeviceGroups;
	/*0010*/ ULONG RestrictedDeviceGroupsCount;
	/*0018*/ _SID_AND_ATTRIBUTES * pRestrictedDeviceGroups;
	/*0020*/ _SID_AND_ATTRIBUTES_HASH DeviceGroupsHash;
	/*0130*/ _SID_AND_ATTRIBUTES_HASH RestrictedDeviceGroupsHash;
	/*0240*/ _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION * pUserSecurityAttributes;
	/*0248*/ _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION * pDeviceSecurityAttributes;
	/*0250*/ _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION * pRestrictedUserSecurityAttributes;
	/*0258*/ _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION * pRestrictedDeviceSecurityAttributes;
	/*0260*/
};

struct _AUTHZBASEP_SECURITY_ATTRIBUTES_INFORMATION {
	/*0000*/ ULONG SecurityAttributeCount;
	/*0008*/ _LIST_ENTRY SecurityAttributesList;
	/*0018*/ ULONG WorkingSecurityAttributeCount;
	/*0020*/ _LIST_ENTRY WorkingSecurityAttributesList;
	/*0030*/
};

struct _AUX_ACCESS_DATA {
	/*0000*/ _PRIVILEGE_SET * PrivilegesUsed;
	/*0008*/ _GENERIC_MAPPING GenericMapping;
	/*0018*/ ULONG AccessesToAudit;
	/*001c*/ ULONG MaximumAuditMask;
	/*0020*/ _GUID TransactionId;
	/*0030*/ void * NewSecurityDescriptor;
	/*0038*/ void * ExistingSecurityDescriptor;
	/*0040*/ void * ParentSecurityDescriptor;
	/*0048*/ void (* DeRefSecurityDescriptor)( void * , void * );
	/*0050*/ void * SDLock;
	/*0058*/ _ACCESS_REASONS AccessReasons;
	/*00d8*/ UCHAR GenerateStagingEvents;
	/*00e0*/
};

struct _BITMAP_RANGE {
	/*0000*/ _LIST_ENTRY Links;
	/*0010*/ LONGLONG BasePage;
	/*0018*/ ULONG FirstDirtyPage;
	/*001c*/ ULONG LastDirtyPage;
	/*0020*/ ULONG DirtyPages;
	/*0028*/ ULONG * Bitmap;
	/*0030*/
};

struct _BLOB {
	/*0000*/ _LIST_ENTRY ResourceList;
	/*0000*/ _SLIST_ENTRY FreeListEntry;
	union {
		struct {
			/*0010*/ UCHAR ReferenceCache : 01; // 0x01;
			/*0010*/ UCHAR Lookaside : 01; // 0x02;
			/*0010*/ UCHAR Initializing : 01; // 0x04;
			/*0010*/ UCHAR Deleted : 01; // 0x08;
			/*0011*/
		} s1;
		/*0010*/ UCHAR Flags;
		/*0011*/
	} u1;
	/*0011*/ UCHAR ResourceId;
	/*0012*/ SHORT CachedReferences;
	/*0018*/ LONGLONG ReferenceCount;
	/*0020*/ _EX_PUSH_LOCK Lock;
	/*0030*/
};

struct _BLOB_COUNTERS {
	/*0000*/ ULONG CreatedObjects;
	/*0004*/ ULONG DeletedObjects;
	/*0008*/
};

enum _BLOB_ID {
	BLOB_TYPE_UNKNOWN = 0x0,
	BLOB_TYPE_CONNECTION_INFO = 0x1,
	BLOB_TYPE_MESSAGE = 0x2,
	BLOB_TYPE_SECURITY_CONTEXT = 0x3,
	BLOB_TYPE_SECTION = 0x4,
	BLOB_TYPE_REGION = 0x5,
	BLOB_TYPE_VIEW = 0x6,
	BLOB_TYPE_RESERVE = 0x7,
	BLOB_TYPE_DIRECT_TRANSFER = 0x8,
	BLOB_TYPE_HANDLE_DATA = 0x9,
	BLOB_TYPE_MAX_ID = 0xa
};

struct _BLOB_TYPE {
	/*0000*/ _BLOB_ID ResourceId;
	/*0004*/ ULONG PoolTag;
	/*0008*/ ULONG LookasideIndex;
	/*000c*/ ULONG Flags;
	/*0010*/ _BLOB_COUNTERS * Counters;
	/*0018*/ void (* CleanupProcedure)( void * );
	/*0020*/ void (* DeleteProcedure)( void * );
	/*0028*/ LONG (* DestroyProcedure)( void * );
	/*0030*/ ULONGLONG UsualSize;
	/*0038*/
};

struct _BOOT_ENTROPY_LDR_RESULT {
	/*0000*/ ULONG maxEntropySources;
	/*0008*/ _BOOT_ENTROPY_SOURCE_LDR_RESULT EntropySourceResult[0xa];
	/*0418*/ UCHAR SeedBytesForCng[0x30];
	/*0448*/ UCHAR RngBytesForNtoskrnl[0x400];
	/*0848*/ UCHAR KdEntropy[0x20];
	/*0868*/
};

enum _BOOT_ENTROPY_SOURCE_ID {
	BootEntropySourceNone = 0x0,
	BootEntropySourceSeedfile = 0x1,
	BootEntropySourceExternal = 0x2,
	BootEntropySourceTpm = 0x3,
	BootEntropySourceRdrand = 0x4,
	BootEntropySourceTime = 0x5,
	BootEntropySourceAcpiOem0 = 0x6,
	BootEntropySourceUefi = 0x7,
	BootEntropySourceCng = 0x8,
	BootEntropySourceTcbTpm = 0x9,
	BootEntropySourceTcbRdrand = 0xa,
	BootMaxEntropySources = 0xa
};

struct _BOOT_ENTROPY_SOURCE_LDR_RESULT {
	/*0000*/ _BOOT_ENTROPY_SOURCE_ID SourceId;
	/*0008*/ ULONGLONG Policy;
	/*0010*/ _BOOT_ENTROPY_SOURCE_RESULT_CODE ResultCode;
	/*0014*/ LONG ResultStatus;
	/*0018*/ ULONGLONG Time;
	/*0020*/ ULONG EntropyLength;
	/*0024*/ UCHAR EntropyData[0x40];
	/*0068*/
};

enum _BOOT_ENTROPY_SOURCE_RESULT_CODE {
	BootEntropySourceStructureUninitialized = 0x0,
	BootEntropySourceDisabledByPolicy = 0x1,
	BootEntropySourceNotPresent = 0x2,
	BootEntropySourceError = 0x3,
	BootEntropySourceSuccess = 0x4
};

enum _BUS_DATA_TYPE {
	ConfigurationSpaceUndefined = 0xffffffff,
	Cmos = 0x0,
	EisaConfiguration = 0x1,
	Pos = 0x2,
	CbusConfiguration = 0x3,
	PCIConfiguration = 0x4,
	VMEConfiguration = 0x5,
	NuBusConfiguration = 0x6,
	PCMCIAConfiguration = 0x7,
	MPIConfiguration = 0x8,
	MPSAConfiguration = 0x9,
	PNPISAConfiguration = 0xa,
	SgiInternalConfiguration = 0xb,
	MaximumBusDataType = 0xc
};

struct _BUS_EXTENSION_LIST {
	/*0000*/ void * Next;
	/*0008*/ _PI_BUS_EXTENSION * BusExtension;
	/*0010*/
};

struct _BUS_HANDLER {
	/*0000*/ ULONG Version;
	/*0004*/ _INTERFACE_TYPE InterfaceType;
	/*0008*/ _BUS_DATA_TYPE ConfigurationType;
	/*000c*/ ULONG BusNumber;
	/*0010*/ _DEVICE_OBJECT * DeviceObject;
	/*0018*/ _BUS_HANDLER * ParentHandler;
	/*0020*/ void * BusData;
	/*0028*/ ULONG DeviceControlExtensionSize;
	/*0030*/ _SUPPORTED_RANGES * BusAddresses;
	/*0038*/ ULONG Reserved[0x4];
	/*0048*/ ULONG (* GetBusData)( _BUS_HANDLER * , _BUS_HANDLER * , ULONG , void * , ULONG , ULONG );
	/*0050*/ ULONG (* SetBusData)( _BUS_HANDLER * , _BUS_HANDLER * , ULONG , void * , ULONG , ULONG );
	/*0058*/ LONG (* AdjustResourceList)( _BUS_HANDLER * , _BUS_HANDLER * , _IO_RESOURCE_REQUIREMENTS_LIST * * );
	/*0060*/ LONG (* AssignSlotResources)( _BUS_HANDLER * , _BUS_HANDLER * , _UNICODE_STRING * , _UNICODE_STRING * , _DRIVER_OBJECT * , _DEVICE_OBJECT * , ULONG , _CM_RESOURCE_LIST * * );
	/*0068*/ UCHAR (* TranslateBusAddress)( _BUS_HANDLER * , _BUS_HANDLER * , _LARGE_INTEGER , ULONG * , _LARGE_INTEGER * );
	/*0070*/ void * Spare1;
	/*0078*/ void * Spare2;
	/*0080*/ void * Spare3;
	/*0088*/ void * Spare4;
	/*0090*/ void * Spare5;
	/*0098*/ void * Spare6;
	/*00a0*/ void * Spare7;
	/*00a8*/ void * Spare8;
	/*00b0*/
};

struct _CACHED_KSTACK_LIST {
	/*0000*/ _SLIST_HEADER SListHead;
	/*0010*/ LONG MinimumFree;
	/*0014*/ ULONG Misses;
	/*0018*/ ULONG MissesLast;
	/*001c*/ ULONG AllStacksInUse;
	/*0020*/
};

struct _CACHE_DESCRIPTOR {
	/*0000*/ UCHAR Level;
	/*0001*/ UCHAR Associativity;
	/*0002*/ USHORT LineSize;
	/*0004*/ ULONG Size;
	/*0008*/ _PROCESSOR_CACHE_TYPE Type;
	/*000c*/
};

struct _CACHE_MANAGER_CALLBACKS {
	/*0000*/ UCHAR (* AcquireForLazyWrite)( void * , UCHAR );
	/*0008*/ void (* ReleaseFromLazyWrite)( void * );
	/*0010*/ UCHAR (* AcquireForReadAhead)( void * , UCHAR );
	/*0018*/ void (* ReleaseFromReadAhead)( void * );
	/*0020*/
};

struct _CACHE_UNINITIALIZE_EVENT {
	/*0000*/ _CACHE_UNINITIALIZE_EVENT * Next;
	/*0008*/ _KEVENT Event;
	/*0020*/
};

struct _CALLBACK_OBJECT;

struct _CALL_HASH_ENTRY {
	/*0000*/ _LIST_ENTRY ListEntry;
	/*0010*/ void * CallersAddress;
	/*0018*/ void * CallersCaller;
	/*0020*/ ULONG CallCount;
	/*0028*/
};

struct _CALL_PERFORMANCE_DATA {
	/*0000*/ ULONGLONG SpinLock;
	/*0008*/ _LIST_ENTRY HashTable[0x40];
	/*0408*/
};

struct _CC_ASYNC_READ_CONTEXT {
	/*0000*/ UCHAR (* CompletionRoutine)( void * );
	/*0008*/ void * Context;
	/*0010*/ _MDL * Mdl;
	/*0018*/ CHAR RequestorMode;
	/*001c*/ ULONG NestingLevel;
	/*0020*/
};

struct _CC_EXTERNAL_CACHE_INFO {
	/*0000*/ void (* Callback)( void * , ULONGLONG , ULONG );
	/*0008*/ _DIRTY_PAGE_STATISTICS DirtyPageStatistics;
	/*0020*/ _LIST_ENTRY Links;
	/*0030*/
};

struct _CC_PARTITION {
	/*0000*/ SHORT NodeTypeCode;
	/*0002*/ SHORT NodeByteSize;
	/*0008*/ _EPARTITION * PartitionObject;
	/*0010*/ _LIST_ENTRY CleanSharedCacheMapList;
	/*0020*/ _LIST_ENTRY CleanSharedCacheMapWithLogHandleList;
	/*0030*/ _SHARED_CACHE_MAP_LIST_CURSOR DirtySharedCacheMapList;
	/*0048*/ _SHARED_CACHE_MAP_LIST_CURSOR LazyWriteCursor;
	/*0060*/ _LIST_ENTRY DirtySharedCacheMapWithLogHandleList;
	/*0080*/ ULONGLONG PrivateLock;
	/*0088*/ ULONG ConsecutiveWorklessLazyScanCount;
	/*008c*/ UCHAR ForcedDisableLazywriteScan;
	/*00c0*/ ULONGLONG WorkQueueLock;
	/*00c8*/ ULONG NumberWorkerThreads;
	/*00cc*/ ULONG NumberActiveWorkerThreads;
	/*00d0*/ _LIST_ENTRY IdleWorkerThreadList;
	/*00e0*/ _LIST_ENTRY FastTeardownWorkQueue;
	/*00f0*/ _LIST_ENTRY ExpressWorkQueue;
	/*0100*/ _LIST_ENTRY RegularWorkQueue;
	/*0110*/ _LIST_ENTRY PostTickWorkQueue;
	/*0120*/ _LIST_ENTRY IdleExtraWriteBehindThreadList;
	/*0130*/ ULONG ActiveExtraWriteBehindThreads;
	/*0134*/ ULONG MaxExtraWriteBehindThreads;
	/*0138*/ UCHAR QueueThrottle;
	/*013c*/ ULONG PostTickWorkItemCount;
	/*0140*/ ULONG ThreadsActiveBeforeThrottle;
	/*0144*/ ULONG ExtraWBThreadsActiveBeforeThrottle;
	/*0148*/ ULONG ExecutingWriteBehindWorkItems;
	/*014c*/ ULONG ExecutingHighPriorityWorkItem;
	/*0150*/ _KEVENT LowMemoryEvent;
	/*0168*/ _KEVENT PowerEvent;
	/*0180*/ _KEVENT PeriodicEvent;
	/*0198*/ _KEVENT WaitingForTeardownEvent;
	/*01b0*/ _KEVENT CoalescingFlushEvent;
	/*01c8*/ ULONG PagesYetToWrite;
	/*01d0*/ _LAZY_WRITER LazyWriter;
	/*0258*/ _DIRTY_PAGE_STATISTICS DirtyPageStatistics;
	/*0270*/ _DIRTY_PAGE_THRESHOLDS DirtyPageThresholds;
	/*02a8*/ _WRITE_BEHIND_THROUGHPUT * ThroughputStats;
	/*02b0*/ LONG ThroughputTrend;
	/*02b8*/ ULONGLONG AverageAvailablePages;
	/*02c0*/ ULONGLONG AverageDirtyPages;
	/*02c8*/ ULONGLONG PagesSkippedDueToHotSpot;
	/*02d0*/ _LARGE_INTEGER PrevRegularQueueItemRunTime;
	/*02d8*/ _LARGE_INTEGER PrevExtraWBThreadCheckTime;
	/*02e0*/ UCHAR AddExtraWriteBehindThreads;
	/*02e1*/ UCHAR RemoveExtraThreadPending;
	/*02e8*/ _LIST_ENTRY DeferredWrites;
	/*0300*/ ULONGLONG DeferredWriteSpinLock;
	/*0308*/ _LIST_ENTRY * IdleAsyncReadWorkerThreadList;
	/*0310*/ ULONG * NumberActiveAsyncReadWorkerThreads;
	/*0318*/ ULONG * NumberActiveCompleteAsyncReadWorkItems;
	/*0320*/ _LIST_ENTRY * AsyncReadWorkQueue;
	/*0328*/ _LIST_ENTRY * AsyncReadCompletionWorkQueue;
	/*0330*/ _KEVENT * NewAsyncReadRequestEvent;
	/*0338*/ _ASYNC_READ_THREAD_STATS * ReaderThreadsStats;
	/*0340*/ _EX_PUSH_LOCK AsyncReadWorkQueueLock;
	/*0348*/ _LIST_ENTRY VacbFreeHighPriorityList;
	/*0358*/ ULONG NumberOfFreeHighPriorityVacbs;
	/*0360*/ _ETHREAD * LowPriWorkerThread;
	/*0368*/ _SHARED_CACHE_MAP * LowPriSharedCacheMap;
	/*0370*/ LONG LowPriOldCpuPriority;
	/*0374*/ _IO_PRIORITY_HINT LowPriOldIoPriority;
	/*0378*/ _EX_PUSH_LOCK LowPriorityWorkerThreadLock;
	/*0380*/ ULONG MaxNumberOfWriteBehindThreads;
	/*0384*/ UCHAR CoalescingState;
	/*0385*/ UCHAR ActivePartition;
	/*0386*/ UCHAR RundownPhase;
	/*0388*/ LONGLONG RefCount;
	/*0390*/ _KEVENT ExitEvent;
	/*03a8*/ _KEVENT FinalDereferenceEvent;
	/*03c0*/ void * LazyWriteScanThreadHandle;
	/*0400*/
};

struct _CELL_DATA {
	/*0000*/ _u u;
	/*0050*/
};

struct _CHILD_LIST {
	/*0000*/ ULONG Count;
	/*0004*/ ULONG List;
	/*0008*/
};

struct _CI_NGEN_PATHS;

struct _CLIENT_ID {
	/*0000*/ void * UniqueProcess;
	/*0008*/ void * UniqueThread;
	/*0010*/
};

struct _CLIENT_ID32 {
	/*0000*/ ULONG UniqueProcess;
	/*0004*/ ULONG UniqueThread;
	/*0008*/
};

struct _CLIENT_ID64 {
	/*0000*/ ULONGLONG UniqueProcess;
	/*0008*/ ULONGLONG UniqueThread;
	/*0010*/
};

union _CLS_LSN {
	struct {
		/*0000*/ UINT idxRecord;
		/*0004*/ ULONG cidContainer;
		/*0008*/
	} offset;
	/*0000*/ ULONGLONG ullOffset;
	/*0008*/
};

struct _CMHIVE {
	/*0000*/ _HHIVE Hive;
	/*0600*/ void * FileHandles[0x6];
	/*0630*/ _LIST_ENTRY NotifyList;
	/*0640*/ _LIST_ENTRY HiveList;
	/*0650*/ _LIST_ENTRY PreloadedHiveList;
	/*0660*/ _EX_RUNDOWN_REF HiveRundown;
	/*0668*/ _CM_KEY_HASH_TABLE_ENTRY * KcbCacheTable;
	/*0670*/ ULONG KcbCacheTableSize;
	/*0678*/ _CM_KEY_HASH_TABLE_ENTRY * DeletedKcbTable;
	/*0680*/ ULONG DeletedKcbTableSize;
	/*0684*/ ULONG Identity;
	/*0688*/ _CMSI_RW_LOCK HiveLock;
	/*0690*/ _RTL_BITMAP FlushDirtyVector;
	/*06a0*/ ULONG FlushDirtyVectorSize;
	/*06a8*/ CMP_OFFSET_ARRAY * FlushLogEntryOffsetArray;
	/*06b0*/ ULONG FlushLogEntryOffsetArrayCount;
	/*06b4*/ ULONG FlushLogEntrySize;
	/*06b8*/ ULONG FlushHiveTruncated;
	/*06bc*/ UCHAR FlushBaseBlockDirty;
	/*06c0*/ _RTL_BITMAP CapturedUnreconciledVector;
	/*06d0*/ ULONG CapturedUnreconciledVectorSize;
	/*06d8*/ CMP_OFFSET_ARRAY * UnreconciledOffsetArray;
	/*06e0*/ ULONG UnreconciledOffsetArrayCount;
	/*06e8*/ _HBASE_BLOCK * UnreconciledBaseBlock;
	/*06f0*/ _EX_PUSH_LOCK SecurityLock;
	/*06f8*/ ULONG LastShrinkHiveSize;
	/*0700*/ _LARGE_INTEGER ActualFileSize;
	/*0708*/ _LARGE_INTEGER LogFileSizes[0x2];
	/*0718*/ _UNICODE_STRING FileFullPath;
	/*0728*/ _UNICODE_STRING FileUserName;
	/*0738*/ _UNICODE_STRING HiveRootPath;
	/*0748*/ ULONG SecurityCount;
	/*074c*/ ULONG SecurityCacheSize;
	/*0750*/ LONG SecurityHitHint;
	/*0758*/ _CM_KEY_SECURITY_CACHE_ENTRY * SecurityCache;
	/*0760*/ _LIST_ENTRY SecurityHash[0x40];
	/*0b60*/ ULONG UnloadEventCount;
	/*0b68*/ _KEVENT * * UnloadEventArray;
	/*0b70*/ _CM_KEY_CONTROL_BLOCK * RootKcb;
	/*0b78*/ UCHAR Frozen;
	/*0b80*/ _CM_WORKITEM * UnloadWorkItem;
	/*0b88*/ _CM_WORKITEM UnloadWorkItemHolder;
	/*0bb0*/ _CM_DIRTY_VECTOR_LOG DirtyVectorLog;
	/*1038*/ ULONG Flags;
	/*1040*/ _LIST_ENTRY TrustClassEntry;
	/*1050*/ ULONGLONG DirtyTime;
	/*1058*/ ULONGLONG UnreconciledTime;
	/*1060*/ _CM_RM * CmRm;
	/*1068*/ ULONG CmRmInitFailPoint;
	/*106c*/ LONG CmRmInitFailStatus;
	/*1070*/ _KTHREAD * CreatorOwner;
	/*1078*/ _KTHREAD * RundownThread;
	/*1080*/ _LARGE_INTEGER LastWriteTime;
	/*1088*/ _HIVE_WRITE_WAIT_QUEUE FlushQueue;
	/*1098*/ _HIVE_WRITE_WAIT_QUEUE ReconcileQueue;
	/*10a8*/ ULONG FlushFlags;
	/*10a8*/ ULONG PrimaryFilePurged : 01; // 0x00000001;
	/*10a8*/ ULONG DiskFileBad : 01; // 0x00000002;
	/*10ac*/ ULONG PrimaryFileSizeBeforeLastFlush;
	/*10b0*/ LONG volatile ReferenceCount;
	/*10b4*/ LONG UnloadHistoryIndex;
	/*10b8*/ ULONG UnloadHistory[0x80];
	/*12b8*/ ULONG BootStart;
	/*12bc*/ ULONG UnaccessedStart;
	/*12c0*/ ULONG UnaccessedEnd;
	/*12c4*/ ULONG LoadedKeyCount;
	/*12c8*/ ULONG volatile HandleClosePending;
	/*12d0*/ _EX_PUSH_LOCK HandleClosePendingEvent;
	/*12d8*/ UCHAR FinalFlushSucceeded;
	/*12e0*/ _CMP_VOLUME_CONTEXT * VolumeContext;
	/*12e8*/
};

struct _CMP_DISCARD_AND_REPLACE_KCB_CONTEXT {
	/*0000*/ _CM_KEY_CONTROL_BLOCK * BaseKcb;
	/*0008*/ LONG PrepareStatus;
	/*0010*/ _LIST_ENTRY ClonedKcbListHead;
	/*0020*/
};

enum _CMP_FAILURE_INJECTION_POINT {
	CmpFailurePointPoolAllocation = 0x0,
	CmpFailurePointViewMapping = 0x1,
	CmpFailurePointViewPinning = 0x2,
	CmpFailurePointResourceCharging = 0x3,
	CmpFailurePointFileWrite = 0x4,
	CmpFailurePointFileRead = 0x5,
	CmpFailurePointCacheFlush = 0x6,
	CmpFailurePointFlush = 0x7,
	CmpFailurePointFlushAndPurge = 0x8,
	CmpFailurePointForceLargeBin = 0x9,
	CmpFailurePointDontFixAlignment = 0xa,
	CmpFailurePointAllocateCell = 0xb,
	CmpFailurePointMarkDirty = 0xc,
	CmpFailurePointForceMultiLevelMap = 0xd,
	CmpFailurePointAllocateContiguousLogEntry = 0xe,
	CmpFailurePointAllocateKcb = 0xf,
	CmpFailurePointCreateKeyBody = 0x10,
	CmpFailurePointForceFreeKcb = 0x11,
	CmpFailurePointKeyEnumResumeContextVerification = 0x12,
	CmpFailurePointKeyEnumForceRetry = 0x13,
	CmpFailurePointForceReorganization = 0x14,
	CmpFailurePointForceLazyCOWByPolicy = 0x15,
	CmpFailureInjectionPointCount = 0x16
};

struct _CMP_VOLUME_CONTEXT {
	/*0000*/ _LIST_ENTRY VolumeContextListEntry;
	/*0010*/ _CMP_VOLUME_MANAGER * VolumeManager;
	/*0018*/ LONGLONG RefCount;
	/*0020*/ _GUID VolumeGuid;
	/*0030*/ void * VolumeFileObject;
	/*0038*/ _CMSI_RW_LOCK VolumeContextLock;
	/*0040*/ UCHAR DeviceUsageNotificationSent;
	/*0048*/
};

struct _CMP_VOLUME_MANAGER {
	/*0000*/ _CMSI_RW_LOCK VolumeContextListLock;
	/*0008*/ _LIST_ENTRY VolumeContextListHead;
	/*0018*/
};

struct _CMSI_PROCESS_TUPLE {
	/*0000*/ void * ProcessHandle;
	/*0008*/ void * ProcessReference;
	/*0010*/
};

struct _CMSI_RW_LOCK {
	/*0000*/ void * Reserved;
	/*0008*/
};

struct _CM_BIG_DATA {
	/*0000*/ USHORT Signature;
	/*0002*/ USHORT Count;
	/*0004*/ ULONG List;
	/*0008*/
};

struct _CM_COMPONENT_HASH {
	/*0000*/ ULONG Hash;
	/*0004*/
};

struct _CM_DIRTY_VECTOR_LOG {
	/*0000*/ ULONG volatile Next;
	/*0004*/ ULONG Size;
	/*0008*/ _CM_DIRTY_VECTOR_LOG_ENTRY Log[0x10];
	/*0488*/
};

struct _CM_DIRTY_VECTOR_LOG_ENTRY {
	/*0000*/ _ETHREAD * Thread;
	/*0008*/ _CM_DIRTY_VECTOR_OPERATION Operation;
	union {
		struct {
			/*000c*/ ULONG Start;
			/*0010*/ ULONG Length;
			/*0014*/
		} DirtyVectorModifiedContext;
		struct {
			/*000c*/ ULONG RangeCount;
			/*0010*/ ULONG SetBitCount;
			/*0014*/
		} DirtyDataCaptureContext;
		struct {
			/*000c*/ ULONG Context1;
			/*0010*/ ULONG Context2;
			/*0014*/
		} Raw;
		/*0014*/
	} Data;
	/*0018*/ void * Stack[0x6];
	/*0048*/
};

enum _CM_DIRTY_VECTOR_OPERATION {
	DirtyVectorModified = 0x0,
	DirtyDataCaptureStart = 0x1,
	DirtyDataCaptureEnd = 0x2
};

struct _CM_FAST_LEAF_HINT {
	/*0000*/ UCHAR Characters[0x4];
	/*0000*/ ULONG FullHint;
	/*0004*/
};

struct _CM_FULL_RESOURCE_DESCRIPTOR {
	/*0000*/ _INTERFACE_TYPE InterfaceType;
	/*0004*/ ULONG BusNumber;
	/*0008*/ _CM_PARTIAL_RESOURCE_LIST PartialResourceList;
	/*0024*/
};

struct _CM_INDEX {
	/*0000*/ ULONG Cell;
	/*0004*/ _CM_FAST_LEAF_HINT NameHint;
	/*0004*/ _CM_COMPONENT_HASH HashKey;
	/*0008*/
};

struct _CM_INDEX_HINT_BLOCK {
	/*0000*/ ULONG Count;
	/*0004*/ ULONG HashKey[0x1];
	/*0008*/
};

struct _CM_INTENT_LOCK {
	/*0000*/ ULONG OwnerCount;
	/*0008*/ _CM_KCB_UOW * * OwnerTable;
	/*0010*/
};

struct _CM_KCB_LAYER_INFO {
	/*0000*/ _LIST_ENTRY LayerListEntry;
	/*0010*/ _CM_KEY_CONTROL_BLOCK * Kcb;
	/*0018*/ _CM_KCB_LAYER_INFO * LowerLayer;
	/*0020*/ _LIST_ENTRY UpperLayerListHead;
	/*0030*/
};

struct _CM_KCB_UOW {
	/*0000*/ _LIST_ENTRY TransactionListEntry;
	/*0010*/ _CM_INTENT_LOCK * KCBLock;
	/*0018*/ _CM_INTENT_LOCK * KeyLock;
	/*0020*/ _LIST_ENTRY KCBListEntry;
	/*0030*/ _CM_KEY_CONTROL_BLOCK * KeyControlBlock;
	/*0038*/ _CM_TRANS * Transaction;
	/*0040*/ ULONG UoWState;
	/*0044*/ UoWActionType ActionType;
	/*0048*/ HSTORAGE_TYPE StorageType;
	/*0050*/ _CM_KCB_UOW * ParentUoW;
	/*0058*/ _CM_KEY_CONTROL_BLOCK * ChildKCB;
	/*0058*/ ULONG VolatileKeyCell;
	/*0058*/ ULONG OldValueCell;
	/*005c*/ ULONG NewValueCell;
	/*0058*/ ULONG UserFlags;
	/*0058*/ _LARGE_INTEGER LastWriteTime;
	/*0058*/ _CM_KEY_SECURITY_CACHE * TxCachedSecurity;
	/*0060*/ ULONG TxSecurityCell;
	/*0058*/ _CM_KEY_CONTROL_BLOCK * OldChildKCB;
	/*0060*/ _CM_KEY_CONTROL_BLOCK * NewChildKCB;
	/*0058*/ _CM_KEY_CONTROL_BLOCK * OtherChildKCB;
	/*0060*/ ULONG ThisVolatileKeyCell;
	/*0068*/ void * PrepareDataPointer;
	/*0068*/ _CM_UOW_SET_SD_DATA * SecurityData;
	/*0068*/ _CM_UOW_KEY_STATE_MODIFICATION * ModifyKeysData;
	/*0068*/ _CM_UOW_SET_VALUE_LIST_DATA * SetValueData;
	/*0070*/ _CM_UOW_SET_VALUE_KEY_DATA * ValueData;
	/*0070*/ _CMP_DISCARD_AND_REPLACE_KCB_CONTEXT * DiscardReplaceContext;
	/*0078*/
};

struct _CM_KEY_BODY {
	/*0000*/ ULONG Type;
	/*0008*/ _CM_KEY_CONTROL_BLOCK * KeyControlBlock;
	/*0010*/ _CM_NOTIFY_BLOCK * NotifyBlock;
	/*0018*/ void * ProcessID;
	/*0020*/ _LIST_ENTRY KeyBodyList;
	/*0030*/ ULONG Flags : 16; // 0x0000ffff;
	/*0030*/ ULONG HandleTags : 16; // 0xffff0000;
	/*0038*/ _CM_TRANS_PTR Trans;
	/*0040*/ _GUID * KtmUow;
	/*0048*/ _LIST_ENTRY ContextListHead;
	/*0058*/ void * EnumerationResumeContext;
	/*0060*/
};

struct _CM_KEY_CONTROL_BLOCK {
	/*0000*/ ULONGLONG RefCount;
	/*0008*/ ULONG ExtFlags : 16; // 0x0000ffff;
	/*0008*/ ULONG Freed : 01; // 0x00010000;
	/*0008*/ ULONG Discarded : 01; // 0x00020000;
	/*0008*/ ULONG HiveUnloaded : 01; // 0x00040000;
	/*0008*/ ULONG Decommissioned : 01; // 0x00080000;
	/*0008*/ ULONG SpareExtFlag : 01; // 0x00100000;
	/*0008*/ ULONG TotalLevels : 10; // 0x7fe00000;
	/*0010*/ _CM_KEY_HASH KeyHash;
	/*0010*/ _CM_PATH_HASH ConvKey;
	/*0018*/ _CM_KEY_HASH * NextHash;
	/*0020*/ _HHIVE * KeyHive;
	/*0028*/ ULONG KeyCell;
	/*0030*/ _EX_PUSH_LOCK KcbPushlock;
	/*0038*/ _KTHREAD * Owner;
	/*0038*/ LONG SharedCount;
	/*0040*/ UCHAR DelayedDeref : 01; // 0x01;
	/*0040*/ UCHAR DelayedClose : 01; // 0x02;
	/*0040*/ UCHAR Parking : 01; // 0x04;
	/*0041*/ UCHAR LayerSemantics;
	/*0042*/ SHORT LayerHeight;
	/*0044*/ ULONG Spare1;
	/*0048*/ _CM_KEY_CONTROL_BLOCK * ParentKcb;
	/*0050*/ _CM_NAME_CONTROL_BLOCK * NameBlock;
	/*0058*/ _CM_KEY_SECURITY_CACHE * CachedSecurity;
	/*0060*/ _CHILD_LIST ValueList;
	/*0068*/ _CM_KEY_CONTROL_BLOCK * LinkTarget;
	/*0070*/ _CM_INDEX_HINT_BLOCK * IndexHint;
	/*0070*/ ULONG HashKey;
	/*0070*/ ULONG SubKeyCount;
	/*0078*/ _LIST_ENTRY KeyBodyListHead;
	/*0078*/ _LIST_ENTRY ClonedListEntry;
	/*0088*/ _CM_KEY_BODY * KeyBodyArray[0x4];
	/*00a8*/ _LARGE_INTEGER KcbLastWriteTime;
	/*00b0*/ USHORT KcbMaxNameLen;
	/*00b2*/ USHORT KcbMaxValueNameLen;
	/*00b4*/ ULONG KcbMaxValueDataLen;
	/*00b8*/ ULONG KcbUserFlags : 04; // 0x0000000f;
	/*00b8*/ ULONG KcbVirtControlFlags : 04; // 0x000000f0;
	/*00b8*/ ULONG KcbDebug : 08; // 0x0000ff00;
	/*00b8*/ ULONG Flags : 16; // 0xffff0000;
	/*00bc*/ ULONG Spare3;
	/*00c0*/ _CM_KCB_LAYER_INFO * LayerInfo;
	/*00c8*/ CHAR * RealKeyName;
	/*00d0*/ _LIST_ENTRY KCBUoWListHead;
	/*00e0*/ _LIST_ENTRY DelayQueueEntry;
	/*00e0*/ UCHAR volatile * Stolen;
	/*00f0*/ _CM_TRANS * TransKCBOwner;
	/*00f8*/ _CM_INTENT_LOCK KCBLock;
	/*0108*/ _CM_INTENT_LOCK KeyLock;
	/*0118*/ _CHILD_LIST TransValueCache;
	/*0120*/ _CM_TRANS * TransValueListOwner;
	/*0128*/ _UNICODE_STRING * FullKCBName;
	/*0128*/ ULONGLONG FullKCBNameStale : 01; // 0x0000000000000001;
	/*0128*/ ULONGLONG Reserved : 63; // 0xfffffffffffffffe;
	/*0130*/ ULONGLONG SequenceNumber;
	/*0138*/
};

struct _CM_KEY_HASH {
	/*0000*/ _CM_PATH_HASH ConvKey;
	/*0008*/ _CM_KEY_HASH * NextHash;
	/*0010*/ _HHIVE * KeyHive;
	/*0018*/ ULONG KeyCell;
	/*0020*/
};

struct _CM_KEY_HASH_TABLE_ENTRY {
	/*0000*/ _EX_PUSH_LOCK Lock;
	/*0008*/ _KTHREAD * Owner;
	/*0010*/ _CM_KEY_HASH * Entry;
	/*0018*/
};

struct _CM_KEY_INDEX {
	/*0000*/ USHORT Signature;
	/*0002*/ USHORT Count;
	/*0004*/ ULONG List[0x1];
	/*0008*/
};

struct _CM_KEY_NODE {
	/*0000*/ USHORT Signature;
	/*0002*/ USHORT Flags;
	/*0004*/ _LARGE_INTEGER LastWriteTime;
	/*000c*/ UCHAR AccessBits;
	/*000d*/ UCHAR LayerSemantics : 02; // 0x03;
	/*000d*/ UCHAR Spare1 : 05; // 0x7c;
	/*000d*/ UCHAR InheritClass : 01; // 0x80;
	/*000e*/ USHORT Spare2;
	/*0010*/ ULONG Parent;
	/*0014*/ ULONG SubKeyCounts[0x2];
	/*001c*/ ULONG SubKeyLists[0x2];
	/*0024*/ _CHILD_LIST ValueList;
	/*001c*/ _CM_KEY_REFERENCE ChildHiveReference;
	/*002c*/ ULONG Security;
	/*0030*/ ULONG Class;
	/*0034*/ ULONG MaxNameLen : 16; // 0x0000ffff;
	/*0034*/ ULONG UserFlags : 04; // 0x000f0000;
	/*0034*/ ULONG VirtControlFlags : 04; // 0x00f00000;
	/*0034*/ ULONG Debug : 08; // 0xff000000;
	/*0038*/ ULONG MaxClassLen;
	/*003c*/ ULONG MaxValueNameLen;
	/*0040*/ ULONG MaxValueDataLen;
	/*0044*/ ULONG WorkVar;
	/*0048*/ USHORT NameLength;
	/*004a*/ USHORT ClassLength;
	/*004c*/ WCHAR Name[0x1];
	/*0050*/
};

struct _CM_KEY_REFERENCE {
	/*0000*/ ULONG KeyCell;
	/*0008*/ _HHIVE * KeyHive;
	/*0010*/
};

struct _CM_KEY_SECURITY {
	/*0000*/ USHORT Signature;
	/*0002*/ USHORT Reserved;
	/*0004*/ ULONG Flink;
	/*0008*/ ULONG Blink;
	/*000c*/ ULONG ReferenceCount;
	/*0010*/ ULONG DescriptorLength;
	/*0014*/ _SECURITY_DESCRIPTOR_RELATIVE Descriptor;
	/*0028*/
};

struct _CM_KEY_SECURITY_CACHE {
	/*0000*/ ULONG Cell;
	/*0004*/ ULONG ConvKey;
	/*0008*/ _LIST_ENTRY List;
	/*0018*/ ULONG DescriptorLength;
	/*001c*/ ULONG RealRefCount;
	/*0020*/ _SECURITY_DESCRIPTOR_RELATIVE Descriptor;
	/*0038*/
};

struct _CM_KEY_SECURITY_CACHE_ENTRY {
	/*0000*/ ULONG Cell;
	/*0008*/ _CM_KEY_SECURITY_CACHE * CachedSecurity;
	/*0010*/
};

struct _CM_KEY_VALUE {
	/*0000*/ USHORT Signature;
	/*0002*/ USHORT NameLength;
	/*0004*/ ULONG DataLength;
	/*0008*/ ULONG Data;
	/*000c*/ ULONG Type;
	/*0010*/ USHORT Flags;
	/*0012*/ USHORT Spare;
	/*0014*/ WCHAR Name[0x1];
	/*0018*/
};

enum _CM_LOAD_FAILURE_TYPE {
	_None = 0x0,
	_CmCreateHive = 0x1,
	_HvpBuildMap = 0x3,
	_HvpBuildMapForLoaderHive = 0x4,
	_HvpInitMap = 0x5,
	_HvLoadHive = 0x6,
	_HvpMapHiveImage = 0x7,
	_HvpRecoverData = 0x8,
	_CmpValidateHiveSecurityDescriptors = 0x9,
	_HvpEnlistBinInMap = 0xa,
	_CmCheckRegistry = 0xb,
	_CmRegistryIO = 0xc,
	_CmCheckRegistry2 = 0xd,
	_CmpCheckKey = 0xe,
	_CmpCheckValueList = 0xf,
	_HvCheckHive = 0x10,
	_HvCheckBin = 0x11,
	_HvpGetLogEntryDirtyVector = 0x12,
	_HvpReadLogEntryHeader = 0x13,
	_HvpReadLogEntry = 0x14,
	_CmpMountPreloadedHives = 0x15,
	_CmpLoadHiveThread = 0x16,
	_CmpCheckLeaf = 0x17,
	_HvHiveStartFileBacked = 0x18,
	_HvStartHiveMemoryBacked = 0x19,
	_HvpEnlistFreeCells = 0x1a,
	_HvpPerformLogFileRecovery = 0x1b
};

struct _CM_NAME_CONTROL_BLOCK {
	/*0000*/ ULONG Compressed : 01; // 0x00000001;
	/*0000*/ ULONG RefCount : 31; // 0xfffffffe;
	/*0008*/ _CM_NAME_HASH NameHash;
	/*0008*/ _CM_COMPONENT_HASH ConvKey;
	/*0010*/ _CM_KEY_HASH * NextHash;
	/*0018*/ USHORT NameLength;
	/*001a*/ WCHAR Name[0x1];
	/*0020*/
};

struct _CM_NAME_HASH {
	/*0000*/ _CM_COMPONENT_HASH ConvKey;
	/*0008*/ _CM_NAME_HASH * NextHash;
	/*0010*/ USHORT NameLength;
	/*0012*/ WCHAR Name[0x1];
	/*0018*/
};

struct _CM_NOTIFY_BLOCK {
	/*0000*/ _LIST_ENTRY HiveList;
	/*0010*/ _LIST_ENTRY PostList;
	/*0020*/ _CM_KEY_CONTROL_BLOCK * KeyControlBlock;
	/*0028*/ _CM_KEY_BODY * KeyBody;
	/*0030*/ ULONG Filter : 30; // 0x3fffffff;
	/*0030*/ ULONG WatchTree : 01; // 0x40000000;
	/*0030*/ ULONG NotifyPending : 01; // 0x80000000;
	/*0038*/ _SECURITY_SUBJECT_CONTEXT SubjectContext;
	/*0058*/
};

struct _CM_PARTIAL_RESOURCE_DESCRIPTOR {
	/*0000*/ UCHAR Type;
	/*0001*/ UCHAR ShareDisposition;
	/*0002*/ USHORT Flags;
	union {
		struct {
			/*0004*/ _LARGE_INTEGER Start;
			/*000c*/ ULONG Length;
			/*0010*/
		} Generic;
		struct {
			/*0004*/ _LARGE_INTEGER Start;
			/*000c*/ ULONG Length;
			/*0010*/
		} Port;
		struct {
			/*0004*/ USHORT Level;
			/*0006*/ USHORT Group;
			/*0008*/ ULONG Vector;
			/*000c*/ ULONGLONG Affinity;
			/*0014*/
		} Interrupt;
		struct {
			struct {
				/*0004*/ USHORT Group;
				/*0006*/ USHORT MessageCount;
				/*0008*/ ULONG Vector;
				/*000c*/ ULONGLONG Affinity;
				/*0014*/
			} Raw;
			struct {
				/*0004*/ USHORT Level;
				/*0006*/ USHORT Group;
				/*0008*/ ULONG Vector;
				/*000c*/ ULONGLONG Affinity;
				/*0014*/
			} Translated;
			/*0014*/
		} MessageInterrupt;
		struct {
			/*0004*/ _LARGE_INTEGER Start;
			/*000c*/ ULONG Length;
			/*0010*/
		} Memory;
		struct {
			/*0004*/ ULONG Channel;
			/*0008*/ ULONG Port;
			/*000c*/ ULONG Reserved1;
			/*0010*/
		} Dma;
		struct {
			/*0004*/ ULONG Channel;
			/*0008*/ ULONG RequestLine;
			/*000c*/ UCHAR TransferWidth;
			/*000d*/ UCHAR Reserved1;
			/*000e*/ UCHAR Reserved2;
			/*000f*/ UCHAR Reserved3;
			/*0010*/
		} DmaV3;
		struct {
			/*0004*/ ULONG Data[0x3];
			/*0010*/
		} DevicePrivate;
		struct {
			/*0004*/ ULONG Start;
			/*0008*/ ULONG Length;
			/*000c*/ ULONG Reserved;
			/*0010*/
		} BusNumber;
		struct {
			/*0004*/ ULONG DataSize;
			/*0008*/ ULONG Reserved1;
			/*000c*/ ULONG Reserved2;
			/*0010*/
		} DeviceSpecificData;
		struct {
			/*0004*/ _LARGE_INTEGER Start;
			/*000c*/ ULONG Length40;
			/*0010*/
		} Memory40;
		struct {
			/*0004*/ _LARGE_INTEGER Start;
			/*000c*/ ULONG Length48;
			/*0010*/
		} Memory48;
		struct {
			/*0004*/ _LARGE_INTEGER Start;
			/*000c*/ ULONG Length64;
			/*0010*/
		} Memory64;
		struct {
			/*0004*/ UCHAR Class;
			/*0005*/ UCHAR Type;
			/*0006*/ UCHAR Reserved1;
			/*0007*/ UCHAR Reserved2;
			/*0008*/ ULONG IdLowPart;
			/*000c*/ ULONG IdHighPart;
			/*0010*/
		} Connection;
		/*0014*/
	} u;
	/*0014*/
};

struct _CM_PARTIAL_RESOURCE_LIST {
	/*0000*/ USHORT Version;
	/*0002*/ USHORT Revision;
	/*0004*/ ULONG Count;
	/*0008*/ _CM_PARTIAL_RESOURCE_DESCRIPTOR PartialDescriptors[0x1];
	/*001c*/
};

struct _CM_PATH_HASH {
	/*0000*/ ULONG Hash;
	/*0004*/
};

struct _CM_RESOURCE_LIST {
	/*0000*/ ULONG Count;
	/*0004*/ _CM_FULL_RESOURCE_DESCRIPTOR List[0x1];
	/*0028*/
};

struct _CM_RM {
	/*0000*/ _LIST_ENTRY RmListEntry;
	/*0010*/ _LIST_ENTRY TransactionListHead;
	/*0020*/ void * TmHandle;
	/*0028*/ void * Tm;
	/*0030*/ void * RmHandle;
	/*0038*/ void * KtmRm;
	/*0040*/ ULONG RefCount;
	/*0044*/ ULONG ContainerNum;
	/*0048*/ ULONGLONG ContainerSize;
	/*0050*/ _CMHIVE * CmHive;
	/*0058*/ void * LogFileObject;
	/*0060*/ void * MarshallingContext;
	/*0068*/ ULONG RmFlags;
	/*006c*/ LONG LogStartStatus1;
	/*0070*/ LONG LogStartStatus2;
	/*0078*/ ULONGLONG BaseLsn;
	/*0080*/ _ERESOURCE * RmLock;
	/*0088*/
};

enum _CM_SHARE_DISPOSITION {
	CmResourceShareUndetermined = 0x0,
	CmResourceShareDeviceExclusive = 0x1,
	CmResourceShareDriverExclusive = 0x2,
	CmResourceShareShared = 0x3
};

struct _CM_TRANS {
	/*0000*/ _LIST_ENTRY TransactionListEntry;
	/*0010*/ _LIST_ENTRY KCBUoWListHead;
	/*0020*/ _LIST_ENTRY LazyCommitListEntry;
	/*0030*/ ULONG Prepared : 01; // 0x00000001;
	/*0030*/ ULONG Aborted : 01; // 0x00000002;
	/*0030*/ ULONG Committed : 01; // 0x00000004;
	/*0030*/ ULONG Initializing : 01; // 0x00000008;
	/*0030*/ ULONG Invalid : 01; // 0x00000010;
	/*0030*/ ULONG UseReservation : 01; // 0x00000020;
	/*0030*/ ULONG TmCallbacksActive : 01; // 0x00000040;
	/*0030*/ ULONG LightWeight : 01; // 0x00000080;
	/*0030*/ ULONG Freed1 : 01; // 0x00000100;
	/*0030*/ ULONG Freed2 : 01; // 0x00000200;
	/*0030*/ ULONG Spare1 : 02; // 0x00000c00;
	/*0030*/ ULONG Freed : 01; // 0x00001000;
	/*0030*/ ULONG Spare : 19; // 0xffffe000;
	/*0030*/ ULONG TransState;
	/*0038*/ _CM_TRANS_PTR Trans;
	/*0040*/ _CM_RM * CmRm;
	/*0048*/ _KENLISTMENT * KtmEnlistmentObject;
	/*0050*/ void * KtmEnlistmentHandle;
	/*0058*/ _GUID KtmUow;
	/*0068*/ ULONGLONG StartLsn;
	/*0070*/ ULONG HiveCount;
	/*0078*/ _CMHIVE * HiveArray[0x8];
	/*00b8*/
};

union _CM_TRANS_PTR {
	/*0000*/ ULONGLONG LightWeight : 01; // 0x0000000000000001;
	/*0000*/ void * TransPtr;
	/*0008*/
};

struct _CM_UOW_KEY_STATE_MODIFICATION {
	/*0000*/ ULONG RefCount;
	/*0004*/ ULONG SubKeyListCount[0x2];
	/*000c*/ ULONG NewSubKeyList[0x2];
	/*0014*/
};

struct _CM_UOW_SET_SD_DATA {
	/*0000*/ ULONG SecurityCell;
	/*0004*/
};

struct _CM_UOW_SET_VALUE_KEY_DATA {
	/*0000*/ ULONG PreparedCell;
	/*0004*/ ULONG OldValueCell;
	/*0008*/ USHORT NameLength;
	/*000c*/ ULONG DataSize;
	/*0010*/
};

struct _CM_UOW_SET_VALUE_LIST_DATA {
	/*0000*/ ULONG RefCount;
	/*0004*/ _CHILD_LIST ValueList;
	/*000c*/
};

struct _CM_WORKITEM {
	/*0000*/ _LIST_ENTRY ListEntry;
	/*0010*/ ULONG Private;
	/*0018*/ void (* WorkerRoutine)( void * );
	/*0020*/ void * Parameter;
	/*0028*/
};

struct _COMPRESSED_DATA_INFO {
	/*0000*/ USHORT CompressionFormatAndEngine;
	/*0002*/ UCHAR CompressionUnitShift;
	/*0003*/ UCHAR ChunkShift;
	/*0004*/ UCHAR ClusterShift;
	/*0005*/ UCHAR Reserved;
	/*0006*/ USHORT NumberOfChunks;
	/*0008*/ ULONG CompressedChunkSizes[0x1];
	/*000c*/
};

enum _CONFIGURATION_CLASS {
	SystemClass = 0x0,
	ProcessorClass = 0x1,
	CacheClass = 0x2,
	AdapterClass = 0x3,
	ControllerClass = 0x4,
	PeripheralClass = 0x5,
	MemoryClass = 0x6,
	MaximumClass = 0x7
};

struct _CONFIGURATION_COMPONENT {
	/*0000*/ _CONFIGURATION_CLASS Class;
	/*0004*/ _CONFIGURATION_TYPE Type;
	/*0008*/ _DEVICE_FLAGS Flags;
	/*000c*/ USHORT Version;
	/*000e*/ USHORT Revision;
	/*0010*/ ULONG Key;
	/*0014*/ ULONG AffinityMask;
	/*0014*/ USHORT Group;
	/*0016*/ USHORT GroupIndex;
	/*0018*/ ULONG ConfigurationDataLength;
	/*001c*/ ULONG IdentifierLength;
	/*0020*/ CHAR * Identifier;
	/*0028*/
};

struct _CONFIGURATION_COMPONENT_DATA {
	/*0000*/ _CONFIGURATION_COMPONENT_DATA * Parent;
	/*0008*/ _CONFIGURATION_COMPONENT_DATA * Child;
	/*0010*/ _CONFIGURATION_COMPONENT_DATA * Sibling;
	/*0018*/ _CONFIGURATION_COMPONENT ComponentEntry;
	/*0040*/ void * ConfigurationData;
	/*0048*/
};

enum _CONFIGURATION_TYPE {
	ArcSystem = 0x0,
	CentralProcessor = 0x1,
	FloatingPointProcessor = 0x2,
	PrimaryIcache = 0x3,
	PrimaryDcache = 0x4,
	SecondaryIcache = 0x5,
	SecondaryDcache = 0x6,
	SecondaryCache = 0x7,
	EisaAdapter = 0x8,
	TcAdapter = 0x9,
	ScsiAdapter = 0xa,
	DtiAdapter = 0xb,
	MultiFunctionAdapter = 0xc,
	DiskController = 0xd,
	TapeController = 0xe,
	CdromController = 0xf,
	WormController = 0x10,
	SerialController = 0x11,
	NetworkController = 0x12,
	DisplayController = 0x13,
	ParallelController = 0x14,
	PointerController = 0x15,
	KeyboardController = 0x16,
	AudioController = 0x17,
	OtherController = 0x18,
	DiskPeripheral = 0x19,
	FloppyDiskPeripheral = 0x1a,
	TapePeripheral = 0x1b,
	ModemPeripheral = 0x1c,
	MonitorPeripheral = 0x1d,
	PrinterPeripheral = 0x1e,
	PointerPeripheral = 0x1f,
	KeyboardPeripheral = 0x20,
	TerminalPeripheral = 0x21,
	OtherPeripheral = 0x22,
	LinePeripheral = 0x23,
	NetworkPeripheral = 0x24,
	SystemMemory = 0x25,
	DockingInformation = 0x26,
	RealModeIrqRoutingTable = 0x27,
	RealModePCIEnumeration = 0x28,
	MaximumType = 0x29
};

struct _CONTEXT {
	/*0000*/ ULONGLONG P1Home;
	/*0008*/ ULONGLONG P2Home;
	/*0010*/ ULONGLONG P3Home;
	/*0018*/ ULONGLONG P4Home;
	/*0020*/ ULONGLONG P5Home;
	/*0028*/ ULONGLONG P6Home;
	/*0030*/ ULONG ContextFlags;
	/*0034*/ ULONG MxCsr;
	/*0038*/ USHORT SegCs;
	/*003a*/ USHORT SegDs;
	/*003c*/ USHORT SegEs;
	/*003e*/ USHORT SegFs;
	/*0040*/ USHORT SegGs;
	/*0042*/ USHORT SegSs;
	/*0044*/ ULONG EFlags;
	/*0048*/ ULONGLONG Dr0;
	/*0050*/ ULONGLONG Dr1;
	/*0058*/ ULONGLONG Dr2;
	/*0060*/ ULONGLONG Dr3;
	/*0068*/ ULONGLONG Dr6;
	/*0070*/ ULONGLONG Dr7;
	/*0078*/ ULONGLONG Rax;
	/*0080*/ ULONGLONG Rcx;
	/*0088*/ ULONGLONG Rdx;
	/*0090*/ ULONGLONG Rbx;
	/*0098*/ ULONGLONG Rsp;
	/*00a0*/ ULONGLONG Rbp;
	/*00a8*/ ULONGLONG Rsi;
	/*00b0*/ ULONGLONG Rdi;
	/*00b8*/ ULONGLONG R8;
	/*00c0*/ ULONGLONG R9;
	/*00c8*/ ULONGLONG R10;
	/*00d0*/ ULONGLONG R11;
	/*00d8*/ ULONGLONG R12;
	/*00e0*/ ULONGLONG R13;
	/*00e8*/ ULONGLONG R14;
	/*00f0*/ ULONGLONG R15;
	/*00f8*/ ULONGLONG Rip;
	/*0100*/ _XSAVE_FORMAT FltSave;
	/*0100*/ _M128A Header[0x2];
	/*0120*/ _M128A Legacy[0x8];
	/*01a0*/ _M128A Xmm0;
	/*01b0*/ _M128A Xmm1;
	/*01c0*/ _M128A Xmm2;
	/*01d0*/ _M128A Xmm3;
	/*01e0*/ _M128A Xmm4;
	/*01f0*/ _M128A Xmm5;
	/*0200*/ _M128A Xmm6;
	/*0210*/ _M128A Xmm7;
	/*0220*/ _M128A Xmm8;
	/*0230*/ _M128A Xmm9;
	/*0240*/ _M128A Xmm10;
	/*0250*/ _M128A Xmm11;
	/*0260*/ _M128A Xmm12;
	/*0270*/ _M128A Xmm13;
	/*0280*/ _M128A Xmm14;
	/*0290*/ _M128A Xmm15;
	/*0300*/ _M128A VectorRegister[0x1a];
	/*04a0*/ ULONGLONG VectorControl;
	/*04a8*/ ULONGLONG DebugControl;
	/*04b0*/ ULONGLONG LastBranchToRip;
	/*04b8*/ ULONGLONG LastBranchFromRip;
	/*04c0*/ ULONGLONG LastExceptionToRip;
	/*04c8*/ ULONGLONG LastExceptionFromRip;
	/*04d0*/
};

struct _CONTROL_AREA {
	/*0000*/ _SEGMENT * Segment;
	/*0008*/ _LIST_ENTRY ListHead;
	/*0008*/ void * AweContext;
	/*0018*/ ULONGLONG NumberOfSectionReferences;
	/*0020*/ ULONGLONG NumberOfPfnReferences;
	/*0028*/ ULONGLONG NumberOfMappedViews;
	/*0030*/ ULONGLONG NumberOfUserReferences;
	union {
		/*0038*/ ULONG LongFlags;
		/*0038*/ _MMSECTION_FLAGS Flags;
		/*003c*/
	} u;
	union {
		/*003c*/ ULONG LongFlags;
		/*003c*/ _MMSECTION_FLAGS2 Flags;
		/*0040*/
	} u1;
	/*0040*/ _EX_FAST_REF FilePointer;
	/*0048*/ LONG volatile ControlAreaLock;
	/*004c*/ ULONG ModifiedWriteCount;
	/*0050*/ _MI_CONTROL_AREA_WAIT_BLOCK * WaitList;
	union {
		struct {
			/*0058*/ ULONG NumberOfSystemCacheViews;
			/*0058*/ ULONG ImageRelocationStartBit;
			/*005c*/ LONG volatile WritableUserReferences;
			/*005c*/ ULONG ImageRelocationSizeIn64k : 16; // 0x0000ffff;
			/*005c*/ ULONG SystemImage : 01; // 0x00010000;
			/*005c*/ ULONG CantMove : 01; // 0x00020000;
			/*005c*/ ULONG StrongCode : 02; // 0x000c0000;
			/*005c*/ ULONG BitMap : 02; // 0x00300000;
			/*005c*/ ULONG ImageActive : 01; // 0x00400000;
			/*005c*/ ULONG ImageBaseOkToReuse : 01; // 0x00800000;
			/*0060*/ ULONG FlushInProgressCount;
			/*0060*/ ULONG NumberOfSubsections;
			/*0060*/ _MI_IMAGE_SECURITY_REFERENCE * SeImageStub;
			/*0068*/
		} e2;
		/*0068*/
	} u2;
	/*0068*/ _EX_PUSH_LOCK FileObjectLock;
	/*0070*/ ULONGLONG volatile LockedPages;
	union {
		/*0078*/ ULONGLONG IoAttributionContext : 61; // 0x1fffffffffffffff;
		/*0078*/ ULONGLONG Spare : 03; // 0xe000000000000000;
		/*0078*/ ULONGLONG ImageCrossPartitionCharge;
		/*0078*/ ULONGLONG CommittedPageCount : 36; // 0x0000000fffffffff;
		/*0080*/
	} u3;
	/*0080*/
};

struct _COUNTER_READING {
	/*0000*/ _HARDWARE_COUNTER_TYPE Type;
	/*0004*/ ULONG Index;
	/*0008*/ ULONGLONG Start;
	/*0010*/ ULONGLONG Total;
	/*0018*/
};

union _CPU_INFO {
	/*0000*/ UINT AsUINT32[0x4];
	/*0000*/ ULONG Eax;
	/*0004*/ ULONG Ebx;
	/*0008*/ ULONG Ecx;
	/*000c*/ ULONG Edx;
	/*0010*/
};

enum _CREATE_FILE_TYPE {
	CreateFileTypeNone = 0x0,
	CreateFileTypeNamedPipe = 0x1,
	CreateFileTypeMailslot = 0x2
};

struct _CRITICAL_PROCESS_EXCEPTION_DATA {
	/*0000*/ _GUID ReportId;
	/*0010*/ _UNICODE_STRING ModuleName;
	/*0020*/ ULONG ModuleTimestamp;
	/*0024*/ ULONG ModuleSize;
	/*0028*/ ULONGLONG Offset;
	/*0030*/
};

struct _CURDIR {
	/*0000*/ _UNICODE_STRING DosPath;
	/*0010*/ void * Handle;
	/*0018*/
};

struct _CUSTOM_SYSTEM_EVENT_TRIGGER_CONFIG {
	/*0000*/ ULONG Size;
	/*0008*/ WCHAR const * TriggerId;
	/*0010*/
};

union _CVDD {
	/*0000*/ ULONG Signature;
	/*0000*/ _NB10 NB10;
	/*0000*/ _RSDS RsDs;
	/*001c*/
};

enum _ConnectionResourceConsumerDesc {
	ConnectionResourceConsumerDescIsUndefined = 0x0,
	ConnectionResourceConsumerDescIsDevice = 0x1,
	ConnectionResourceConsumerDescIsOpregion = 0x2,
	ConnectionResourceConsumerDescMax = 0x3
};

struct _DBGKD_ANY_CONTROL_SET {
	/*0000*/ _X86_DBGKD_CONTROL_SET X86ControlSet;
	/*0000*/ ULONG AlphaControlSet;
	/*0000*/ _IA64_DBGKD_CONTROL_SET IA64ControlSet;
	/*0000*/ _AMD64_DBGKD_CONTROL_SET Amd64ControlSet;
	/*0000*/ _ARM_DBGKD_CONTROL_SET ArmControlSet;
	/*0000*/ _ARM64_DBGKD_CONTROL_SET Arm64ControlSet;
	/*0000*/ _ARMCE_DBGKD_CONTROL_SET ArmCeControlSet;
	/*0000*/ _PPC_DBGKD_CONTROL_SET PpcControlSet;
	/*001c*/
};

struct _DBGKD_BREAKPOINTEX {
	/*0000*/ ULONG BreakPointCount;
	/*0004*/ LONG ContinueStatus;
	/*0008*/
};

struct _DBGKD_CONTEXT_EX {
	/*0000*/ ULONG Offset;
	/*0004*/ ULONG ByteCount;
	/*0008*/ ULONG BytesCopied;
	/*000c*/
};

struct _DBGKD_CONTINUE {
	/*0000*/ LONG ContinueStatus;
	/*0004*/
};

struct _DBGKD_CONTINUE2 {
	/*0000*/ LONG ContinueStatus;
	/*0004*/ _AMD64_DBGKD_CONTROL_SET ControlSet;
	/*0004*/ _DBGKD_ANY_CONTROL_SET AnyControlSet;
	/*0020*/
};

struct _DBGKD_FILL_MEMORY {
	/*0000*/ ULONGLONG Address;
	/*0008*/ ULONG Length;
	/*000c*/ USHORT Flags;
	/*000e*/ USHORT PatternLength;
	/*0010*/
};

struct _DBGKD_GET_CONTEXT {
	/*0000*/ ULONG Unused;
	/*0004*/
};

struct _DBGKD_GET_INTERNAL_BREAKPOINT32 {
	/*0000*/ ULONG BreakpointAddress;
	/*0004*/ ULONG Flags;
	/*0008*/ ULONG Calls;
	/*000c*/ ULONG MaxCallsPerPeriod;
	/*0010*/ ULONG MinInstructions;
	/*0014*/ ULONG MaxInstructions;
	/*0018*/ ULONG TotalInstructions;
	/*001c*/
};

struct _DBGKD_GET_INTERNAL_BREAKPOINT64 {
	/*0000*/ ULONGLONG BreakpointAddress;
	/*0008*/ ULONG Flags;
	/*000c*/ ULONG Calls;
	/*0010*/ ULONG MaxCallsPerPeriod;
	/*0014*/ ULONG MinInstructions;
	/*0018*/ ULONG MaxInstructions;
	/*001c*/ ULONG TotalInstructions;
	/*0020*/
};

struct _DBGKD_GET_SET_BUS_DATA {
	/*0000*/ ULONG BusDataType;
	/*0004*/ ULONG BusNumber;
	/*0008*/ ULONG SlotNumber;
	/*000c*/ ULONG Offset;
	/*0010*/ ULONG Length;
	/*0014*/
};

struct _DBGKD_GET_VERSION32 {
	/*0000*/ USHORT MajorVersion;
	/*0002*/ USHORT MinorVersion;
	/*0004*/ USHORT ProtocolVersion;
	/*0006*/ USHORT Flags;
	/*0008*/ ULONG KernBase;
	/*000c*/ ULONG PsLoadedModuleList;
	/*0010*/ USHORT MachineType;
	/*0012*/ USHORT ThCallbackStack;
	/*0014*/ USHORT NextCallback;
	/*0016*/ USHORT FramePointer;
	/*0018*/ ULONG KiCallUserMode;
	/*001c*/ ULONG KeUserCallbackDispatcher;
	/*0020*/ ULONG BreakpointWithStatus;
	/*0024*/ ULONG DebuggerDataList;
	/*0028*/
};

struct _DBGKD_GET_VERSION64 {
	/*0000*/ USHORT MajorVersion;
	/*0002*/ USHORT MinorVersion;
	/*0004*/ UCHAR ProtocolVersion;
	/*0005*/ UCHAR KdSecondaryVersion;
	/*0006*/ USHORT Flags;
	/*0008*/ USHORT MachineType;
	/*000a*/ UCHAR MaxPacketType;
	/*000b*/ UCHAR MaxStateChange;
	/*000c*/ UCHAR MaxManipulate;
	/*000d*/ UCHAR Simulation;
	/*000e*/ USHORT Unused[0x1];
	/*0010*/ ULONGLONG KernBase;
	/*0018*/ ULONGLONG PsLoadedModuleList;
	/*0020*/ ULONGLONG DebuggerDataList;
	/*0028*/
};

struct _DBGKD_LOAD_SYMBOLS32 {
	/*0000*/ ULONG PathNameLength;
	/*0004*/ ULONG BaseOfDll;
	/*0008*/ ULONG ProcessId;
	/*000c*/ ULONG CheckSum;
	/*0010*/ ULONG SizeOfImage;
	/*0014*/ UCHAR UnloadSymbols;
	/*0018*/
};

struct _DBGKD_LOAD_SYMBOLS64 {
	/*0000*/ ULONG PathNameLength;
	/*0008*/ ULONGLONG BaseOfDll;
	/*0010*/ ULONGLONG ProcessId;
	/*0018*/ ULONG CheckSum;
	/*001c*/ ULONG SizeOfImage;
	/*0020*/ UCHAR UnloadSymbols;
	/*0028*/
};

struct _DBGKD_MANIPULATE_STATE32 {
	/*0000*/ ULONG ApiNumber;
	/*0004*/ USHORT ProcessorLevel;
	/*0006*/ USHORT Processor;
	/*0008*/ LONG ReturnStatus;
	union {
		/*000c*/ _DBGKD_READ_MEMORY32 ReadMemory;
		/*000c*/ _DBGKD_WRITE_MEMORY32 WriteMemory;
		/*000c*/ _DBGKD_READ_MEMORY64 ReadMemory64;
		/*000c*/ _DBGKD_WRITE_MEMORY64 WriteMemory64;
		/*000c*/ _DBGKD_GET_CONTEXT GetContext;
		/*000c*/ _DBGKD_SET_CONTEXT SetContext;
		/*000c*/ _DBGKD_WRITE_BREAKPOINT32 WriteBreakPoint;
		/*000c*/ _DBGKD_RESTORE_BREAKPOINT RestoreBreakPoint;
		/*000c*/ _DBGKD_CONTINUE Continue;
		/*000c*/ _DBGKD_CONTINUE2 Continue2;
		/*000c*/ _DBGKD_READ_WRITE_IO32 ReadWriteIo;
		/*000c*/ _DBGKD_READ_WRITE_IO_EXTENDED32 ReadWriteIoExtended;
		/*000c*/ _DBGKD_QUERY_SPECIAL_CALLS QuerySpecialCalls;
		/*000c*/ _DBGKD_SET_SPECIAL_CALL32 SetSpecialCall;
		/*000c*/ _DBGKD_SET_INTERNAL_BREAKPOINT32 SetInternalBreakpoint;
		/*000c*/ _DBGKD_GET_INTERNAL_BREAKPOINT32 GetInternalBreakpoint;
		/*000c*/ _DBGKD_GET_VERSION32 GetVersion32;
		/*000c*/ _DBGKD_BREAKPOINTEX BreakPointEx;
		/*000c*/ _DBGKD_READ_WRITE_MSR ReadWriteMsr;
		/*000c*/ _DBGKD_SEARCH_MEMORY SearchMemory;
		/*000c*/ _DBGKD_CONTEXT_EX GetContextEx;
		/*000c*/ _DBGKD_CONTEXT_EX SetContextEx;
		/*0034*/
	} u;
	/*0034*/
};

struct _DBGKD_MANIPULATE_STATE64 {
	/*0000*/ ULONG ApiNumber;
	/*0004*/ USHORT ProcessorLevel;
	/*0006*/ USHORT Processor;
	/*0008*/ LONG ReturnStatus;
	union {
		/*0010*/ _DBGKD_READ_MEMORY64 ReadMemory;
		/*0010*/ _DBGKD_WRITE_MEMORY64 WriteMemory;
		/*0010*/ _DBGKD_GET_CONTEXT GetContext;
		/*0010*/ _DBGKD_SET_CONTEXT SetContext;
		/*0010*/ _DBGKD_WRITE_BREAKPOINT64 WriteBreakPoint;
		/*0010*/ _DBGKD_RESTORE_BREAKPOINT RestoreBreakPoint;
		/*0010*/ _DBGKD_CONTINUE Continue;
		/*0010*/ _DBGKD_CONTINUE2 Continue2;
		/*0010*/ _DBGKD_READ_WRITE_IO64 ReadWriteIo;
		/*0010*/ _DBGKD_READ_WRITE_IO_EXTENDED64 ReadWriteIoExtended;
		/*0010*/ _DBGKD_QUERY_SPECIAL_CALLS QuerySpecialCalls;
		/*0010*/ _DBGKD_SET_SPECIAL_CALL64 SetSpecialCall;
		/*0010*/ _DBGKD_SET_INTERNAL_BREAKPOINT64 SetInternalBreakpoint;
		/*0010*/ _DBGKD_GET_INTERNAL_BREAKPOINT64 GetInternalBreakpoint;
		/*0010*/ _DBGKD_GET_VERSION64 GetVersion64;
		/*0010*/ _DBGKD_BREAKPOINTEX BreakPointEx;
		/*0010*/ _DBGKD_READ_WRITE_MSR ReadWriteMsr;
		/*0010*/ _DBGKD_SEARCH_MEMORY SearchMemory;
		/*0010*/ _DBGKD_GET_SET_BUS_DATA GetSetBusData;
		/*0010*/ _DBGKD_FILL_MEMORY FillMemory;
		/*0010*/ _DBGKD_QUERY_MEMORY QueryMemory;
		/*0010*/ _DBGKD_SWITCH_PARTITION SwitchPartition;
		/*0010*/ _DBGKD_CONTEXT_EX GetContextEx;
		/*0010*/ _DBGKD_CONTEXT_EX SetContextEx;
		/*0010*/ _DBGKD_WRITE_CUSTOM_BREAKPOINT WriteCustomBreakPoint;
		/*0038*/
	} u;
	/*0038*/
};

struct _DBGKD_QUERY_MEMORY {
	/*0000*/ ULONGLONG Address;
	/*0008*/ ULONGLONG Reserved;
	/*0010*/ ULONG AddressSpace;
	/*0014*/ ULONG Flags;
	/*0018*/
};

struct _DBGKD_QUERY_SPECIAL_CALLS {
	/*0000*/ ULONG NumberOfSpecialCalls;
	/*0004*/
};

struct _DBGKD_READ_MEMORY32 {
	/*0000*/ ULONG TargetBaseAddress;
	/*0004*/ ULONG TransferCount;
	/*0008*/ ULONG ActualBytesRead;
	/*000c*/
};

struct _DBGKD_READ_MEMORY64 {
	/*0000*/ ULONGLONG TargetBaseAddress;
	/*0008*/ ULONG TransferCount;
	/*000c*/ ULONG ActualBytesRead;
	/*0010*/
};

struct _DBGKD_READ_WRITE_IO32 {
	/*0000*/ ULONG DataSize;
	/*0004*/ ULONG IoAddress;
	/*0008*/ ULONG DataValue;
	/*000c*/
};

struct _DBGKD_READ_WRITE_IO64 {
	/*0000*/ ULONGLONG IoAddress;
	/*0008*/ ULONG DataSize;
	/*000c*/ ULONG DataValue;
	/*0010*/
};

struct _DBGKD_READ_WRITE_IO_EXTENDED32 {
	/*0000*/ ULONG DataSize;
	/*0004*/ ULONG InterfaceType;
	/*0008*/ ULONG BusNumber;
	/*000c*/ ULONG AddressSpace;
	/*0010*/ ULONG IoAddress;
	/*0014*/ ULONG DataValue;
	/*0018*/
};

struct _DBGKD_READ_WRITE_IO_EXTENDED64 {
	/*0000*/ ULONG DataSize;
	/*0004*/ ULONG InterfaceType;
	/*0008*/ ULONG BusNumber;
	/*000c*/ ULONG AddressSpace;
	/*0010*/ ULONGLONG IoAddress;
	/*0018*/ ULONG DataValue;
	/*0020*/
};

struct _DBGKD_READ_WRITE_MSR {
	/*0000*/ ULONG Msr;
	/*0004*/ ULONG DataValueLow;
	/*0008*/ ULONG DataValueHigh;
	/*000c*/
};

struct _DBGKD_RESTORE_BREAKPOINT {
	/*0000*/ ULONG BreakPointHandle;
	/*0004*/
};

struct _DBGKD_SEARCH_MEMORY {
	/*0000*/ ULONGLONG SearchAddress;
	/*0000*/ ULONGLONG FoundAddress;
	/*0008*/ ULONGLONG SearchLength;
	/*0010*/ ULONG PatternLength;
	/*0018*/
};

struct _DBGKD_SET_CONTEXT {
	/*0000*/ ULONG ContextFlags;
	/*0004*/
};

struct _DBGKD_SET_INTERNAL_BREAKPOINT32 {
	/*0000*/ ULONG BreakpointAddress;
	/*0004*/ ULONG Flags;
	/*0008*/
};

struct _DBGKD_SET_INTERNAL_BREAKPOINT64 {
	/*0000*/ ULONGLONG BreakpointAddress;
	/*0008*/ ULONG Flags;
	/*0010*/
};

struct _DBGKD_SET_SPECIAL_CALL32 {
	/*0000*/ ULONG SpecialCall;
	/*0004*/
};

struct _DBGKD_SET_SPECIAL_CALL64 {
	/*0000*/ ULONGLONG SpecialCall;
	/*0008*/
};

struct _DBGKD_SWITCH_PARTITION {
	/*0000*/ ULONG Partition;
	/*0004*/
};

struct _DBGKD_WRITE_BREAKPOINT32 {
	/*0000*/ ULONG BreakPointAddress;
	/*0004*/ ULONG BreakPointHandle;
	/*0008*/
};

struct _DBGKD_WRITE_BREAKPOINT64 {
	/*0000*/ ULONGLONG BreakPointAddress;
	/*0008*/ ULONG BreakPointHandle;
	/*0010*/
};

struct _DBGKD_WRITE_CUSTOM_BREAKPOINT {
	/*0000*/ ULONGLONG BreakPointAddress;
	/*0008*/ ULONGLONG BreakPointInstruction;
	/*0010*/ ULONG BreakPointHandle;
	/*0014*/ UCHAR BreakPointInstructionSize;
	/*0015*/ UCHAR BreakPointInstructionAlignment;
	/*0018*/
};

struct _DBGKD_WRITE_MEMORY32 {
	/*0000*/ ULONG TargetBaseAddress;
	/*0004*/ ULONG TransferCount;
	/*0008*/ ULONG ActualBytesWritten;
	/*000c*/
};

struct _DBGKD_WRITE_MEMORY64 {
	/*0000*/ ULONGLONG TargetBaseAddress;
	/*0008*/ ULONG TransferCount;
	/*000c*/ ULONG ActualBytesWritten;
	/*0010*/
};

struct _DBGKM_EXCEPTION32 {
	/*0000*/ _EXCEPTION_RECORD32 ExceptionRecord;
	/*0050*/ ULONG FirstChance;
	/*0054*/
};

struct _DBGKM_EXCEPTION64 {
	/*0000*/ _EXCEPTION_RECORD64 ExceptionRecord;
	/*0098*/ ULONG FirstChance;
	/*00a0*/
};

struct _DBGKP_ERROR_PORT;

struct _DBGK_SILOSTATE {
	/*0000*/ _EX_PUSH_LOCK ErrorPortLock;
	/*0008*/ _DBGKP_ERROR_PORT * ErrorPort;
	/*0010*/ _EPROCESS * ErrorProcess;
	/*0018*/ _KEVENT * ErrorPortRegisteredEvent;
	/*0020*/
};

struct _DEBUG_DEVICE_DESCRIPTOR {
	/*0000*/ ULONG Bus;
	/*0004*/ ULONG Slot;
	/*0008*/ USHORT Segment;
	/*000a*/ USHORT VendorID;
	/*000c*/ USHORT DeviceID;
	/*000e*/ UCHAR BaseClass;
	/*000f*/ UCHAR SubClass;
	/*0010*/ UCHAR ProgIf;
	/*0011*/ UCHAR Flags;
	/*0011*/ UCHAR DbgHalScratchAllocated : 01; // 0x01;
	/*0011*/ UCHAR DbgBarsMapped : 01; // 0x02;
	/*0011*/ UCHAR DbgScratchAllocated : 01; // 0x04;
	/*0012*/ UCHAR Initialized;
	/*0013*/ UCHAR Configured;
	/*0018*/ DEBUG_DEVICE_ADDRESS BaseAddress[0x6];
	/*00a8*/ DEBUG_MEMORY_REQUIREMENTS Memory;
	/*00c8*/ ULONG Dbg2TableIndex;
	/*00cc*/ USHORT PortType;
	/*00ce*/ USHORT PortSubtype;
	/*00d0*/ void * OemData;
	/*00d8*/ ULONG OemDataLength;
	/*00dc*/ KD_NAMESPACE_ENUM NameSpace;
	/*00e0*/ WCHAR * NameSpacePath;
	/*00e8*/ ULONG NameSpacePathLength;
	/*00ec*/ ULONG TransportType;
	/*00f0*/ _DEBUG_TRANSPORT_DATA TransportData;
	/*00f8*/
};

struct _DEBUG_TRANSPORT_DATA {
	/*0000*/ ULONG HwContextSize;
	/*0004*/ UCHAR UseSerialFraming;
	/*0005*/ UCHAR ValidUSBCoreId;
	/*0006*/ UCHAR USBCoreId;
	/*0008*/
};

struct _DEFERRED_WRITE {
	/*0000*/ SHORT NodeTypeCode;
	/*0002*/ SHORT NodeByteSize;
	/*0008*/ _FILE_OBJECT * FileObject;
	/*0010*/ ULONG BytesToWrite;
	/*0018*/ _LIST_ENTRY DeferredWriteLinks;
	/*0028*/ _KEVENT * Event;
	/*0030*/ void (* PostRoutine)( void * , void * );
	/*0038*/ void * Context1;
	/*0040*/ void * Context2;
	/*0048*/ _CC_PARTITION * Partition;
	/*0050*/
};

struct _DELAY_ACK_FO {
	/*0000*/ _LIST_ENTRY Links;
	/*0010*/ _FILE_OBJECT * OriginalFileObject;
	/*0018*/
};

struct _DEVICE_CAPABILITIES {
	/*0000*/ USHORT Size;
	/*0002*/ USHORT Version;
	/*0004*/ ULONG DeviceD1 : 01; // 0x00000001;
	/*0004*/ ULONG DeviceD2 : 01; // 0x00000002;
	/*0004*/ ULONG LockSupported : 01; // 0x00000004;
	/*0004*/ ULONG EjectSupported : 01; // 0x00000008;
	/*0004*/ ULONG Removable : 01; // 0x00000010;
	/*0004*/ ULONG DockDevice : 01; // 0x00000020;
	/*0004*/ ULONG UniqueID : 01; // 0x00000040;
	/*0004*/ ULONG SilentInstall : 01; // 0x00000080;
	/*0004*/ ULONG RawDeviceOK : 01; // 0x00000100;
	/*0004*/ ULONG SurpriseRemovalOK : 01; // 0x00000200;
	/*0004*/ ULONG WakeFromD0 : 01; // 0x00000400;
	/*0004*/ ULONG WakeFromD1 : 01; // 0x00000800;
	/*0004*/ ULONG WakeFromD2 : 01; // 0x00001000;
	/*0004*/ ULONG WakeFromD3 : 01; // 0x00002000;
	/*0004*/ ULONG HardwareDisabled : 01; // 0x00004000;
	/*0004*/ ULONG NonDynamic : 01; // 0x00008000;
	/*0004*/ ULONG WarmEjectSupported : 01; // 0x00010000;
	/*0004*/ ULONG NoDisplayInUI : 01; // 0x00020000;
	/*0004*/ ULONG Reserved1 : 01; // 0x00040000;
	/*0004*/ ULONG WakeFromInterrupt : 01; // 0x00080000;
	/*0004*/ ULONG SecureDevice : 01; // 0x00100000;
	/*0004*/ ULONG ChildOfVgaEnabledBridge : 01; // 0x00200000;
	/*0004*/ ULONG DecodeIoOnBoot : 01; // 0x00400000;
	/*0004*/ ULONG Reserved : 09; // 0xff800000;
	/*0008*/ ULONG Address;
	/*000c*/ ULONG UINumber;
	/*0010*/ _DEVICE_POWER_STATE DeviceState[0x7];
	/*002c*/ _SYSTEM_POWER_STATE SystemWake;
	/*0030*/ _DEVICE_POWER_STATE DeviceWake;
	/*0034*/ ULONG D1Latency;
	/*0038*/ ULONG D2Latency;
	/*003c*/ ULONG D3Latency;
	/*0040*/
};

struct _DEVICE_DATA_SET_RANGE {
	/*0000*/ LONGLONG StartingOffset;
	/*0008*/ ULONGLONG LengthInBytes;
	/*0010*/
};

struct _DEVICE_DESCRIPTION {
	/*0000*/ ULONG Version;
	/*0004*/ UCHAR Master;
	/*0005*/ UCHAR ScatterGather;
	/*0006*/ UCHAR DemandMode;
	/*0007*/ UCHAR AutoInitialize;
	/*0008*/ UCHAR Dma32BitAddresses;
	/*0009*/ UCHAR IgnoreCount;
	/*000a*/ UCHAR Reserved1;
	/*000b*/ UCHAR Dma64BitAddresses;
	/*000c*/ ULONG BusNumber;
	/*0010*/ ULONG DmaChannel;
	/*0014*/ _INTERFACE_TYPE InterfaceType;
	/*0018*/ _DMA_WIDTH DmaWidth;
	/*001c*/ _DMA_SPEED DmaSpeed;
	/*0020*/ ULONG MaximumLength;
	/*0024*/ ULONG DmaPort;
	/*0028*/ ULONG DmaAddressWidth;
	/*002c*/ ULONG DmaControllerInstance;
	/*0030*/ ULONG DmaRequestLine;
	/*0038*/ _LARGE_INTEGER DeviceAddress;
	/*0040*/
};

struct _DEVICE_DSM_DEFINITION {
	/*0000*/ ULONG Action;
	/*0004*/ UCHAR SingleRange;
	/*0008*/ ULONG ParameterBlockAlignment;
	/*000c*/ ULONG ParameterBlockLength;
	/*0010*/ UCHAR HasOutput;
	/*0014*/ ULONG OutputBlockAlignment;
	/*0018*/ ULONG OutputBlockLength;
	/*001c*/
};

struct _DEVICE_FAULT_CONFIGURATION {
	/*0000*/ void (* FaultHandler)( void * , _FAULT_INFORMATION * );
	/*0008*/ void * FaultContext;
	/*0010*/
};

struct _DEVICE_FLAGS {
	/*0000*/ ULONG Failed : 01; // 0x00000001;
	/*0000*/ ULONG ReadOnly : 01; // 0x00000002;
	/*0000*/ ULONG Removable : 01; // 0x00000004;
	/*0000*/ ULONG ConsoleIn : 01; // 0x00000008;
	/*0000*/ ULONG ConsoleOut : 01; // 0x00000010;
	/*0000*/ ULONG Input : 01; // 0x00000020;
	/*0000*/ ULONG Output : 01; // 0x00000040;
	/*0004*/
};

struct _DEVICE_MANAGE_DATA_SET_ATTRIBUTES {
	/*0000*/ ULONG Size;
	/*0004*/ ULONG Action;
	/*0008*/ ULONG Flags;
	/*000c*/ ULONG ParameterBlockOffset;
	/*0010*/ ULONG ParameterBlockLength;
	/*0014*/ ULONG DataSetRangesOffset;
	/*0018*/ ULONG DataSetRangesLength;
	/*001c*/
};

struct _DEVICE_MANAGE_DATA_SET_ATTRIBUTES_OUTPUT {
	/*0000*/ ULONG Size;
	/*0004*/ ULONG Action;
	/*0008*/ ULONG Flags;
	/*000c*/ ULONG OperationStatus;
	/*0010*/ ULONG ExtendedError;
	/*0014*/ ULONG TargetDetailedError;
	/*0018*/ ULONG ReservedStatus;
	/*001c*/ ULONG OutputBlockOffset;
	/*0020*/ ULONG OutputBlockLength;
	/*0024*/
};

struct _DEVICE_MAP {
	/*0000*/ _OBJECT_DIRECTORY * DosDevicesDirectory;
	/*0008*/ _OBJECT_DIRECTORY * GlobalDosDevicesDirectory;
	/*0010*/ void * DosDevicesDirectoryHandle;
	/*0018*/ LONG volatile ReferenceCount;
	/*001c*/ ULONG DriveMap;
	/*0020*/ UCHAR DriveType[0x20];
	/*0040*/ _EJOB * ServerSilo;
	/*0048*/
};

struct _DEVICE_NODE {
	/*0000*/ _DEVICE_NODE * Sibling;
	/*0008*/ _DEVICE_NODE * Child;
	/*0010*/ _DEVICE_NODE * Parent;
	/*0018*/ _DEVICE_NODE * LastChild;
	/*0020*/ _DEVICE_OBJECT * PhysicalDeviceObject;
	/*0028*/ _UNICODE_STRING InstancePath;
	/*0038*/ _UNICODE_STRING ServiceName;
	/*0048*/ _IRP * PendingIrp;
	/*0050*/ _POP_FX_DEVICE * FxDevice;
	/*0058*/ LONG volatile FxDeviceLock;
	/*0060*/ _KEVENT FxRemoveEvent;
	/*0078*/ LONG volatile FxActivationCount;
	/*007c*/ LONG volatile FxSleepCount;
	/*0080*/ _POP_FX_PLUGIN * Plugin;
	/*0088*/ ULONG Level;
	/*008c*/ _POWER_STATE CurrentPowerState;
	/*0090*/ _PO_DEVICE_NOTIFY Notify;
	/*00f8*/ _PO_IRP_MANAGER PoIrpManager;
	/*0118*/ _UNICODE_STRING UniqueId;
	/*0128*/ ULONG PowerFlags;
	/*012c*/ _PNP_DEVNODE_STATE State;
	/*0130*/ _PNP_DEVNODE_STATE PreviousState;
	/*0134*/ _PNP_DEVNODE_STATE StateHistory[0x14];
	/*0184*/ ULONG StateHistoryEntry;
	/*0188*/ LONG CompletionStatus;
	/*018c*/ ULONG Flags;
	/*0190*/ ULONG UserFlags;
	/*0194*/ ULONG Problem;
	/*0198*/ LONG ProblemStatus;
	/*01a0*/ _CM_RESOURCE_LIST * ResourceList;
	/*01a8*/ _CM_RESOURCE_LIST * ResourceListTranslated;
	/*01b0*/ _DEVICE_OBJECT * DuplicatePDO;
	/*01b8*/ _IO_RESOURCE_REQUIREMENTS_LIST * ResourceRequirements;
	/*01c0*/ _INTERFACE_TYPE InterfaceType;
	/*01c4*/ ULONG BusNumber;
	/*01c8*/ _INTERFACE_TYPE ChildInterfaceType;
	/*01cc*/ ULONG ChildBusNumber;
	/*01d0*/ USHORT ChildBusTypeIndex;
	/*01d2*/ UCHAR RemovalPolicy;
	/*01d3*/ UCHAR HardwareRemovalPolicy;
	/*01d8*/ _LIST_ENTRY TargetDeviceNotify;
	/*01e8*/ _LIST_ENTRY DeviceArbiterList;
	/*01f8*/ _LIST_ENTRY DeviceTranslatorList;
	/*0208*/ USHORT NoTranslatorMask;
	/*020a*/ USHORT QueryTranslatorMask;
	/*020c*/ USHORT NoArbiterMask;
	/*020e*/ USHORT QueryArbiterMask;
	union {
		/*0210*/ _DEVICE_NODE * LegacyDeviceNode;
		/*0210*/ _DEVICE_RELATIONS * PendingDeviceRelations;
		/*0210*/ void * Information;
		/*0218*/
	} OverUsed1;
	union {
		/*0218*/ _DEVICE_NODE * NextResourceDeviceNode;
		/*0220*/
	} OverUsed2;
	/*0220*/ _CM_RESOURCE_LIST * BootResources;
	/*0228*/ _CM_RESOURCE_LIST * BootResourcesTranslated;
	/*0230*/ ULONG CapabilityFlags;
	struct {
		/*0238*/ PROFILE_STATUS DockStatus;
		/*0240*/ _LIST_ENTRY ListEntry;
		/*0250*/ WCHAR * SerialNumber;
		/*0258*/
	} DockInfo;
	/*0258*/ ULONG DisableableDepends;
	/*0260*/ _LIST_ENTRY PendedSetInterfaceState;
	/*0270*/ _LIST_ENTRY LegacyBusListEntry;
	/*0280*/ ULONG DriverUnloadRetryCount;
	/*0288*/ _DEVICE_NODE * PreviousParent;
	/*0290*/ LONG DeletedChildren;
	/*0294*/ ULONG NumaNodeIndex;
	/*0298*/ _GUID ContainerID;
	/*02a8*/ UCHAR OverrideFlags;
	/*02ac*/ ULONG DeviceIdsHash;
	/*02b0*/ UCHAR RequiresUnloadedDriver;
	/*02b8*/ _PENDING_RELATIONS_LIST_ENTRY * PendingEjectRelations;
	/*02c0*/ ULONG StateFlags;
	/*02c8*/ _PNP_REBALANCE_TRACE_CONTEXT * RebalanceContext;
	/*02d0*/ _DEVICE_NODE_IOMMU_EXTENSION * IommuExtension;
	/*02d8*/ _PO_DIRECTED_DRIPS_STATE DirectedDripsState;
	/*0310*/
};

struct _DEVICE_NODE_IOMMU_EXTENSION;

struct _DEVICE_OBJECT {
	/*0000*/ SHORT Type;
	/*0002*/ USHORT Size;
	/*0004*/ LONG ReferenceCount;
	/*0008*/ _DRIVER_OBJECT * DriverObject;
	/*0010*/ _DEVICE_OBJECT * NextDevice;
	/*0018*/ _DEVICE_OBJECT * AttachedDevice;
	/*0020*/ _IRP * CurrentIrp;
	/*0028*/ _IO_TIMER * Timer;
	/*0030*/ ULONG Flags;
	/*0034*/ ULONG Characteristics;
	/*0038*/ _VPB * Vpb;
	/*0040*/ void * DeviceExtension;
	/*0048*/ ULONG DeviceType;
	/*004c*/ CHAR StackSize;
	union {
		/*0050*/ _LIST_ENTRY ListEntry;
		/*0050*/ _WAIT_CONTEXT_BLOCK Wcb;
		/*0098*/
	} Queue;
	/*0098*/ ULONG AlignmentRequirement;
	/*00a0*/ _KDEVICE_QUEUE DeviceQueue;
	/*00c8*/ _KDPC Dpc;
	/*0108*/ ULONG ActiveThreadCount;
	/*0110*/ void * SecurityDescriptor;
	/*0118*/ _KEVENT DeviceLock;
	/*0130*/ USHORT SectorSize;
	/*0132*/ USHORT Spare1;
	/*0138*/ _DEVOBJ_EXTENSION * DeviceObjectExtension;
	/*0140*/ void * Reserved;
	/*0150*/
};

struct _DEVICE_OBJECT_LIST {
	/*0000*/ ULONG Count;
	/*0004*/ ULONG MaxCount;
	/*0008*/ ULONG TagCount;
	/*000c*/ _PNP_DEVICE_DELETE_TYPE OperationCode;
	/*0010*/ _DEVICE_OBJECT_LIST_ENTRY Devices[0x1];
	/*0028*/
};

struct _DEVICE_OBJECT_LIST_ENTRY {
	/*0000*/ _DEVICE_OBJECT * DeviceObject;
	/*0008*/ _DEVICE_RELATION_LEVEL RelationLevel;
	/*000c*/ ULONG Ordinal;
	/*0010*/ ULONG Flags;
	/*0018*/
};

struct _DEVICE_OBJECT_POWER_EXTENSION {
	/*0000*/ ULONG volatile IdleCount;
	/*0004*/ ULONG volatile BusyCount;
	/*0008*/ ULONG volatile BusyReference;
	/*000c*/ ULONG TotalBusyCount;
	/*0010*/ ULONG ConservationIdleTime;
	/*0014*/ ULONG PerformanceIdleTime;
	/*0018*/ _DEVICE_OBJECT * DeviceObject;
	/*0020*/ _LIST_ENTRY IdleList;
	/*0030*/ _POP_DEVICE_IDLE_TYPE IdleType;
	/*0034*/ _DEVICE_POWER_STATE IdleState;
	/*0038*/ _DEVICE_POWER_STATE CurrentState;
	/*0040*/ _POP_COOLING_EXTENSION * CoolingExtension;
	/*0048*/ _LIST_ENTRY Volume;
	union {
		struct {
			/*0058*/ ULONG IdleTime;
			/*005c*/ ULONG NonIdleTime;
			/*0060*/
		} Disk;
		/*0060*/
	} Specific;
	/*0060*/
};

enum _DEVICE_POWER_STATE {
	PowerDeviceUnspecified = 0x0,
	PowerDeviceD0 = 0x1,
	PowerDeviceD1 = 0x2,
	PowerDeviceD2 = 0x3,
	PowerDeviceD3 = 0x4,
	PowerDeviceMaximum = 0x5
};

struct _DEVICE_RELATIONS {
	/*0000*/ ULONG Count;
	/*0008*/ _DEVICE_OBJECT * Objects[0x1];
	/*0010*/
};

enum _DEVICE_RELATION_LEVEL {
	RELATION_LEVEL_REMOVE_EJECT = 0x0,
	RELATION_LEVEL_DEPENDENT = 0x1,
	RELATION_LEVEL_DIRECT_DESCENDANT = 0x2
};

enum _DEVICE_RELATION_TYPE {
	BusRelations = 0x0,
	EjectionRelations = 0x1,
	PowerRelations = 0x2,
	RemovalRelations = 0x3,
	TargetDeviceRelation = 0x4,
	SingleBusRelations = 0x5,
	TransportRelations = 0x6
};

enum _DEVICE_USAGE_NOTIFICATION_TYPE {
	DeviceUsageTypeUndefined = 0x0,
	DeviceUsageTypePaging = 0x1,
	DeviceUsageTypeHibernation = 0x2,
	DeviceUsageTypeDumpFile = 0x3,
	DeviceUsageTypeBoot = 0x4,
	DeviceUsageTypePostDisplay = 0x5,
	DeviceUsageTypeGuestAssigned = 0x6
};

enum _DEVICE_WAKE_DEPTH {
	DeviceWakeDepthNotWakeable = 0x0,
	DeviceWakeDepthD0 = 0x1,
	DeviceWakeDepthD1 = 0x2,
	DeviceWakeDepthD2 = 0x3,
	DeviceWakeDepthD3hot = 0x4,
	DeviceWakeDepthD3cold = 0x5,
	DeviceWakeDepthMaximum = 0x6
};

struct _DEVOBJ_EXTENSION {
	/*0000*/ SHORT Type;
	/*0002*/ USHORT Size;
	/*0008*/ _DEVICE_OBJECT * DeviceObject;
	/*0010*/ ULONG PowerFlags;
	/*0018*/ _DEVICE_OBJECT_POWER_EXTENSION * Dope;
	/*0020*/ ULONG ExtensionFlags;
	/*0028*/ void * DeviceNode;
	/*0030*/ _DEVICE_OBJECT * AttachedTo;
	/*0038*/ LONG StartIoCount;
	/*003c*/ LONG StartIoKey;
	/*0040*/ ULONG StartIoFlags;
	/*0048*/ _VPB * Vpb;
	/*0050*/ void * DependencyNode;
	/*0058*/ void * InterruptContext;
	/*0060*/ void * VerifierContext;
	/*0068*/
};

enum _DEVPROP_OPERATOR {
	DEVPROP_OPERATOR_MODIFIER_NOT = 0x10000,
	DEVPROP_OPERATOR_MODIFIER_IGNORE_CASE = 0x20000,
	DEVPROP_OPERATOR_NONE = 0x0,
	DEVPROP_OPERATOR_EXISTS = 0x1,
	DEVPROP_OPERATOR_NOT_EXISTS = 0x10001,
	DEVPROP_OPERATOR_EQUALS = 0x2,
	DEVPROP_OPERATOR_NOT_EQUALS = 0x10002,
	DEVPROP_OPERATOR_GREATER_THAN = 0x3,
	DEVPROP_OPERATOR_LESS_THAN = 0x4,
	DEVPROP_OPERATOR_GREATER_THAN_EQUALS = 0x5,
	DEVPROP_OPERATOR_LESS_THAN_EQUALS = 0x6,
	DEVPROP_OPERATOR_EQUALS_IGNORE_CASE = 0x20002,
	DEVPROP_OPERATOR_NOT_EQUALS_IGNORE_CASE = 0x30002,
	DEVPROP_OPERATOR_BITWISE_AND = 0x7,
	DEVPROP_OPERATOR_BITWISE_OR = 0x8,
	DEVPROP_OPERATOR_BEGINS_WITH = 0x9,
	DEVPROP_OPERATOR_ENDS_WITH = 0xa,
	DEVPROP_OPERATOR_CONTAINS = 0xb,
	DEVPROP_OPERATOR_BEGINS_WITH_IGNORE_CASE = 0x20009,
	DEVPROP_OPERATOR_ENDS_WITH_IGNORE_CASE = 0x2000a,
	DEVPROP_OPERATOR_CONTAINS_IGNORE_CASE = 0x2000b,
	DEVPROP_OPERATOR_LIST_CONTAINS = 0x1000,
	DEVPROP_OPERATOR_LIST_ELEMENT_BEGINS_WITH = 0x2000,
	DEVPROP_OPERATOR_LIST_ELEMENT_ENDS_WITH = 0x3000,
	DEVPROP_OPERATOR_LIST_ELEMENT_CONTAINS = 0x4000,
	DEVPROP_OPERATOR_LIST_CONTAINS_IGNORE_CASE = 0x21000,
	DEVPROP_OPERATOR_LIST_ELEMENT_BEGINS_WITH_IGNORE_CASE = 0x22000,
	DEVPROP_OPERATOR_LIST_ELEMENT_ENDS_WITH_IGNORE_CASE = 0x23000,
	DEVPROP_OPERATOR_LIST_ELEMENT_CONTAINS_IGNORE_CASE = 0x24000,
	DEVPROP_OPERATOR_AND_OPEN = 0x100000,
	DEVPROP_OPERATOR_AND_CLOSE = 0x200000,
	DEVPROP_OPERATOR_OR_OPEN = 0x300000,
	DEVPROP_OPERATOR_OR_CLOSE = 0x400000,
	DEVPROP_OPERATOR_NOT_OPEN = 0x500000,
	DEVPROP_OPERATOR_NOT_CLOSE = 0x600000,
	DEVPROP_OPERATOR_ARRAY_CONTAINS = 0x10000000,
	DEVPROP_OPERATOR_MASK_EVAL = 0xfff,
	DEVPROP_OPERATOR_MASK_LIST = 0xf000,
	DEVPROP_OPERATOR_MASK_MODIFIER = 0xf0000,
	DEVPROP_OPERATOR_MASK_NOT_LOGICAL = 0xf00fffff,
	DEVPROP_OPERATOR_MASK_LOGICAL = 0xff00000,
	DEVPROP_OPERATOR_MASK_ARRAY = 0xf0000000
};

struct _DIAGNOSTIC_BUFFER {
	/*0000*/ ULONGLONG Size;
	/*0008*/ _REQUESTER_TYPE CallerType;
	/*0010*/ ULONGLONG ProcessImageNameOffset;
	/*0018*/ ULONG ProcessId;
	/*001c*/ ULONG ServiceTag;
	/*0010*/ ULONGLONG DeviceDescriptionOffset;
	/*0018*/ ULONGLONG DevicePathOffset;
	/*0020*/ ULONGLONG ReasonOffset;
	/*0028*/
};

struct _DIAGNOSTIC_CONTEXT {
	/*0000*/ _REQUESTER_TYPE CallerType;
	/*0008*/ _EPROCESS * Process;
	/*0010*/ ULONG ServiceTag;
	/*0008*/ _DEVICE_OBJECT * DeviceObject;
	/*0018*/ ULONGLONG ReasonSize;
	/*0020*/
};

enum _DIRECTORY_NOTIFY_INFORMATION_CLASS {
	DirectoryNotifyInformation = 0x1,
	DirectoryNotifyExtendedInformation = 0x2
};

struct _DIRTY_PAGE_STATISTICS {
	/*0000*/ ULONGLONG DirtyPages;
	/*0008*/ ULONGLONG DirtyPagesLastScan;
	/*0010*/ ULONG DirtyPagesScheduledLastScan;
	/*0018*/
};

struct _DIRTY_PAGE_THRESHOLDS {
	/*0000*/ ULONGLONG DirtyPageThreshold;
	/*0008*/ ULONGLONG DirtyPageThresholdTop;
	/*0010*/ ULONGLONG DirtyPageThresholdBottom;
	/*0018*/ ULONG DirtyPageTarget;
	/*0020*/ ULONGLONG AggregateAvailablePages;
	/*0028*/ ULONGLONG AggregateDirtyPages;
	/*0030*/ ULONG AvailableHistory;
	/*0038*/
};

struct _DISALLOWED_GUIDS {
	/*0000*/ USHORT Count;
	/*0008*/ _GUID * Guids;
	/*0010*/
};

struct _DISPATCHER_HEADER {
	/*0000*/ LONG volatile Lock;
	/*0000*/ LONG LockNV;
	/*0000*/ UCHAR Type;
	/*0001*/ UCHAR Signalling;
	/*0002*/ UCHAR Size;
	/*0003*/ UCHAR Reserved1;
	/*0000*/ UCHAR TimerType;
	/*0001*/ UCHAR TimerControlFlags;
	/*0001*/ UCHAR Absolute : 01; // 0x01;
	/*0001*/ UCHAR Wake : 01; // 0x02;
	/*0001*/ UCHAR EncodedTolerableDelay : 06; // 0xfc;
	/*0002*/ UCHAR Hand;
	/*0003*/ UCHAR TimerMiscFlags;
	/*0003*/ UCHAR Index : 06; // 0x3f;
	/*0003*/ UCHAR Inserted : 01; // 0x40;
	/*0003*/ UCHAR volatile Expired : 01; // 0x80;
	/*0000*/ UCHAR Timer2Type;
	/*0001*/ UCHAR Timer2Flags;
	/*0001*/ UCHAR Timer2Inserted : 01; // 0x01;
	/*0001*/ UCHAR Timer2Expiring : 01; // 0x02;
	/*0001*/ UCHAR Timer2CancelPending : 01; // 0x04;
	/*0001*/ UCHAR Timer2SetPending : 01; // 0x08;
	/*0001*/ UCHAR Timer2Running : 01; // 0x10;
	/*0001*/ UCHAR Timer2Disabled : 01; // 0x20;
	/*0001*/ UCHAR Timer2ReservedFlags : 02; // 0xc0;
	/*0002*/ UCHAR Timer2ComponentId;
	/*0003*/ UCHAR Timer2RelativeId;
	/*0000*/ UCHAR QueueType;
	/*0001*/ UCHAR QueueControlFlags;
	/*0001*/ UCHAR Abandoned : 01; // 0x01;
	/*0001*/ UCHAR DisableIncrement : 01; // 0x02;
	/*0001*/ UCHAR QueueReservedControlFlags : 06; // 0xfc;
	/*0002*/ UCHAR QueueSize;
	/*0003*/ UCHAR QueueReserved;
	/*0000*/ UCHAR ThreadType;
	/*0001*/ UCHAR ThreadReserved;
	/*0002*/ UCHAR ThreadControlFlags;
	/*0002*/ UCHAR CycleProfiling : 01; // 0x01;
	/*0002*/ UCHAR CounterProfiling : 01; // 0x02;
	/*0002*/ UCHAR GroupScheduling : 01; // 0x04;
	/*0002*/ UCHAR AffinitySet : 01; // 0x08;
	/*0002*/ UCHAR Tagged : 01; // 0x10;
	/*0002*/ UCHAR EnergyProfiling : 01; // 0x20;
	/*0002*/ UCHAR SchedulerAssist : 01; // 0x40;
	/*0002*/ UCHAR ThreadReservedControlFlags : 01; // 0x80;
	/*0003*/ UCHAR DebugActive;
	/*0003*/ UCHAR ActiveDR7 : 01; // 0x01;
	/*0003*/ UCHAR Instrumented : 01; // 0x02;
	/*0003*/ UCHAR Minimal : 01; // 0x04;
	/*0003*/ UCHAR Reserved4 : 03; // 0x38;
	/*0003*/ UCHAR UmsScheduled : 01; // 0x40;
	/*0003*/ UCHAR UmsPrimary : 01; // 0x80;
	/*0000*/ UCHAR MutantType;
	/*0001*/ UCHAR MutantSize;
	/*0002*/ UCHAR DpcActive;
	/*0003*/ UCHAR MutantReserved;
	/*0004*/ LONG SignalState;
	/*0008*/ _LIST_ENTRY WaitListHead;
	/*0018*/
};

struct _DMA_IOMMU_INTERFACE {
	/*0000*/ ULONG Version;
	/*0008*/ LONG (* CreateDomain)( UCHAR , _IOMMU_DMA_DOMAIN * * );
	/*0010*/ LONG (* DeleteDomain)( _IOMMU_DMA_DOMAIN * );
	/*0018*/ LONG (* AttachDevice)( _IOMMU_DMA_DOMAIN * , _DEVICE_OBJECT * , ULONG , ULONG );
	/*0020*/ LONG (* DetachDevice)( _IOMMU_DMA_DOMAIN * , _DEVICE_OBJECT * , ULONG );
	/*0028*/ LONG (* FlushDomain)( _IOMMU_DMA_DOMAIN * );
	/*0030*/ LONG (* FlushDomainByVaList)( _IOMMU_DMA_DOMAIN * , UCHAR , ULONG , void * );
	/*0038*/ LONG (* QueryInputMappings)( _DEVICE_OBJECT * , _INPUT_MAPPING_ELEMENT * , ULONG , ULONG * );
	/*0040*/ LONG (* MapLogicalRange)( _IOMMU_DMA_DOMAIN * , ULONG , _MDL * , ULONGLONG );
	/*0048*/ LONG (* UnmapLogicalRange)( _IOMMU_DMA_DOMAIN * , ULONGLONG , ULONGLONG );
	/*0050*/ LONG (* MapIdentityRange)( _IOMMU_DMA_DOMAIN * , ULONG , _MDL * );
	/*0058*/ LONG (* UnmapIdentityRange)( _IOMMU_DMA_DOMAIN * , _MDL * );
	/*0060*/ LONG (* SetDeviceFaultReporting)( _DEVICE_OBJECT * , ULONG , UCHAR , _DEVICE_FAULT_CONFIGURATION * );
	/*0068*/ LONG (* ConfigureDomain)( _IOMMU_DMA_DOMAIN * , _DOMAIN_CONFIGURATION * );
	/*0070*/
};

enum _DMA_SPEED {
	Compatible = 0x0,
	TypeA = 0x1,
	TypeB = 0x2,
	TypeC = 0x3,
	TypeF = 0x4,
	MaximumDmaSpeed = 0x5
};

enum _DMA_WIDTH {
	Width8Bits = 0x0,
	Width16Bits = 0x1,
	Width32Bits = 0x2,
	Width64Bits = 0x3,
	WidthNoWrap = 0x4,
	MaximumDmaWidth = 0x5
};

struct _DOMAIN_CONFIGURATION {
	/*0000*/ _DOMAIN_CONFIGURATION_ARCH Type;
	/*0008*/ _DOMAIN_CONFIGURATION_ARM64 Arm64;
	/*0028*/
};

enum _DOMAIN_CONFIGURATION_ARCH {
	DomainConfigurationArm64 = 0x0,
	DomainConfigurationInvalid = 0x1
};

struct _DOMAIN_CONFIGURATION_ARM64 {
	/*0000*/ _LARGE_INTEGER Ttbr0;
	/*0008*/ _LARGE_INTEGER Ttbr1;
	/*0010*/ ULONG Mair0;
	/*0014*/ ULONG Mair1;
	/*0018*/ UCHAR InputSize0;
	/*0019*/ UCHAR InputSize1;
	/*001a*/ UCHAR CoherentTableWalks;
	/*001b*/ UCHAR TranslationEnabled;
	/*0020*/
};

struct _DRIVER_EXTENSION {
	/*0000*/ _DRIVER_OBJECT * DriverObject;
	/*0008*/ LONG (* AddDevice)( _DRIVER_OBJECT * , _DEVICE_OBJECT * );
	/*0010*/ ULONG Count;
	/*0018*/ _UNICODE_STRING ServiceKeyName;
	/*0028*/ _IO_CLIENT_EXTENSION * ClientDriverExtension;
	/*0030*/ _FS_FILTER_CALLBACKS * FsFilterCallbacks;
	/*0038*/ void * KseCallbacks;
	/*0040*/ void * DvCallbacks;
	/*0048*/ void * VerifierContext;
	/*0050*/
};

struct _DRIVER_OBJECT {
	/*0000*/ SHORT Type;
	/*0002*/ SHORT Size;
	/*0008*/ _DEVICE_OBJECT * DeviceObject;
	/*0010*/ ULONG Flags;
	/*0018*/ void * DriverStart;
	/*0020*/ ULONG DriverSize;
	/*0028*/ void * DriverSection;
	/*0030*/ _DRIVER_EXTENSION * DriverExtension;
	/*0038*/ _UNICODE_STRING DriverName;
	/*0048*/ _UNICODE_STRING * HardwareDatabase;
	/*0050*/ _FAST_IO_DISPATCH * FastIoDispatch;
	/*0058*/ LONG (* DriverInit)( _DRIVER_OBJECT * , _UNICODE_STRING * );
	/*0060*/ void (* DriverStartIo)( _DEVICE_OBJECT * , _IRP * );
	/*0068*/ void (* DriverUnload)( _DRIVER_OBJECT * );
	/*0070*/ LONG (* MajorFunction[0x1c])( _DEVICE_OBJECT * , _IRP * );
	/*0150*/
};

struct _DUAL {
	/*0000*/ ULONG Length;
	/*0008*/ _HMAP_DIRECTORY * Map;
	/*0010*/ _HMAP_TABLE * SmallDir;
	/*0018*/ ULONG Guard;
	/*0020*/ _FREE_DISPLAY FreeDisplay[0x18];
	/*0260*/ _LIST_ENTRY FreeBins;
	/*0270*/ ULONG FreeSummary;
	/*0278*/
};

struct _DUMMY_FILE_OBJECT {
	/*0000*/ _OBJECT_HEADER ObjectHeader;
	/*0038*/ CHAR FileObjectBody[0xd8];
	/*0110*/
};

enum _DUMP_EVENTS {
	DUMP_EVENT_NONE = 0x0,
	DUMP_EVENT_HIBER_RESUME = 0x1,
	DUMP_EVENT_HIBER_RESUME_END = 0x2
};

struct _DUMP_INITIALIZATION_CONTEXT {
	/*0000*/ ULONG Length;
	/*0004*/ ULONG Reserved;
	/*0008*/ void * MemoryBlock;
	/*0010*/ void * CommonBuffer[0x2];
	/*0020*/ _LARGE_INTEGER PhysicalAddress[0x2];
	/*0030*/ void (* StallRoutine)( ULONG );
	/*0038*/ UCHAR (* OpenRoutine)( _LARGE_INTEGER );
	/*0040*/ LONG (* WriteRoutine)( _LARGE_INTEGER * , _MDL * );
	/*0048*/ void (* FinishRoutine)();
	/*0050*/ _ADAPTER_OBJECT * AdapterObject;
	/*0058*/ void * MappedRegisterBase;
	/*0060*/ void * PortConfiguration;
	/*0068*/ UCHAR CrashDump;
	/*0069*/ UCHAR MarkMemoryOnly;
	/*006a*/ UCHAR HiberResume;
	/*006b*/ UCHAR Reserved1;
	/*006c*/ ULONG MaximumTransferSize;
	/*0070*/ ULONG CommonBufferSize;
	/*0078*/ void * TargetAddress;
	/*0080*/ LONG (* WritePendingRoutine)( LONG , _LARGE_INTEGER * , _MDL * , void * );
	/*0088*/ ULONG PartitionStyle;
	union {
		struct {
			/*008c*/ ULONG Signature;
			/*0090*/ ULONG CheckSum;
			/*0094*/
		} Mbr;
		struct {
			/*008c*/ _GUID DiskId;
			/*009c*/
		} Gpt;
		/*009c*/
	} DiskInfo;
	/*00a0*/ LONG (* ReadRoutine)( LONG , _LARGE_INTEGER * , _MDL * );
	/*00a8*/ LONG (* GetDriveTelemetryRoutine)( ULONG , ULONG , void * , ULONG );
	/*00b0*/ ULONG LogSectionTruncateSize;
	/*00b4*/ ULONG Parameters[0x10];
	/*00f8*/ void (* GetTransferSizesRoutine)( ULONG * , ULONG * );
	/*0100*/ void (* DumpNotifyRoutine)( _DUMP_EVENTS , void * , ULONG );
	/*0108*/
};

struct _DUMP_STACK_CONTEXT {
	/*0000*/ _DUMP_INITIALIZATION_CONTEXT Init;
	/*0108*/ _LARGE_INTEGER PartitionOffset;
	/*0110*/ void * DumpPointers;
	/*0110*/ void * StorageInfo;
	/*0118*/ UCHAR UseStorageInfo;
	/*011c*/ ULONG PointersLength;
	/*0120*/ WCHAR * ModulePrefix;
	/*0128*/ _LIST_ENTRY DriverList;
	/*0138*/ _STRING InitMsg;
	/*0148*/ _STRING ProgMsg;
	/*0158*/ _STRING DoneMsg;
	/*0168*/ void * FileObject;
	/*0170*/ _DEVICE_USAGE_NOTIFICATION_TYPE UsageType;
	/*0178*/
};

struct _DYNAMIC_FUNCTION_TABLE {
	/*0000*/ _LIST_ENTRY ListEntry;
	/*0010*/ _IMAGE_RUNTIME_FUNCTION_ENTRY * FunctionTable;
	/*0018*/ _LARGE_INTEGER TimeStamp;
	/*0020*/ ULONGLONG MinimumAddress;
	/*0028*/ ULONGLONG MaximumAddress;
	/*0030*/ ULONGLONG BaseAddress;
	/*0038*/ _IMAGE_RUNTIME_FUNCTION_ENTRY * (* Callback)( ULONGLONG , void * );
	/*0040*/ void * Context;
	/*0048*/ WCHAR * OutOfProcessCallbackDll;
	/*0050*/ _FUNCTION_TABLE_TYPE Type;
	/*0054*/ ULONG EntryCount;
	/*0058*/ _RTL_BALANCED_NODE TreeNode;
	/*0070*/
};

struct _ECP_LIST {
	/*0000*/ ULONG Signature;
	/*0004*/ ULONG Flags;
	/*0008*/ _LIST_ENTRY EcpList;
	/*0018*/
};

struct _EFI_FIRMWARE_INFORMATION {
	/*0000*/ ULONG FirmwareVersion;
	/*0008*/ _VIRTUAL_EFI_RUNTIME_SERVICES * VirtualEfiRuntimeServices;
	/*0010*/ LONG SetVirtualAddressMapStatus;
	/*0014*/ ULONG MissedMappingsCount;
	/*0018*/ _LIST_ENTRY FirmwareResourceList;
	/*0028*/ void * EfiMemoryMap;
	/*0030*/ ULONG EfiMemoryMapSize;
	/*0034*/ ULONG EfiMemoryMapDescriptorSize;
	/*0038*/
};

struct _EJOB {
	/*0000*/ _KEVENT Event;
	/*0018*/ _LIST_ENTRY JobLinks;
	/*0028*/ _LIST_ENTRY ProcessListHead;
	/*0038*/ _ERESOURCE JobLock;
	/*00a0*/ _LARGE_INTEGER TotalUserTime;
	/*00a8*/ _LARGE_INTEGER TotalKernelTime;
	/*00b0*/ _LARGE_INTEGER TotalCycleTime;
	/*00b8*/ _LARGE_INTEGER ThisPeriodTotalUserTime;
	/*00c0*/ _LARGE_INTEGER ThisPeriodTotalKernelTime;
	/*00c8*/ ULONGLONG TotalContextSwitches;
	/*00d0*/ ULONG TotalPageFaultCount;
	/*00d4*/ ULONG TotalProcesses;
	/*00d8*/ ULONG ActiveProcesses;
	/*00dc*/ ULONG TotalTerminatedProcesses;
	/*00e0*/ _LARGE_INTEGER PerProcessUserTimeLimit;
	/*00e8*/ _LARGE_INTEGER PerJobUserTimeLimit;
	/*00f0*/ ULONGLONG MinimumWorkingSetSize;
	/*00f8*/ ULONGLONG MaximumWorkingSetSize;
	/*0100*/ ULONG LimitFlags;
	/*0104*/ ULONG ActiveProcessLimit;
	/*0108*/ _KAFFINITY_EX Affinity;
	/*01b0*/ _JOB_ACCESS_STATE * AccessState;
	/*01b8*/ void * AccessStateQuotaReference;
	/*01c0*/ ULONG UIRestrictionsClass;
	/*01c4*/ ULONG EndOfJobTimeAction;
	/*01c8*/ void * CompletionPort;
	/*01d0*/ void * CompletionKey;
	/*01d8*/ ULONGLONG CompletionCount;
	/*01e0*/ ULONG SessionId;
	/*01e4*/ ULONG SchedulingClass;
	/*01e8*/ ULONGLONG ReadOperationCount;
	/*01f0*/ ULONGLONG WriteOperationCount;
	/*01f8*/ ULONGLONG OtherOperationCount;
	/*0200*/ ULONGLONG ReadTransferCount;
	/*0208*/ ULONGLONG WriteTransferCount;
	/*0210*/ ULONGLONG OtherTransferCount;
	/*0218*/ _PROCESS_DISK_COUNTERS DiskIoInfo;
	/*0240*/ ULONGLONG ProcessMemoryLimit;
	/*0248*/ ULONGLONG JobMemoryLimit;
	/*0250*/ ULONGLONG JobTotalMemoryLimit;
	/*0258*/ ULONGLONG PeakProcessMemoryUsed;
	/*0260*/ ULONGLONG PeakJobMemoryUsed;
	/*0268*/ _KAFFINITY_EX EffectiveAffinity;
	/*0310*/ _LARGE_INTEGER EffectivePerProcessUserTimeLimit;
	/*0318*/ ULONGLONG EffectiveMinimumWorkingSetSize;
	/*0320*/ ULONGLONG EffectiveMaximumWorkingSetSize;
	/*0328*/ ULONGLONG EffectiveProcessMemoryLimit;
	/*0330*/ _EJOB * EffectiveProcessMemoryLimitJob;
	/*0338*/ _EJOB * EffectivePerProcessUserTimeLimitJob;
	/*0340*/ _EJOB * EffectiveNetIoRateLimitJob;
	/*0348*/ _EJOB * EffectiveHeapAttributionJob;
	/*0350*/ ULONG EffectiveLimitFlags;
	/*0354*/ ULONG EffectiveSchedulingClass;
	/*0358*/ ULONG EffectiveFreezeCount;
	/*035c*/ ULONG EffectiveBackgroundCount;
	/*0360*/ ULONG EffectiveSwapCount;
	/*0364*/ ULONG EffectiveNotificationLimitCount;
	/*0368*/ UCHAR EffectivePriorityClass;
	/*0369*/ UCHAR PriorityClass;
	/*036a*/ UCHAR NestingDepth;
	/*036b*/ UCHAR Reserved1[0x1];
	/*036c*/ ULONG CompletionFilter;
	/*0370*/ _WNF_STATE_NAME WakeChannel;
	/*0370*/ _PS_JOB_WAKE_INFORMATION WakeInfo;
	/*03b8*/ _JOBOBJECT_WAKE_FILTER WakeFilter;
	/*03c0*/ ULONG LowEdgeLatchFilter;
	/*03c8*/ _EJOB * NotificationLink;
	/*03d0*/ ULONGLONG CurrentJobMemoryUsed;
	/*03d8*/ _JOB_NOTIFICATION_INFORMATION * NotificationInfo;
	/*03e0*/ void * NotificationInfoQuotaReference;
	/*03e8*/ _IO_MINI_COMPLETION_PACKET_USER * NotificationPacket;
	/*03f0*/ _JOB_CPU_RATE_CONTROL * CpuRateControl;
	/*03f8*/ void * EffectiveSchedulingGroup;
	/*0400*/ ULONGLONG ReadyTime;
	/*0408*/ _EX_PUSH_LOCK MemoryLimitsLock;
	/*0410*/ _LIST_ENTRY SiblingJobLinks;
	/*0420*/ _LIST_ENTRY ChildJobListHead;
	/*0430*/ _EJOB * ParentJob;
	/*0438*/ _EJOB * volatile RootJob;
	/*0440*/ _LIST_ENTRY IteratorListHead;
	/*0450*/ ULONGLONG AncestorCount;
	/*0458*/ _EJOB * * Ancestors;
	/*0458*/ void * SessionObject;
	/*0460*/ _EPROCESS_VALUES Accounting;
	/*04b8*/ ULONG ShadowActiveProcessCount;
	/*04bc*/ ULONG ActiveAuxiliaryProcessCount;
	/*04c0*/ ULONG SequenceNumber;
	/*04c4*/ ULONG JobId;
	/*04c8*/ _GUID ContainerId;
	/*04d8*/ _GUID ContainerTelemetryId;
	/*04e8*/ _ESERVERSILO_GLOBALS * ServerSiloGlobals;
	/*04f0*/ _PS_PROPERTY_SET PropertySet;
	/*0508*/ _PSP_STORAGE * Storage;
	/*0510*/ _JOB_NET_RATE_CONTROL * NetRateControl;
	/*0518*/ ULONG JobFlags;
	/*0518*/ ULONG CloseDone : 01; // 0x00000001;
	/*0518*/ ULONG MultiGroup : 01; // 0x00000002;
	/*0518*/ ULONG OutstandingNotification : 01; // 0x00000004;
	/*0518*/ ULONG NotificationInProgress : 01; // 0x00000008;
	/*0518*/ ULONG UILimits : 01; // 0x00000010;
	/*0518*/ ULONG CpuRateControlActive : 01; // 0x00000020;
	/*0518*/ ULONG OwnCpuRateControl : 01; // 0x00000040;
	/*0518*/ ULONG Terminating : 01; // 0x00000080;
	/*0518*/ ULONG WorkingSetLock : 01; // 0x00000100;
	/*0518*/ ULONG JobFrozen : 01; // 0x00000200;
	/*0518*/ ULONG Background : 01; // 0x00000400;
	/*0518*/ ULONG WakeNotificationAllocated : 01; // 0x00000800;
	/*0518*/ ULONG WakeNotificationEnabled : 01; // 0x00001000;
	/*0518*/ ULONG WakeNotificationPending : 01; // 0x00002000;
	/*0518*/ ULONG LimitNotificationRequired : 01; // 0x00004000;
	/*0518*/ ULONG ZeroCountNotificationRequired : 01; // 0x00008000;
	/*0518*/ ULONG CycleTimeNotificationRequired : 01; // 0x00010000;
	/*0518*/ ULONG CycleTimeNotificationPending : 01; // 0x00020000;
	/*0518*/ ULONG TimersVirtualized : 01; // 0x00040000;
	/*0518*/ ULONG JobSwapped : 01; // 0x00080000;
	/*0518*/ ULONG ViolationDetected : 01; // 0x00100000;
	/*0518*/ ULONG EmptyJobNotified : 01; // 0x00200000;
	/*0518*/ ULONG NoSystemCharge : 01; // 0x00400000;
	/*0518*/ ULONG DropNoWakeCharges : 01; // 0x00800000;
	/*0518*/ ULONG NoWakeChargePolicyDecided : 01; // 0x01000000;
	/*0518*/ ULONG NetRateControlActive : 01; // 0x02000000;
	/*0518*/ ULONG OwnNetRateControl : 01; // 0x04000000;
	/*0518*/ ULONG IoRateControlActive : 01; // 0x08000000;
	/*0518*/ ULONG OwnIoRateControl : 01; // 0x10000000;
	/*0518*/ ULONG DisallowNewProcesses : 01; // 0x20000000;
	/*0518*/ ULONG Silo : 01; // 0x40000000;
	/*0518*/ ULONG ContainerTelemetryIdSet : 01; // 0x80000000;
	/*051c*/ ULONG JobFlags2;
	/*051c*/ ULONG ParentLocked : 01; // 0x00000001;
	/*051c*/ ULONG EnableUsermodeSiloThreadImpersonation : 01; // 0x00000002;
	/*051c*/ ULONG DisallowUsermodeSiloThreadImpersonation : 01; // 0x00000004;
	/*0520*/ _PROCESS_EXTENDED_ENERGY_VALUES * EnergyValues;
	/*0528*/ ULONGLONG volatile SharedCommitCharge;
	/*0530*/ ULONG DiskIoAttributionUserRefCount;
	/*0534*/ ULONG DiskIoAttributionRefCount;
	/*0538*/ void * DiskIoAttributionContext;
	/*0538*/ _EJOB * DiskIoAttributionOwnerJob;
	/*0540*/ _JOB_RATE_CONTROL_HEADER IoRateControlHeader;
	/*0568*/ _PS_IO_CONTROL_ENTRY GlobalIoControl;
	/*05a0*/ LONG volatile IoControlStateLock;
	/*05a8*/ _RTL_RB_TREE VolumeIoControlTree;
	/*05b8*/ ULONGLONG IoRateOverQuotaHistory;
	/*05c0*/ ULONG IoRateCurrentGeneration;
	/*05c4*/ ULONG IoRateLastQueryGeneration;
	/*05c8*/ ULONG IoRateGenerationLength;
	/*05cc*/ ULONG IoRateOverQuotaNotifySequenceId;
	/*05d0*/ ULONGLONG LastThrottledIoTime;
	/*05d8*/ _EX_PUSH_LOCK IoControlLock;
	/*05e0*/ ULONGLONG SiloHardReferenceCount;
	/*05e8*/ _WORK_QUEUE_ITEM RundownWorkItem;
	/*0608*/ void * PartitionObject;
	/*0610*/ _EJOB * PartitionOwnerJob;
	/*0618*/ _JOBOBJECT_ENERGY_TRACKING_STATE EnergyTrackingState;
	/*0620*/
};

union _ENERGY_STATE_DURATION {
	/*0000*/ ULONGLONG Value;
	/*0000*/ ULONG LastChangeTime;
	/*0004*/ ULONG Duration : 31; // 0x7fffffff;
	/*0004*/ ULONG IsInState : 01; // 0x80000000;
	/*0008*/
};

struct _ENODE {
	/*0000*/ _KNODE Ncb;
	/*0180*/ _WORK_QUEUE_ITEM HotAddProcessorWorkItem;
	/*01c0*/
};

struct _EPARTITION {
	/*0000*/ void * MmPartition;
	/*0008*/ void * CcPartition;
	/*0010*/ void * ExPartition;
	/*0018*/ LONGLONG HardReferenceCount;
	/*0020*/ LONGLONG OpenHandleCount;
	/*0028*/ _LIST_ENTRY ActivePartitionLinks;
	/*0038*/ _EPARTITION * ParentPartition;
	/*0040*/ _WORK_QUEUE_ITEM TeardownWorkItem;
	/*0060*/ _EX_PUSH_LOCK TeardownLock;
	/*0068*/ _EPROCESS * SystemProcess;
	/*0070*/ void * SystemProcessHandle;
	/*0078*/ ULONG PartitionFlags;
	/*0078*/ ULONG PairedWithJob : 01; // 0x00000001;
	/*0080*/
};

struct _EPROCESS {
	/*0000*/ _KPROCESS Pcb;
	/*02e0*/ _EX_PUSH_LOCK ProcessLock;
	/*02e8*/ void * UniqueProcessId;
	/*02f0*/ _LIST_ENTRY ActiveProcessLinks;
	/*0300*/ _EX_RUNDOWN_REF RundownProtect;
	/*0308*/ ULONG Flags2;
	/*0308*/ ULONG JobNotReallyActive : 01; // 0x00000001;
	/*0308*/ ULONG AccountingFolded : 01; // 0x00000002;
	/*0308*/ ULONG NewProcessReported : 01; // 0x00000004;
	/*0308*/ ULONG ExitProcessReported : 01; // 0x00000008;
	/*0308*/ ULONG ReportCommitChanges : 01; // 0x00000010;
	/*0308*/ ULONG LastReportMemory : 01; // 0x00000020;
	/*0308*/ ULONG ForceWakeCharge : 01; // 0x00000040;
	/*0308*/ ULONG CrossSessionCreate : 01; // 0x00000080;
	/*0308*/ ULONG NeedsHandleRundown : 01; // 0x00000100;
	/*0308*/ ULONG RefTraceEnabled : 01; // 0x00000200;
	/*0308*/ ULONG PicoCreated : 01; // 0x00000400;
	/*0308*/ ULONG EmptyJobEvaluated : 01; // 0x00000800;
	/*0308*/ ULONG DefaultPagePriority : 03; // 0x00007000;
	/*0308*/ ULONG PrimaryTokenFrozen : 01; // 0x00008000;
	/*0308*/ ULONG ProcessVerifierTarget : 01; // 0x00010000;
	/*0308*/ ULONG RestrictSetThreadContext : 01; // 0x00020000;
	/*0308*/ ULONG AffinityPermanent : 01; // 0x00040000;
	/*0308*/ ULONG AffinityUpdateEnable : 01; // 0x00080000;
	/*0308*/ ULONG PropagateNode : 01; // 0x00100000;
	/*0308*/ ULONG ExplicitAffinity : 01; // 0x00200000;
	/*0308*/ ULONG ProcessExecutionState : 02; // 0x00c00000;
	/*0308*/ ULONG EnableReadVmLogging : 01; // 0x01000000;
	/*0308*/ ULONG EnableWriteVmLogging : 01; // 0x02000000;
	/*0308*/ ULONG FatalAccessTerminationRequested : 01; // 0x04000000;
	/*0308*/ ULONG DisableSystemAllowedCpuSet : 01; // 0x08000000;
	/*0308*/ ULONG ProcessStateChangeRequest : 02; // 0x30000000;
	/*0308*/ ULONG ProcessStateChangeInProgress : 01; // 0x40000000;
	/*0308*/ ULONG InPrivate : 01; // 0x80000000;
	/*030c*/ ULONG Flags;
	/*030c*/ ULONG CreateReported : 01; // 0x00000001;
	/*030c*/ ULONG NoDebugInherit : 01; // 0x00000002;
	/*030c*/ ULONG ProcessExiting : 01; // 0x00000004;
	/*030c*/ ULONG ProcessDelete : 01; // 0x00000008;
	/*030c*/ ULONG ManageExecutableMemoryWrites : 01; // 0x00000010;
	/*030c*/ ULONG VmDeleted : 01; // 0x00000020;
	/*030c*/ ULONG OutswapEnabled : 01; // 0x00000040;
	/*030c*/ ULONG Outswapped : 01; // 0x00000080;
	/*030c*/ ULONG FailFastOnCommitFail : 01; // 0x00000100;
	/*030c*/ ULONG Wow64VaSpace4Gb : 01; // 0x00000200;
	/*030c*/ ULONG AddressSpaceInitialized : 02; // 0x00000c00;
	/*030c*/ ULONG SetTimerResolution : 01; // 0x00001000;
	/*030c*/ ULONG BreakOnTermination : 01; // 0x00002000;
	/*030c*/ ULONG DeprioritizeViews : 01; // 0x00004000;
	/*030c*/ ULONG WriteWatch : 01; // 0x00008000;
	/*030c*/ ULONG ProcessInSession : 01; // 0x00010000;
	/*030c*/ ULONG OverrideAddressSpace : 01; // 0x00020000;
	/*030c*/ ULONG HasAddressSpace : 01; // 0x00040000;
	/*030c*/ ULONG LaunchPrefetched : 01; // 0x00080000;
	/*030c*/ ULONG Background : 01; // 0x00100000;
	/*030c*/ ULONG VmTopDown : 01; // 0x00200000;
	/*030c*/ ULONG ImageNotifyDone : 01; // 0x00400000;
	/*030c*/ ULONG PdeUpdateNeeded : 01; // 0x00800000;
	/*030c*/ ULONG VdmAllowed : 01; // 0x01000000;
	/*030c*/ ULONG ProcessRundown : 01; // 0x02000000;
	/*030c*/ ULONG ProcessInserted : 01; // 0x04000000;
	/*030c*/ ULONG DefaultIoPriority : 03; // 0x38000000;
	/*030c*/ ULONG ProcessSelfDelete : 01; // 0x40000000;
	/*030c*/ ULONG SetTimerResolutionLink : 01; // 0x80000000;
	/*0310*/ _LARGE_INTEGER CreateTime;
	/*0318*/ ULONGLONG ProcessQuotaUsage[0x2];
	/*0328*/ ULONGLONG ProcessQuotaPeak[0x2];
	/*0338*/ ULONGLONG PeakVirtualSize;
	/*0340*/ ULONGLONG VirtualSize;
	/*0348*/ _LIST_ENTRY SessionProcessLinks;
	/*0358*/ void * ExceptionPortData;
	/*0358*/ ULONGLONG ExceptionPortValue;
	/*0358*/ ULONGLONG ExceptionPortState : 03; // 0x0000000000000007;
	/*0360*/ _EX_FAST_REF Token;
	/*0368*/ ULONGLONG MmReserved;
	/*0370*/ _EX_PUSH_LOCK AddressCreationLock;
	/*0378*/ _EX_PUSH_LOCK PageTableCommitmentLock;
	/*0380*/ _ETHREAD * RotateInProgress;
	/*0388*/ _ETHREAD * ForkInProgress;
	/*0390*/ _EJOB * volatile CommitChargeJob;
	/*0398*/ _RTL_AVL_TREE CloneRoot;
	/*03a0*/ ULONGLONG volatile NumberOfPrivatePages;
	/*03a8*/ ULONGLONG volatile NumberOfLockedPages;
	/*03b0*/ void * Win32Process;
	/*03b8*/ _EJOB * volatile Job;
	/*03c0*/ void * SectionObject;
	/*03c8*/ void * SectionBaseAddress;
	/*03d0*/ ULONG Cookie;
	/*03d8*/ _PAGEFAULT_HISTORY * WorkingSetWatch;
	/*03e0*/ void * Win32WindowStation;
	/*03e8*/ void * InheritedFromUniqueProcessId;
	/*03f0*/ ULONGLONG volatile OwnerProcessId;
	/*03f8*/ _PEB * Peb;
	/*0400*/ _MM_SESSION_SPACE * Session;
	/*0408*/ void * Spare1;
	/*0410*/ _EPROCESS_QUOTA_BLOCK * QuotaBlock;
	/*0418*/ _HANDLE_TABLE * ObjectTable;
	/*0420*/ void * DebugPort;
	/*0428*/ _EWOW64PROCESS * WoW64Process;
	/*0430*/ void * DeviceMap;
	/*0438*/ void * EtwDataSource;
	/*0440*/ ULONGLONG PageDirectoryPte;
	/*0448*/ _FILE_OBJECT * ImageFilePointer;
	/*0450*/ UCHAR ImageFileName[0xf];
	/*045f*/ UCHAR PriorityClass;
	/*0460*/ void * SecurityPort;
	/*0468*/ _SE_AUDIT_PROCESS_CREATION_INFO SeAuditProcessCreationInfo;
	/*0470*/ _LIST_ENTRY JobLinks;
	/*0480*/ void * HighestUserAddress;
	/*0488*/ _LIST_ENTRY ThreadListHead;
	/*0498*/ ULONG volatile ActiveThreads;
	/*049c*/ ULONG ImagePathHash;
	/*04a0*/ ULONG DefaultHardErrorProcessing;
	/*04a4*/ LONG LastThreadExitStatus;
	/*04a8*/ _EX_FAST_REF PrefetchTrace;
	/*04b0*/ void * LockedPagesList;
	/*04b8*/ _LARGE_INTEGER ReadOperationCount;
	/*04c0*/ _LARGE_INTEGER WriteOperationCount;
	/*04c8*/ _LARGE_INTEGER OtherOperationCount;
	/*04d0*/ _LARGE_INTEGER ReadTransferCount;
	/*04d8*/ _LARGE_INTEGER WriteTransferCount;
	/*04e0*/ _LARGE_INTEGER OtherTransferCount;
	/*04e8*/ ULONGLONG CommitChargeLimit;
	/*04f0*/ ULONGLONG volatile CommitCharge;
	/*04f8*/ ULONGLONG volatile CommitChargePeak;
	/*0500*/ _MMSUPPORT_FULL Vm;
	/*0640*/ _LIST_ENTRY MmProcessLinks;
	/*0650*/ ULONG ModifiedPageCount;
	/*0654*/ LONG ExitStatus;
	/*0658*/ _RTL_AVL_TREE VadRoot;
	/*0660*/ void * VadHint;
	/*0668*/ ULONGLONG VadCount;
	/*0670*/ ULONGLONG volatile VadPhysicalPages;
	/*0678*/ ULONGLONG VadPhysicalPagesLimit;
	/*0680*/ _ALPC_PROCESS_CONTEXT AlpcContext;
	/*06a0*/ _LIST_ENTRY TimerResolutionLink;
	/*06b0*/ _PO_DIAG_STACK_RECORD * TimerResolutionStackRecord;
	/*06b8*/ ULONG RequestedTimerResolution;
	/*06bc*/ ULONG SmallestTimerResolution;
	/*06c0*/ _LARGE_INTEGER ExitTime;
	/*06c8*/ _INVERTED_FUNCTION_TABLE * InvertedFunctionTable;
	/*06d0*/ _EX_PUSH_LOCK InvertedFunctionTableLock;
	/*06d8*/ ULONG ActiveThreadsHighWatermark;
	/*06dc*/ ULONG LargePrivateVadCount;
	/*06e0*/ _EX_PUSH_LOCK ThreadListLock;
	/*06e8*/ void * WnfContext;
	/*06f0*/ _EJOB * ServerSilo;
	/*06f8*/ UCHAR SignatureLevel;
	/*06f9*/ UCHAR SectionSignatureLevel;
	/*06fa*/ _PS_PROTECTION Protection;
	/*06fb*/ UCHAR HangCount : 03; // 0x07;
	/*06fb*/ UCHAR GhostCount : 03; // 0x38;
	/*06fb*/ UCHAR PrefilterException : 01; // 0x40;
	/*06fc*/ ULONG Flags3;
	/*06fc*/ ULONG Minimal : 01; // 0x00000001;
	/*06fc*/ ULONG ReplacingPageRoot : 01; // 0x00000002;
	/*06fc*/ ULONG Crashed : 01; // 0x00000004;
	/*06fc*/ ULONG JobVadsAreTracked : 01; // 0x00000008;
	/*06fc*/ ULONG VadTrackingDisabled : 01; // 0x00000010;
	/*06fc*/ ULONG AuxiliaryProcess : 01; // 0x00000020;
	/*06fc*/ ULONG SubsystemProcess : 01; // 0x00000040;
	/*06fc*/ ULONG IndirectCpuSets : 01; // 0x00000080;
	/*06fc*/ ULONG RelinquishedCommit : 01; // 0x00000100;
	/*06fc*/ ULONG HighGraphicsPriority : 01; // 0x00000200;
	/*06fc*/ ULONG CommitFailLogged : 01; // 0x00000400;
	/*06fc*/ ULONG ReserveFailLogged : 01; // 0x00000800;
	/*06fc*/ ULONG SystemProcess : 01; // 0x00001000;
	/*06fc*/ ULONG HideImageBaseAddresses : 01; // 0x00002000;
	/*06fc*/ ULONG AddressPolicyFrozen : 01; // 0x00004000;
	/*06fc*/ ULONG ProcessFirstResume : 01; // 0x00008000;
	/*06fc*/ ULONG ForegroundExternal : 01; // 0x00010000;
	/*06fc*/ ULONG ForegroundSystem : 01; // 0x00020000;
	/*06fc*/ ULONG HighMemoryPriority : 01; // 0x00040000;
	/*06fc*/ ULONG EnableProcessSuspendResumeLogging : 01; // 0x00080000;
	/*06fc*/ ULONG EnableThreadSuspendResumeLogging : 01; // 0x00100000;
	/*06fc*/ ULONG SecurityDomainChanged : 01; // 0x00200000;
	/*06fc*/ ULONG SecurityFreezeComplete : 01; // 0x00400000;
	/*06fc*/ ULONG VmProcessorHost : 01; // 0x00800000;
	/*0700*/ LONG DeviceAsid;
	/*0708*/ void * SvmData;
	/*0710*/ _EX_PUSH_LOCK SvmProcessLock;
	/*0718*/ ULONGLONG SvmLock;
	/*0720*/ _LIST_ENTRY SvmProcessDeviceListHead;
	/*0730*/ ULONGLONG LastFreezeInterruptTime;
	/*0738*/ _PROCESS_DISK_COUNTERS * DiskCounters;
	/*0740*/ void * PicoContext;
	/*0748*/ void * EnclaveTable;
	/*0750*/ ULONGLONG EnclaveNumber;
	/*0758*/ _EX_PUSH_LOCK EnclaveLock;
	/*0760*/ ULONG HighPriorityFaultsAllowed;
	/*0768*/ _PO_PROCESS_ENERGY_CONTEXT * EnergyContext;
	/*0770*/ void * VmContext;
	/*0778*/ ULONGLONG SequenceNumber;
	/*0780*/ ULONGLONG CreateInterruptTime;
	/*0788*/ ULONGLONG CreateUnbiasedInterruptTime;
	/*0790*/ ULONGLONG TotalUnbiasedFrozenTime;
	/*0798*/ ULONGLONG LastAppStateUpdateTime;
	/*07a0*/ ULONGLONG LastAppStateUptime : 61; // 0x1fffffffffffffff;
	/*07a0*/ ULONGLONG LastAppState : 03; // 0xe000000000000000;
	/*07a8*/ ULONGLONG volatile SharedCommitCharge;
	/*07b0*/ _EX_PUSH_LOCK SharedCommitLock;
	/*07b8*/ _LIST_ENTRY SharedCommitLinks;
	/*07c8*/ ULONGLONG AllowedCpuSets;
	/*07d0*/ ULONGLONG DefaultCpuSets;
	/*07c8*/ ULONGLONG * AllowedCpuSetsIndirect;
	/*07d0*/ ULONGLONG * DefaultCpuSetsIndirect;
	/*07d8*/ void * DiskIoAttribution;
	/*07e0*/ void * DxgProcess;
	/*07e8*/ ULONG Win32KFilterSet;
	/*07f0*/ _PS_INTERLOCKED_TIMER_DELAY_VALUES volatile ProcessTimerDelay;
	/*07f8*/ ULONG volatile KTimerSets;
	/*07fc*/ ULONG volatile KTimer2Sets;
	/*0800*/ ULONG volatile ThreadTimerSets;
	/*0808*/ ULONGLONG VirtualTimerListLock;
	/*0810*/ _LIST_ENTRY VirtualTimerListHead;
	/*0820*/ _WNF_STATE_NAME WakeChannel;
	/*0820*/ _PS_PROCESS_WAKE_INFORMATION WakeInfo;
	/*0850*/ ULONG MitigationFlags;
	struct {
		/*0850*/ ULONG ControlFlowGuardEnabled : 01; // 0x00000001;
		/*0850*/ ULONG ControlFlowGuardExportSuppressionEnabled : 01; // 0x00000002;
		/*0850*/ ULONG ControlFlowGuardStrict : 01; // 0x00000004;
		/*0850*/ ULONG DisallowStrippedImages : 01; // 0x00000008;
		/*0850*/ ULONG ForceRelocateImages : 01; // 0x00000010;
		/*0850*/ ULONG HighEntropyASLREnabled : 01; // 0x00000020;
		/*0850*/ ULONG StackRandomizationDisabled : 01; // 0x00000040;
		/*0850*/ ULONG ExtensionPointDisable : 01; // 0x00000080;
		/*0850*/ ULONG DisableDynamicCode : 01; // 0x00000100;
		/*0850*/ ULONG DisableDynamicCodeAllowOptOut : 01; // 0x00000200;
		/*0850*/ ULONG DisableDynamicCodeAllowRemoteDowngrade : 01; // 0x00000400;
		/*0850*/ ULONG AuditDisableDynamicCode : 01; // 0x00000800;
		/*0850*/ ULONG DisallowWin32kSystemCalls : 01; // 0x00001000;
		/*0850*/ ULONG AuditDisallowWin32kSystemCalls : 01; // 0x00002000;
		/*0850*/ ULONG EnableFilteredWin32kAPIs : 01; // 0x00004000;
		/*0850*/ ULONG AuditFilteredWin32kAPIs : 01; // 0x00008000;
		/*0850*/ ULONG DisableNonSystemFonts : 01; // 0x00010000;
		/*0850*/ ULONG AuditNonSystemFontLoading : 01; // 0x00020000;
		/*0850*/ ULONG PreferSystem32Images : 01; // 0x00040000;
		/*0850*/ ULONG ProhibitRemoteImageMap : 01; // 0x00080000;
		/*0850*/ ULONG AuditProhibitRemoteImageMap : 01; // 0x00100000;
		/*0850*/ ULONG ProhibitLowILImageMap : 01; // 0x00200000;
		/*0850*/ ULONG AuditProhibitLowILImageMap : 01; // 0x00400000;
		/*0850*/ ULONG SignatureMitigationOptIn : 01; // 0x00800000;
		/*0850*/ ULONG AuditBlockNonMicrosoftBinaries : 01; // 0x01000000;
		/*0850*/ ULONG AuditBlockNonMicrosoftBinariesAllowStore : 01; // 0x02000000;
		/*0850*/ ULONG LoaderIntegrityContinuityEnabled : 01; // 0x04000000;
		/*0850*/ ULONG AuditLoaderIntegrityContinuity : 01; // 0x08000000;
		/*0850*/ ULONG EnableModuleTamperingProtection : 01; // 0x10000000;
		/*0850*/ ULONG EnableModuleTamperingProtectionNoInherit : 01; // 0x20000000;
		/*0850*/ ULONG RestrictIndirectBranchPrediction : 01; // 0x40000000;
		/*0850*/ ULONG IsolateSecurityDomain : 01; // 0x80000000;
		/*0854*/
	} MitigationFlagsValues;
	/*0854*/ ULONG MitigationFlags2;
	struct {
		/*0854*/ ULONG EnableExportAddressFilter : 01; // 0x00000001;
		/*0854*/ ULONG AuditExportAddressFilter : 01; // 0x00000002;
		/*0854*/ ULONG EnableExportAddressFilterPlus : 01; // 0x00000004;
		/*0854*/ ULONG AuditExportAddressFilterPlus : 01; // 0x00000008;
		/*0854*/ ULONG EnableRopStackPivot : 01; // 0x00000010;
		/*0854*/ ULONG AuditRopStackPivot : 01; // 0x00000020;
		/*0854*/ ULONG EnableRopCallerCheck : 01; // 0x00000040;
		/*0854*/ ULONG AuditRopCallerCheck : 01; // 0x00000080;
		/*0854*/ ULONG EnableRopSimExec : 01; // 0x00000100;
		/*0854*/ ULONG AuditRopSimExec : 01; // 0x00000200;
		/*0854*/ ULONG EnableImportAddressFilter : 01; // 0x00000400;
		/*0854*/ ULONG AuditImportAddressFilter : 01; // 0x00000800;
		/*0854*/ ULONG DisablePageCombine : 01; // 0x00001000;
		/*0854*/ ULONG SpeculativeStoreBypassDisable : 01; // 0x00002000;
		/*0854*/ ULONG CetUserShadowStacks : 01; // 0x00004000;
		/*0858*/
	} MitigationFlags2Values;
	/*0858*/ void * PartitionObject;
	/*0860*/ ULONGLONG SecurityDomain;
	/*0868*/ ULONGLONG ParentSecurityDomain;
	/*0870*/ void * CoverageSamplerContext;
	/*0878*/ void * MmHotPatchContext;
	/*0880*/
};

struct _EPROCESS_QUOTA_BLOCK;

struct _EPROCESS_VALUES {
	/*0000*/ ULONGLONG KernelTime;
	/*0008*/ ULONGLONG UserTime;
	/*0010*/ ULONGLONG ReadyTime;
	/*0018*/ ULONGLONG CycleTime;
	/*0020*/ ULONGLONG ContextSwitches;
	/*0028*/ LONGLONG ReadOperationCount;
	/*0030*/ LONGLONG WriteOperationCount;
	/*0038*/ LONGLONG OtherOperationCount;
	/*0040*/ LONGLONG ReadTransferCount;
	/*0048*/ LONGLONG WriteTransferCount;
	/*0050*/ LONGLONG OtherTransferCount;
	/*0058*/
};

struct _ERESOURCE {
	/*0000*/ _LIST_ENTRY SystemResourcesList;
	/*0010*/ _OWNER_ENTRY * OwnerTable;
	/*0018*/ SHORT ActiveCount;
	/*001a*/ USHORT Flag;
	/*001a*/ UCHAR ReservedLowFlags;
	/*001b*/ UCHAR WaiterPriority;
	/*0020*/ void * SharedWaiters;
	/*0028*/ void * ExclusiveWaiters;
	/*0030*/ _OWNER_ENTRY OwnerEntry;
	/*0040*/ ULONG ActiveEntries;
	/*0044*/ ULONG ContentionCount;
	/*0048*/ ULONG NumberOfSharedWaiters;
	/*004c*/ ULONG NumberOfExclusiveWaiters;
	/*0050*/ void * Reserved2;
	/*0058*/ void * Address;
	/*0058*/ ULONGLONG CreatorBackTraceIndex;
	/*0060*/ ULONGLONG SpinLock;
	/*0068*/
};

struct _ESERVERSILO_GLOBALS {
	/*0000*/ _OBP_SILODRIVERSTATE ObSiloState;
	/*02e0*/ _SEP_SILOSTATE SeSiloState;
	/*0310*/ _SEP_RM_LSA_CONNECTION_STATE SeRmSiloState;
	/*0360*/ _ETW_SILODRIVERSTATE * EtwSiloState;
	/*0368*/ _EPROCESS * MiSessionLeaderProcess;
	/*0370*/ _EPROCESS * ExpDefaultErrorPortProcess;
	/*0378*/ void * ExpDefaultErrorPort;
	/*0380*/ ULONG HardErrorState;
	/*0388*/ _WNF_SILODRIVERSTATE WnfSiloState;
	/*03c0*/ _DBGK_SILOSTATE DbgkSiloState;
	/*03e0*/ _UNICODE_STRING PsProtectedCurrentDirectory;
	/*03f0*/ _UNICODE_STRING PsProtectedEnvironment;
	/*0400*/ void * ApiSetSection;
	/*0408*/ void * ApiSetSchema;
	/*0410*/ UCHAR OneCoreForwardersEnabled;
	/*0418*/ _UNICODE_STRING NtSystemRoot;
	/*0428*/ _UNICODE_STRING SiloRootDirectoryName;
	/*0438*/ _PSP_STORAGE * Storage;
	/*0440*/ _SERVERSILO_STATE State;
	/*0444*/ LONG ExitStatus;
	/*0448*/ _KEVENT * DeleteEvent;
	/*0450*/ _SILO_USER_SHARED_DATA * UserSharedData;
	/*0458*/ void * UserSharedSection;
	/*0460*/ _WORK_QUEUE_ITEM TerminateWorkItem;
	/*0480*/
};

struct _ETHREAD {
	/*0000*/ _KTHREAD Tcb;
	/*0600*/ _LARGE_INTEGER CreateTime;
	/*0608*/ _LARGE_INTEGER ExitTime;
	/*0608*/ _LIST_ENTRY KeyedWaitChain;
	/*0618*/ _LIST_ENTRY PostBlockList;
	/*0618*/ void * ForwardLinkShadow;
	/*0620*/ void * StartAddress;
	/*0628*/ _TERMINATION_PORT * TerminationPort;
	/*0628*/ _ETHREAD * ReaperLink;
	/*0628*/ void * KeyedWaitValue;
	/*0630*/ ULONGLONG ActiveTimerListLock;
	/*0638*/ _LIST_ENTRY ActiveTimerListHead;
	/*0648*/ _CLIENT_ID Cid;
	/*0658*/ _KSEMAPHORE KeyedWaitSemaphore;
	/*0658*/ _KSEMAPHORE AlpcWaitSemaphore;
	/*0678*/ _PS_CLIENT_SECURITY_CONTEXT ClientSecurity;
	/*0680*/ _LIST_ENTRY IrpList;
	/*0690*/ ULONGLONG TopLevelIrp;
	/*0698*/ _DEVICE_OBJECT * DeviceToVerify;
	/*06a0*/ void * Win32StartAddress;
	/*06a8*/ void * ChargeOnlySession;
	/*06b0*/ void * LegacyPowerObject;
	/*06b8*/ _LIST_ENTRY ThreadListEntry;
	/*06c8*/ _EX_RUNDOWN_REF RundownProtect;
	/*06d0*/ _EX_PUSH_LOCK ThreadLock;
	/*06d8*/ ULONG ReadClusterSize;
	/*06dc*/ LONG volatile MmLockOrdering;
	/*06e0*/ ULONG CrossThreadFlags;
	/*06e0*/ ULONG Terminated : 01; // 0x00000001;
	/*06e0*/ ULONG ThreadInserted : 01; // 0x00000002;
	/*06e0*/ ULONG HideFromDebugger : 01; // 0x00000004;
	/*06e0*/ ULONG ActiveImpersonationInfo : 01; // 0x00000008;
	/*06e0*/ ULONG HardErrorsAreDisabled : 01; // 0x00000010;
	/*06e0*/ ULONG BreakOnTermination : 01; // 0x00000020;
	/*06e0*/ ULONG SkipCreationMsg : 01; // 0x00000040;
	/*06e0*/ ULONG SkipTerminationMsg : 01; // 0x00000080;
	/*06e0*/ ULONG CopyTokenOnOpen : 01; // 0x00000100;
	/*06e0*/ ULONG ThreadIoPriority : 03; // 0x00000e00;
	/*06e0*/ ULONG ThreadPagePriority : 03; // 0x00007000;
	/*06e0*/ ULONG RundownFail : 01; // 0x00008000;
	/*06e0*/ ULONG UmsForceQueueTermination : 01; // 0x00010000;
	/*06e0*/ ULONG IndirectCpuSets : 01; // 0x00020000;
	/*06e0*/ ULONG DisableDynamicCodeOptOut : 01; // 0x00040000;
	/*06e0*/ ULONG ExplicitCaseSensitivity : 01; // 0x00080000;
	/*06e0*/ ULONG PicoNotifyExit : 01; // 0x00100000;
	/*06e0*/ ULONG DbgWerUserReportActive : 01; // 0x00200000;
	/*06e0*/ ULONG ForcedSelfTrimActive : 01; // 0x00400000;
	/*06e0*/ ULONG SamplingCoverage : 01; // 0x00800000;
	/*06e0*/ ULONG ReservedCrossThreadFlags : 08; // 0xff000000;
	/*06e4*/ ULONG SameThreadPassiveFlags;
	/*06e4*/ ULONG ActiveExWorker : 01; // 0x00000001;
	/*06e4*/ ULONG MemoryMaker : 01; // 0x00000002;
	/*06e4*/ ULONG StoreLockThread : 02; // 0x0000000c;
	/*06e4*/ ULONG ClonedThread : 01; // 0x00000010;
	/*06e4*/ ULONG KeyedEventInUse : 01; // 0x00000020;
	/*06e4*/ ULONG SelfTerminate : 01; // 0x00000040;
	/*06e4*/ ULONG RespectIoPriority : 01; // 0x00000080;
	/*06e4*/ ULONG ActivePageLists : 01; // 0x00000100;
	/*06e4*/ ULONG SecureContext : 01; // 0x00000200;
	/*06e4*/ ULONG ZeroPageThread : 01; // 0x00000400;
	/*06e4*/ ULONG WorkloadClass : 01; // 0x00000800;
	/*06e4*/ ULONG ReservedSameThreadPassiveFlags : 20; // 0xfffff000;
	/*06e8*/ ULONG SameThreadApcFlags;
	/*06e8*/ UCHAR OwnsProcessAddressSpaceExclusive : 01; // 0x01;
	/*06e8*/ UCHAR OwnsProcessAddressSpaceShared : 01; // 0x02;
	/*06e8*/ UCHAR HardFaultBehavior : 01; // 0x04;
	/*06e8*/ UCHAR volatile StartAddressInvalid : 01; // 0x08;
	/*06e8*/ UCHAR EtwCalloutActive : 01; // 0x10;
	/*06e8*/ UCHAR SuppressSymbolLoad : 01; // 0x20;
	/*06e8*/ UCHAR Prefetching : 01; // 0x40;
	/*06e8*/ UCHAR OwnsVadExclusive : 01; // 0x80;
	/*06e9*/ UCHAR SystemPagePriorityActive : 01; // 0x01;
	/*06e9*/ UCHAR SystemPagePriority : 03; // 0x0e;
	/*06e9*/ UCHAR AllowUserWritesToExecutableMemory : 01; // 0x10;
	/*06e9*/ UCHAR AllowKernelWritesToExecutableMemory : 01; // 0x20;
	/*06e9*/ UCHAR OwnsVadShared : 01; // 0x40;
	/*06ec*/ UCHAR CacheManagerActive;
	/*06ed*/ UCHAR DisablePageFaultClustering;
	/*06ee*/ UCHAR ActiveFaultCount;
	/*06ef*/ UCHAR LockOrderState;
	/*06f0*/ ULONGLONG AlpcMessageId;
	/*06f8*/ void * AlpcMessage;
	/*06f8*/ ULONG AlpcReceiveAttributeSet;
	/*0700*/ _LIST_ENTRY AlpcWaitListEntry;
	/*0710*/ LONG ExitStatus;
	/*0714*/ ULONG CacheManagerCount;
	/*0718*/ ULONG IoBoostCount;
	/*071c*/ ULONG IoQoSBoostCount;
	/*0720*/ ULONG IoQoSThrottleCount;
	/*0724*/ ULONG KernelStackReference;
	/*0728*/ _LIST_ENTRY BoostList;
	/*0738*/ _LIST_ENTRY DeboostList;
	/*0748*/ ULONGLONG BoostListLock;
	/*0750*/ ULONGLONG IrpListLock;
	/*0758*/ void * ReservedForSynchTracking;
	/*0760*/ _SINGLE_LIST_ENTRY CmCallbackListHead;
	/*0768*/ _GUID const * ActivityId;
	/*0770*/ _SINGLE_LIST_ENTRY SeLearningModeListHead;
	/*0778*/ void * VerifierContext;
	/*0780*/ void * AdjustedClientToken;
	/*0788*/ void * WorkOnBehalfThread;
	/*0790*/ _PS_PROPERTY_SET PropertySet;
	/*07a8*/ void * PicoContext;
	/*07b0*/ ULONGLONG UserFsBase;
	/*07b8*/ ULONGLONG UserGsBase;
	/*07c0*/ _THREAD_ENERGY_VALUES * EnergyValues;
	/*07c8*/ void * CmDbgInfo;
	/*07d0*/ ULONGLONG SelectedCpuSets;
	/*07d0*/ ULONGLONG * SelectedCpuSetsIndirect;
	/*07d8*/ _EJOB * Silo;
	/*07e0*/ _UNICODE_STRING * ThreadName;
	/*07e8*/ _CONTEXT * SetContextState;
	/*07f0*/ ULONG LastExpectedRunTime;
	/*07f4*/ ULONG HeapData;
	/*07f8*/ _LIST_ENTRY OwnerEntryListHead;
	/*0808*/ ULONGLONG DisownedOwnerEntryListLock;
	/*0810*/ _LIST_ENTRY DisownedOwnerEntryListHead;
	/*0820*/
};

struct _ETIMER {
	/*0000*/ _KTIMER KeTimer;
	/*0040*/ ULONGLONG Lock;
	/*0048*/ _KAPC TimerApc;
	/*00a0*/ _KDPC TimerDpc;
	/*00e0*/ _LIST_ENTRY ActiveTimerListEntry;
	/*00f0*/ ULONG Period;
	/*00f4*/ CHAR TimerFlags;
	/*00f4*/ UCHAR ApcAssociated : 01; // 0x01;
	/*00f4*/ UCHAR FlushDpcs : 01; // 0x02;
	/*00f4*/ UCHAR Paused : 01; // 0x04;
	/*00f4*/ UCHAR Spare1 : 05; // 0xf8;
	/*00f5*/ UCHAR DueTimeType;
	/*00f6*/ USHORT Spare2;
	/*00f8*/ _DIAGNOSTIC_CONTEXT * volatile WakeReason;
	/*0100*/ _LIST_ENTRY WakeTimerListEntry;
	/*0110*/ void * VirtualizedTimerCookie;
	/*0118*/ _LIST_ENTRY VirtualizedTimerLinks;
	/*0128*/ ULONGLONG DueTime;
	/*0130*/ ULONG CoalescingWindow;
	/*0138*/
};

struct _ETWP_NOTIFICATION_HEADER {
	/*0000*/ _ETW_NOTIFICATION_TYPE NotificationType;
	/*0004*/ ULONG NotificationSize;
	/*0008*/ LONG RefCount;
	/*000c*/ UCHAR ReplyRequested;
	/*0010*/ ULONG ReplyIndex;
	/*0010*/ ULONG Timeout;
	/*0014*/ ULONG ReplyCount;
	/*0014*/ ULONG NotifyeeCount;
	/*0018*/ ULONGLONG ReplyHandle;
	/*0018*/ void * ReplyObject;
	/*0018*/ ULONG RegIndex;
	/*0020*/ ULONG TargetPID;
	/*0024*/ ULONG SourcePID;
	/*0028*/ _GUID DestinationGuid;
	/*0038*/ _GUID SourceGuid;
	/*0048*/
};

struct _ETW_APC_ENTRY {
	/*0000*/ _SLIST_ENTRY SListEntry;
	/*0000*/ _KAPC Apc;
	/*0060*/
};

struct _ETW_BUFFER_CONTEXT {
	/*0000*/ UCHAR ProcessorNumber;
	/*0001*/ UCHAR Alignment;
	/*0000*/ USHORT ProcessorIndex;
	/*0002*/ USHORT LoggerId;
	/*0004*/
};

struct _ETW_BUFFER_QUEUE {
	/*0000*/ _SINGLE_LIST_ENTRY * QueueTail;
	/*0008*/ _SINGLE_LIST_ENTRY QueueEntry;
	/*0010*/
};

enum _ETW_BUFFER_STATE {
	EtwBufferStateFree = 0x0,
	EtwBufferStateGeneralLogging = 0x1,
	EtwBufferStateCSwitch = 0x2,
	EtwBufferStateFlush = 0x3,
	EtwBufferStatePendingCompression = 0x4,
	EtwBufferStateCompressed = 0x5,
	EtwBufferStatePlaceholder = 0x6,
	EtwBufferStateMaximum = 0x7
};

struct _ETW_COUNTERS {
	/*0000*/ LONG GuidCount;
	/*0004*/ LONG PoolUsage[0x2];
	/*000c*/ LONG SessionCount;
	/*0010*/
};

struct _ETW_DEBUGID_TRACKING_ENTRY {
	/*0000*/ _LIST_ENTRY ListEntry;
	/*0010*/ UCHAR ConsumersNotified;
	/*0011*/ UCHAR Spare[0x3];
	/*0014*/ ULONG DebugIdSize;
	/*0018*/ _CVDD DebugId;
	/*0038*/
};

struct _ETW_DECODE_CONTROL_ENTRY {
	/*0000*/ _ETW_DECODE_CONTROL_ENTRY * Next;
	/*0008*/ _GUID Decode;
	/*0018*/ _GUID Control;
	/*0028*/ UCHAR ConsumersNotified;
	/*0030*/
};

struct _ETW_EVENT_CALLBACK_CONTEXT;

struct _ETW_FILTER_EVENT_NAME_DATA {
	/*0000*/ UCHAR FilterIn;
	/*0001*/ UCHAR Level;
	/*0008*/ ULONGLONG MatchAnyKeyword;
	/*0010*/ ULONGLONG MatchAllKeyword;
	/*0018*/ _RTL_HASH_TABLE NameTable;
	/*0028*/
};

struct _ETW_FILTER_HEADER {
	/*0000*/ LONG FilterFlags;
	/*0008*/ _ETW_FILTER_PID * PidFilter;
	/*0010*/ _ETW_FILTER_STRING_TOKEN * ExeFilter;
	/*0018*/ _ETW_FILTER_STRING_TOKEN * PkgIdFilter;
	/*0020*/ _ETW_FILTER_STRING_TOKEN * PkgAppIdFilter;
	/*0028*/ _ETW_PERFECT_HASH_FUNCTION * StackWalkIdFilter;
	/*0030*/ _ETW_FILTER_EVENT_NAME_DATA * StackWalkNameFilter;
	/*0038*/ _EVENT_FILTER_LEVEL_KW * StackWalkLevelKwFilter;
	/*0040*/ _ETW_PERFECT_HASH_FUNCTION * EventIdFilter;
	/*0048*/ _ETW_PAYLOAD_FILTER * PayloadFilter;
	/*0050*/ _EVENT_FILTER_HEADER * ProviderSideFilter;
	/*0058*/ _ETW_FILTER_EVENT_NAME_DATA * EventNameFilter;
	/*0060*/
};

struct _ETW_FILTER_PID {
	/*0000*/ ULONG Count;
	/*0004*/ ULONG Pids[0x8];
	/*0024*/
};

struct _ETW_FILTER_STRING_TOKEN {
	/*0000*/ USHORT Count;
	/*0008*/ _ETW_FILTER_STRING_TOKEN_ELEMENT Tokens[0x1];
	/*0018*/
};

struct _ETW_FILTER_STRING_TOKEN_ELEMENT {
	/*0000*/ USHORT Length;
	/*0008*/ WCHAR * String;
	/*0010*/
};

struct _ETW_GUID_ENTRY {
	/*0000*/ _LIST_ENTRY GuidList;
	/*0010*/ LONGLONG volatile RefCount;
	/*0018*/ _GUID Guid;
	/*0028*/ _LIST_ENTRY RegListHead;
	/*0038*/ void * SecurityDescriptor;
	/*0040*/ _ETW_LAST_ENABLE_INFO LastEnable;
	/*0040*/ ULONGLONG MatchId;
	/*0050*/ _TRACE_ENABLE_INFO ProviderEnableInfo;
	/*0070*/ _TRACE_ENABLE_INFO EnableInfo[0x8];
	/*0170*/ _ETW_FILTER_HEADER * FilterData;
	/*0178*/ _ETW_SILODRIVERSTATE * SiloState;
	/*0180*/ _EX_PUSH_LOCK Lock;
	/*0188*/ _ETHREAD * LockOwner;
	/*0190*/
};

enum _ETW_GUID_TYPE {
	EtwTraceGuidType = 0x0,
	EtwNotificationGuidType = 0x1,
	EtwGroupGuidType = 0x2,
	EtwGuidTypeMax = 0x3
};

struct _ETW_HASH_BUCKET {
	/*0000*/ _LIST_ENTRY ListHead[0x3];
	/*0030*/ _EX_PUSH_LOCK BucketLock;
	/*0038*/
};

enum _ETW_HEADER_TYPE {
	EtwHeaderTypeNative = 0x0,
	EtwHeaderTypeWow = 0x1,
	EtwHeaderTypeMax = 0x2
};

struct _ETW_HW_TRACE_EXT_INTERFACE {
	/*0000*/ LONG (* StartProcessorTraceOnEachCore)( ULONGLONG , void * * );
	/*0008*/ LONG (* StopProcessorTraceOnEachCore)( void * );
	/*0010*/ LONG (* LogProcessorTraceOnCurrentCore)( void * , void * );
	/*0018*/
};

struct _ETW_IPT_SUPPORT {
	/*0000*/ void * IptHandle;
	/*0008*/ ULONGLONG IptOption;
	/*0010*/ _ETW_HW_TRACE_EXT_INTERFACE * EtwHwTraceExtInterface;
	/*0018*/ ULONG volatile HookIdCount;
	/*001c*/ USHORT HookId[0x4];
	/*0028*/
};

struct _ETW_LAST_ENABLE_INFO {
	/*0000*/ _LARGE_INTEGER EnableFlags;
	/*0008*/ USHORT LoggerId;
	/*000a*/ UCHAR Level;
	/*000b*/ UCHAR Enabled : 01; // 0x01;
	/*000b*/ UCHAR InternalFlag : 07; // 0xfe;
	/*0010*/
};

struct _ETW_LBR_SUPPORT {
	/*0000*/ ULONG LbrHandle;
	/*0004*/ ULONG LbrOptions;
	/*0008*/ ULONG volatile HookIdCount;
	/*000c*/ USHORT HookId[0x4];
	/*0014*/
};

struct _ETW_LOGGER_HANDLE {
	/*0000*/ UCHAR DereferenceAndLeave;
	/*0001*/
};

enum _ETW_NOTIFICATION_TYPE {
	EtwNotificationTypeNoReply = 0x1,
	EtwNotificationTypeLegacyEnable = 0x2,
	EtwNotificationTypeEnable = 0x3,
	EtwNotificationTypePrivateLogger = 0x4,
	EtwNotificationTypePerflib = 0x5,
	EtwNotificationTypeAudio = 0x6,
	EtwNotificationTypeSession = 0x7,
	EtwNotificationTypeReserved = 0x8,
	EtwNotificationTypeCredentialUI = 0x9,
	EtwNotificationTypeInProcSession = 0xa,
	EtwNotificationTypeFilteredPrivateLogger = 0xb,
	EtwNotificationTypeMax = 0xc
};

struct _ETW_PAYLOAD_FILTER {
	/*0000*/ LONG RefCount;
	/*0008*/ _AGGREGATED_PAYLOAD_FILTER PayloadFilter;
	/*0058*/
};

struct _ETW_PERFECT_HASH_FUNCTION;

enum _ETW_PERFECT_HASH_FUNCTION_TYPE {
	ETW_PHF_EVENT_ID = 0x0,
	ETW_PHF_STACK_WALK = 0x1,
	ETW_PHF_MAX_COUNT = 0x2
};

struct _ETW_PERF_COUNTERS {
	/*0000*/ LONG TotalActiveSessions;
	/*0004*/ LONG TotalBufferMemoryNonPagedPool;
	/*0008*/ LONG TotalBufferMemoryPagedPool;
	/*000c*/ LONG TotalGuidsEnabled;
	/*0010*/ LONG TotalGuidsNotEnabled;
	/*0014*/ LONG TotalGuidsPreEnabled;
	/*0018*/
};

enum _ETW_PERIODIC_TIMER_STATE {
	EtwpPeriodicTimerUnset = 0x0,
	EtwpPeriodicTimerSet = 0x1
};

struct _ETW_PMC_SUPPORT {
	/*0000*/ _KPROFILE_SOURCE * Source;
	/*0008*/ ULONG volatile HookIdCount;
	/*000c*/ USHORT HookId[0x4];
	/*0014*/ ULONG volatile CountersCount;
	/*0018*/ _HAL_PMC_COUNTERS * ProcessorCtrs[0x1];
	/*0020*/
};

struct _ETW_PRIV_HANDLE_DEMUX_TABLE {
	/*0000*/ _RTL_RB_TREE Tree;
	/*0010*/ _EX_PUSH_LOCK Lock;
	/*0018*/ USHORT SequenceNumber;
	/*0020*/
};

struct _ETW_PROVIDER_TRAITS {
	/*0000*/ _RTL_BALANCED_NODE Node;
	/*0018*/ ULONG ReferenceCount;
	/*001c*/ UCHAR Traits[0x1];
	/*0020*/
};

struct _ETW_QUEUE_ENTRY {
	/*0000*/ _LIST_ENTRY ListEntry;
	/*0010*/ _ETWP_NOTIFICATION_HEADER * DataBlock;
	/*0018*/ _ETW_REG_ENTRY * RegEntry;
	/*0020*/ _ETW_REG_ENTRY * ReplyObject;
	/*0028*/ void * WakeReference;
	/*0030*/ USHORT RegIndex;
	/*0032*/ USHORT ReplyIndex;
	/*0034*/ ULONG Flags;
	/*0038*/
};

struct _ETW_REALTIME_CONSUMER {
	/*0000*/ _LIST_ENTRY Links;
	/*0010*/ void * ProcessHandle;
	/*0018*/ _EPROCESS * ProcessObject;
	/*0020*/ void * NextNotDelivered;
	/*0028*/ void * RealtimeConnectContext;
	/*0030*/ _KEVENT * DisconnectEvent;
	/*0038*/ _KEVENT * DataAvailableEvent;
	/*0040*/ ULONG * UserBufferCount;
	/*0048*/ _SINGLE_LIST_ENTRY * UserBufferListHead;
	/*0050*/ ULONG BuffersLost;
	/*0054*/ ULONG EmptyBuffersCount;
	/*0058*/ USHORT LoggerId;
	/*005a*/ UCHAR Flags;
	/*005a*/ UCHAR ShutDownRequested : 01; // 0x01;
	/*005a*/ UCHAR NewBuffersLost : 01; // 0x02;
	/*005a*/ UCHAR Disconnected : 01; // 0x04;
	/*005a*/ UCHAR Notified : 01; // 0x08;
	/*005a*/ UCHAR Wow : 01; // 0x10;
	/*0060*/ _RTL_BITMAP ReservedBufferSpaceBitMap;
	/*0070*/ UCHAR * ReservedBufferSpace;
	/*0078*/ ULONG ReservedBufferSpaceSize;
	/*007c*/ ULONG UserPagesAllocated;
	/*0080*/ ULONG UserPagesReused;
	/*0088*/ ULONG * EventsLostCount;
	/*0090*/ ULONG * BuffersLostCount;
	/*0098*/ _ETW_SILODRIVERSTATE * SiloState;
	/*00a0*/
};

struct _ETW_REF_CLOCK {
	/*0000*/ _LARGE_INTEGER StartTime;
	/*0008*/ _LARGE_INTEGER StartPerfClock;
	/*0010*/
};

struct _ETW_REG_ENTRY {
	/*0000*/ _LIST_ENTRY RegList;
	/*0010*/ _LIST_ENTRY GroupRegList;
	/*0020*/ _ETW_GUID_ENTRY * GuidEntry;
	/*0028*/ _ETW_GUID_ENTRY * GroupEntry;
	/*0030*/ _ETW_REPLY_QUEUE * ReplyQueue;
	/*0030*/ _ETW_QUEUE_ENTRY * ReplySlot[0x4];
	/*0030*/ void * Caller;
	/*0038*/ ULONG SessionId;
	/*0050*/ _EPROCESS * Process;
	/*0050*/ void * CallbackContext;
	/*0058*/ void * Callback;
	/*0060*/ USHORT Index;
	/*0062*/ USHORT Flags;
	/*0062*/ USHORT DbgKernelRegistration : 01; // 0x0001;
	/*0062*/ USHORT DbgUserRegistration : 01; // 0x0002;
	/*0062*/ USHORT DbgReplyRegistration : 01; // 0x0004;
	/*0062*/ USHORT DbgClassicRegistration : 01; // 0x0008;
	/*0062*/ USHORT DbgSessionSpaceRegistration : 01; // 0x0010;
	/*0062*/ USHORT DbgModernRegistration : 01; // 0x0020;
	/*0062*/ USHORT DbgClosed : 01; // 0x0040;
	/*0062*/ USHORT DbgInserted : 01; // 0x0080;
	/*0062*/ USHORT DbgWow64 : 01; // 0x0100;
	/*0062*/ USHORT DbgUseDescriptorType : 01; // 0x0200;
	/*0062*/ USHORT DbgDropProviderTraits : 01; // 0x0400;
	/*0064*/ UCHAR EnableMask;
	/*0065*/ UCHAR GroupEnableMask;
	/*0068*/ _ETW_PROVIDER_TRAITS * Traits;
	/*0070*/
};

struct _ETW_REPLY_QUEUE {
	/*0000*/ _KQUEUE Queue;
	/*0040*/ LONG EventsLost;
	/*0048*/
};

enum _ETW_RT_EVENT_LOSS {
	EtwRtEventNoLoss = 0x0,
	EtwRtEventLost = 0x1,
	EtwRtBufferLost = 0x2,
	EtwRtBackupLost = 0x3,
	EtwRtEventLossMax = 0x4
};

struct _ETW_SESSION_PERF_COUNTERS {
	/*0000*/ LONG BufferMemoryPagedPool;
	/*0004*/ LONG BufferMemoryNonPagedPool;
	/*0008*/ ULONGLONG EventsLoggedCount;
	/*0010*/ LONG EventsLost;
	/*0014*/ LONG NumConsumers;
	/*0018*/
};

struct _ETW_SILODRIVERSTATE {
	/*0000*/ _EJOB * Silo;
	/*0008*/ _ESERVERSILO_GLOBALS * SiloGlobals;
	/*0010*/ ULONG MaxLoggers;
	/*0018*/ _ETW_GUID_ENTRY EtwpSecurityProviderGuidEntry;
	/*01a8*/ _EX_RUNDOWN_REF_CACHE_AWARE * * EtwpLoggerRundown;
	/*01b0*/ _WMI_LOGGER_CONTEXT * * EtwpLoggerContext;
	/*01b8*/ _ETW_HASH_BUCKET EtwpGuidHashTable[0x40];
	/*0fb8*/ USHORT EtwpSecurityLoggers[0x8];
	/*0fc8*/ UCHAR EtwpSecurityProviderEnableMask;
	/*0fcc*/ LONG EtwpShutdownInProgress;
	/*0fd0*/ ULONG EtwpSecurityProviderPID;
	/*0fd8*/ _ETW_PRIV_HANDLE_DEMUX_TABLE PrivHandleDemuxTable;
	/*0ff8*/ _ETW_COUNTERS EtwpCounters;
	/*1008*/ _LARGE_INTEGER LogfileBytesWritten;
	/*1010*/ _ETW_SILO_TRACING_BLOCK * ProcessorBlocks;
	/*1018*/ _EX_WNF_SUBSCRIPTION * ContainerRestoreWnfSubscription;
	/*1020*/ _GUID PartitionId;
	/*1030*/ _GUID ParentId;
	/*1040*/ _LARGE_INTEGER QpcOffsetFromRoot;
	/*1048*/ ULONG PartitionType;
	/*104c*/ _ETW_SYSTEM_LOGGER_SETTINGS SystemLoggerSettings;
	/*11c0*/ _KMUTANT EtwpStartTraceMutex;
	/*11f8*/
};

struct _ETW_SILO_TRACING_BLOCK {
	/*0000*/ _EX_FAST_REF * ProcessorBuffers;
	/*0008*/ ULONGLONG * EventsLoggedCount;
	/*0010*/ LONGLONG * volatile QpcDelta;
	/*0040*/
};

struct _ETW_SOFT_RESTART_CONTEXT;

struct _ETW_STACK_CACHE;

struct _ETW_STACK_TRACE_BLOCK {
	/*0000*/ _LARGE_INTEGER RelatedTimestamp;
	/*0008*/ _ETHREAD * Thread;
	/*0010*/ _KDPC StackWalkDpc;
	/*0050*/ _SLIST_HEADER ApcListHead;
	/*0060*/ _ETW_APC_ENTRY * ApcEntry;
	/*0068*/ ULONG ApcEntryCount;
	/*006c*/ LONG Flags;
	/*0070*/ LONG ApcCount;
	/*0074*/ LONG MaxApcCount;
	/*0080*/
};

enum _ETW_STRING_TOKEN_TYPE {
	ETW_STRING_TOKEN_EXE = 0x0,
	ETW_STRING_TOKEN_PACKAGE_ID = 0x1,
	ETW_STRING_TOKEN_PKG_APP_ID = 0x2,
	ETW_STRING_TOKEN_MAX_COUNT = 0x3
};

struct _ETW_SYSTEMTIME {
	/*0000*/ USHORT Year;
	/*0002*/ USHORT Month;
	/*0004*/ USHORT DayOfWeek;
	/*0006*/ USHORT Day;
	/*0008*/ USHORT Hour;
	/*000a*/ USHORT Minute;
	/*000c*/ USHORT Second;
	/*000e*/ USHORT Milliseconds;
	/*0010*/
};

struct _ETW_SYSTEM_LOGGER {
	/*0000*/ UCHAR LoggerId;
	/*0001*/ UCHAR ClockType;
	/*0002*/
};

struct _ETW_SYSTEM_LOGGER_SETTINGS {
	/*0000*/ _ETW_SYSTEM_LOGGER EtwpSystemLogger[0x8];
	/*0010*/ ULONG volatile EtwpActiveSystemLoggers;
	/*0014*/ _PERFINFO_GROUPMASK SiloGlobalGroupMask;
	/*0034*/ _PERFINFO_GROUPMASK EtwpGroupMasks[0xa];
	/*0174*/
};

struct _ETW_WMITRACE_WORK {
	/*0000*/ ULONG LoggerId;
	/*0004*/ ULONG SiloSessionId;
	/*0008*/ CHAR LoggerName[0x41];
	/*0049*/ CHAR FileName[0x81];
	/*00cc*/ ULONG MaximumFileSize;
	/*00d0*/ ULONG MinBuffers;
	/*00d4*/ ULONG MaxBuffers;
	/*00d8*/ ULONG BufferSize;
	/*00dc*/ ULONG Mode;
	/*00e0*/ ULONG FlushTimer;
	/*0008*/ ULONGLONG MatchAny;
	/*0010*/ ULONGLONG MatchAll;
	/*0018*/ ULONG EnableProperty;
	/*001c*/ _GUID Guid;
	/*002c*/ UCHAR Level;
	/*00e8*/ LONG Status;
	/*00f0*/
};

struct _EVENT_DATA_DESCRIPTOR {
	/*0000*/ ULONGLONG Ptr;
	/*0008*/ ULONG Size;
	/*000c*/ ULONG Reserved;
	/*000c*/ UCHAR Type;
	/*000d*/ UCHAR Reserved1;
	/*000e*/ USHORT Reserved2;
	/*0010*/
};

struct _EVENT_DESCRIPTOR {
	/*0000*/ USHORT Id;
	/*0002*/ UCHAR Version;
	/*0003*/ UCHAR Channel;
	/*0004*/ UCHAR Level;
	/*0005*/ UCHAR Opcode;
	/*0006*/ USHORT Task;
	/*0008*/ ULONGLONG Keyword;
	/*0010*/
};

struct _EVENT_FILTER_DESCRIPTOR {
	/*0000*/ ULONGLONG Ptr;
	/*0008*/ ULONG Size;
	/*000c*/ ULONG Type;
	/*0010*/
};

struct _EVENT_FILTER_HEADER {
	/*0000*/ USHORT Id;
	/*0002*/ UCHAR Version;
	/*0003*/ UCHAR Reserved[0x5];
	/*0008*/ ULONGLONG InstanceId;
	/*0010*/ ULONG Size;
	/*0014*/ ULONG NextOffset;
	/*0018*/
};

struct _EVENT_FILTER_LEVEL_KW {
	/*0000*/ ULONGLONG MatchAnyKeyword;
	/*0008*/ ULONGLONG MatchAllKeyword;
	/*0010*/ UCHAR Level;
	/*0011*/ UCHAR FilterIn;
	/*0018*/
};

struct _EVENT_HEADER {
	/*0000*/ USHORT Size;
	/*0002*/ USHORT HeaderType;
	/*0004*/ USHORT Flags;
	/*0006*/ USHORT EventProperty;
	/*0008*/ ULONG ThreadId;
	/*000c*/ ULONG ProcessId;
	/*0010*/ _LARGE_INTEGER TimeStamp;
	/*0018*/ _GUID ProviderId;
	/*0028*/ _EVENT_DESCRIPTOR EventDescriptor;
	/*0038*/ ULONG KernelTime;
	/*003c*/ ULONG UserTime;
	/*0038*/ ULONGLONG ProcessorTime;
	/*0040*/ _GUID ActivityId;
	/*0050*/
};

struct _EVENT_HEADER_EXTENDED_DATA_ITEM {
	/*0000*/ USHORT Reserved1;
	/*0002*/ USHORT ExtType;
	/*0004*/ USHORT Linkage : 01; // 0x0001;
	/*0004*/ USHORT Reserved2 : 15; // 0xfffe;
	/*0006*/ USHORT DataSize;
	/*0008*/ ULONGLONG DataPtr;
	/*0010*/
};

enum _EVENT_INFO_CLASS {
	EventProviderBinaryTrackInfo = 0x0,
	EventProviderSetReserved1 = 0x1,
	EventProviderSetTraits = 0x2,
	EventProviderUseDescriptorType = 0x3,
	MaxEventInfo = 0x4
};

struct _EVENT_PAYLOAD_PREDICATE {
	/*0000*/ USHORT FieldIndex;
	/*0002*/ USHORT CompareOp;
	/*0008*/ ULONGLONG Value[0x2];
	/*0018*/
};

struct _EVENT_RECORD {
	/*0000*/ _EVENT_HEADER EventHeader;
	/*0050*/ _ETW_BUFFER_CONTEXT BufferContext;
	/*0054*/ USHORT ExtendedDataCount;
	/*0056*/ USHORT UserDataLength;
	/*0058*/ _EVENT_HEADER_EXTENDED_DATA_ITEM * ExtendedData;
	/*0060*/ void * UserData;
	/*0068*/ void * UserContext;
	/*0070*/
};

enum _EVENT_TYPE {
	NotificationEvent = 0x0,
	SynchronizationEvent = 0x1
};

struct _EWOW64PROCESS {
	/*0000*/ void * Peb;
	/*0008*/ USHORT Machine;
	/*000c*/ _SYSTEM_DLL_TYPE NtdllType;
	/*0010*/
};

enum _EXCEPTION_DISPOSITION {
	ExceptionContinueExecution = 0x0,
	ExceptionContinueSearch = 0x1,
	ExceptionNestedException = 0x2,
	ExceptionCollidedUnwind = 0x3
};

struct _EXCEPTION_POINTERS {
	/*0000*/ _EXCEPTION_RECORD * ExceptionRecord;
	/*0008*/ _CONTEXT * ContextRecord;
	/*0010*/
};

struct _EXCEPTION_RECORD {
	/*0000*/ LONG ExceptionCode;
	/*0004*/ ULONG ExceptionFlags;
	/*0008*/ _EXCEPTION_RECORD * ExceptionRecord;
	/*0010*/ void * ExceptionAddress;
	/*0018*/ ULONG NumberParameters;
	/*0020*/ ULONGLONG ExceptionInformation[0xf];
	/*0098*/
};

struct _EXCEPTION_RECORD32 {
	/*0000*/ LONG ExceptionCode;
	/*0004*/ ULONG ExceptionFlags;
	/*0008*/ ULONG ExceptionRecord;
	/*000c*/ ULONG ExceptionAddress;
	/*0010*/ ULONG NumberParameters;
	/*0014*/ ULONG ExceptionInformation[0xf];
	/*0050*/
};

struct _EXCEPTION_RECORD64 {
	/*0000*/ LONG ExceptionCode;
	/*0004*/ ULONG ExceptionFlags;
	/*0008*/ ULONGLONG ExceptionRecord;
	/*0010*/ ULONGLONG ExceptionAddress;
	/*0018*/ ULONG NumberParameters;
	/*001c*/ ULONG __unusedAlignment;
	/*0020*/ ULONGLONG ExceptionInformation[0xf];
	/*0098*/
};

struct _EXCEPTION_REGISTRATION_RECORD {
	/*0000*/ _EXCEPTION_REGISTRATION_RECORD * Next;
	/*0008*/ _EXCEPTION_DISPOSITION (* Handler)( _EXCEPTION_RECORD * , void * , _CONTEXT * , void * );
	/*0010*/
};

struct _EXHANDLE {
	/*0000*/ ULONG TagBits : 02; // 0x00000003;
	/*0000*/ ULONG Index : 30; // 0xfffffffc;
	/*0000*/ void * GenericHandleOverlay;
	/*0000*/ ULONGLONG Value;
	/*0008*/
};

enum _EXQUEUEINDEX {
	ExPoolUntrusted = 0x0,
	IoPoolUntrusted = 0x1,
	ExPoolMax = 0x8
};

struct _EXT_DELETE_PARAMETERS {
	/*0000*/ ULONG Version;
	/*0004*/ ULONG Reserved;
	/*0008*/ void (* DeleteCallback)( void * );
	/*0010*/ void * DeleteContext;
	/*0018*/
};

struct _EXT_IOMMU_DEVICE_ID {
	/*0000*/ _EXT_IOMMU_DEVICE_TYPE DeviceType;
	/*0008*/ _EXT_IOMMU_DEVICE_ID_PCI Pci;
	/*0008*/ _EXT_IOMMU_DEVICE_ID_ACPI Acpi;
	/*0008*/ UCHAR IoApicId;
	/*0008*/ ULONGLONG LogicalId;
	/*0008*/ _EXT_IOMMU_DEVICE_ID_TEST Test;
	/*0008*/ _EXT_IOMMU_DEVICE_ID_GIC Gic;
	/*0018*/
};

struct _EXT_IOMMU_DEVICE_ID_ACPI {
	/*0000*/ CHAR const * ObjectName;
	/*0008*/
};

struct _EXT_IOMMU_DEVICE_ID_GIC {
	/*0000*/ UINT LineNumber;
	/*0004*/
};

struct _EXT_IOMMU_DEVICE_ID_PCI {
	/*0000*/ ULONGLONG AsUINT64;
	/*0000*/ USHORT PciSegmentNumber;
	/*0002*/ USHORT PhantomFunctionBits : 02; // 0x0003;
	/*0002*/ USHORT BusRange : 01; // 0x0004;
	/*0002*/ USHORT DevicePathLength : 05; // 0x00f8;
	/*0002*/ USHORT StartBusNumber : 08; // 0xff00;
	/*0004*/ USHORT Bdf;
	/*0004*/ UCHAR SubordinateBus;
	/*0005*/ UCHAR SecondaryBus;
	/*0008*/ WCHAR * DevicePath;
	/*0010*/
};

struct _EXT_IOMMU_DEVICE_ID_TEST {
	/*0000*/ ULONGLONG UniqueId;
	/*0008*/
};

enum _EXT_IOMMU_DEVICE_TYPE {
	EXT_IOMMU_DEVICE_TYPE_INVALID = 0x0,
	EXT_IOMMU_DEVICE_TYPE_PCI = 0x1,
	EXT_IOMMU_DEVICE_TYPE_ACPI = 0x2,
	EXT_IOMMU_DEVICE_TYPE_IOAPIC = 0x3,
	EXT_IOMMU_DEVICE_TYPE_LOGICAL = 0x4,
	EXT_IOMMU_DEVICE_TYPE_GIC = 0x5,
	EXT_IOMMU_DEVICE_TYPE_TEST = 0x6,
	EXT_IOMMU_DEVICE_TYPE_MAX = 0x7
};

struct _EXT_SET_PARAMETERS_V0 {
	/*0000*/ ULONG Version;
	/*0004*/ ULONG Reserved;
	/*0008*/ LONGLONG NoWakeTolerance;
	/*0010*/
};

struct _EX_FAST_REF {
	/*0000*/ void * Object;
	/*0000*/ ULONGLONG RefCnt : 04; // 0x000000000000000f;
	/*0000*/ ULONGLONG Value;
	/*0008*/
};

enum _EX_GEN_RANDOM_DOMAIN {
	ExGenRandomDomainKernel = 0x0,
	ExGenRandomDomainFirst = 0x0,
	ExGenRandomDomainUserVisible = 0x1,
	ExGenRandomDomainMax = 0x2
};

struct _EX_HEAP_POOL_NODE {
	/*0000*/ _SEGMENT_HEAP * Heaps[0x4];
	/*0040*/ _RTL_DYNAMIC_LOOKASIDE Lookasides[0x2];
	/*20c0*/
};

struct _EX_HEAP_SESSION_STATE {
	/*0000*/ _RTLP_HP_HEAP_MANAGER HeapManager;
	/*38d0*/ RTL_HP_ENV_HANDLE PagedEnv;
	/*38e0*/ _SEGMENT_HEAP * PagedHeap;
	/*38e8*/ _SEGMENT_HEAP * SpecialPoolHeap;
	/*38f0*/
};

enum _EX_HEAP_TYPE {
	ExHeapTypeNonPagedMin = 0x0,
	ExHeapTypeNonPaged = 0x0,
	ExHeapTypeNonPagedMax = 0x1,
	ExHeapTypeNonPagedNx = 0x1,
	ExHeapTypePagedMin = 0x2,
	ExHeapTypePaged = 0x2,
	ExHeapTypePagedMax = 0x3,
	ExHeapTypeSpecialMax = 0x3,
	ExHeapTypeMmSt = 0x3,
	ExHeapTypeMax = 0x4
};

struct _EX_PARTITION {
	/*0000*/ _EPARTITION * PartitionObject;
	/*0008*/ _EX_WORK_QUEUE * * volatile * WorkQueues;
	/*0010*/ _EX_WORK_QUEUE_MANAGER * * WorkQueueManagers;
	/*0018*/ LONG volatile QueueAllocationMask;
	/*0020*/
};

struct _EX_POOL_HEAP_MANAGER_STATE {
	/*0000*/ _RTLP_HP_HEAP_MANAGER HeapManager;
	/*38d0*/ ULONG NumberOfPools;
	/*3900*/ _EX_HEAP_POOL_NODE PoolNode[0x40];
	/*86900*/ _SEGMENT_HEAP * SpecialHeaps[0x3];
	/*86940*/
};

enum _EX_POOL_PRIORITY {
	LowPoolPriority = 0x0,
	LowPoolPrioritySpecialPoolOverrun = 0x8,
	LowPoolPrioritySpecialPoolUnderrun = 0x9,
	NormalPoolPriority = 0x10,
	NormalPoolPrioritySpecialPoolOverrun = 0x18,
	NormalPoolPrioritySpecialPoolUnderrun = 0x19,
	HighPoolPriority = 0x20,
	HighPoolPrioritySpecialPoolOverrun = 0x28,
	HighPoolPrioritySpecialPoolUnderrun = 0x29
};

struct _EX_PUSH_LOCK {
	/*0000*/ ULONGLONG Locked : 01; // 0x0000000000000001;
	/*0000*/ ULONGLONG Waiting : 01; // 0x0000000000000002;
	/*0000*/ ULONGLONG Waking : 01; // 0x0000000000000004;
	/*0000*/ ULONGLONG MultipleShared : 01; // 0x0000000000000008;
	/*0000*/ ULONGLONG Shared : 60; // 0xfffffffffffffff0;
	/*0000*/ ULONGLONG Value;
	/*0000*/ void * Ptr;
	/*0008*/
};

struct _EX_PUSH_LOCK_AUTO_EXPAND {
	/*0000*/ _EX_PUSH_LOCK LocalLock;
	/*0008*/ _EX_PUSH_LOCK_AUTO_EXPAND_STATE State;
	/*000c*/ ULONG Stats;
	/*0010*/
};

struct _EX_PUSH_LOCK_AUTO_EXPAND_STATE {
	/*0000*/ ULONG Expanded : 01; // 0x00000001;
	/*0000*/ ULONG Transitioning : 01; // 0x00000002;
	/*0000*/ ULONG Pageable : 01; // 0x00000004;
	/*0000*/ ULONG Value;
	/*0004*/
};

struct _EX_RUNDOWN_REF {
	/*0000*/ ULONGLONG Count;
	/*0000*/ void * Ptr;
	/*0008*/
};

struct _EX_RUNDOWN_REF_CACHE_AWARE {
	/*0000*/ _EX_RUNDOWN_REF * RunRefs;
	/*0008*/ void * PoolToFree;
	/*0010*/ ULONG RunRefSize;
	/*0014*/ ULONG Number;
	/*0018*/
};

struct _EX_TIMER;

struct _EX_WNF_SUBSCRIPTION;

struct _EX_WORK_QUEUE {
	/*0000*/ _KPRIQUEUE WorkPriQueue;
	/*02b0*/ _EX_PARTITION * Partition;
	/*02b8*/ _ENODE * Node;
	/*02c0*/ ULONG volatile WorkItemsProcessed;
	/*02c4*/ ULONG WorkItemsProcessedLastPass;
	/*02c8*/ LONG volatile ThreadCount;
	/*02cc*/ LONG MinThreads : 31; // 0x7fffffff;
	/*02cc*/ ULONG volatile TryFailed : 01; // 0x80000000;
	/*02d0*/ LONG MaxThreads;
	/*02d4*/ _EXQUEUEINDEX QueueIndex;
	/*02d8*/ _KEVENT * AllThreadsExitedEvent;
	/*02e0*/
};

struct _EX_WORK_QUEUE_MANAGER {
	/*0000*/ _EX_PARTITION * Partition;
	/*0008*/ _ENODE * Node;
	/*0010*/ _KEVENT Event;
	/*0028*/ _KTIMER DeadlockTimer;
	/*0068*/ _KEVENT ReaperEvent;
	/*0080*/ _KTIMER2 ReaperTimer;
	/*0108*/ void * ThreadHandle;
	/*0110*/ ULONG volatile ExitThread;
	/*0114*/ USHORT ThreadSeed;
	/*0118*/
};

struct _FAKE_HEAP_ENTRY {
	/*0000*/ ULONGLONG Size;
	/*0008*/ ULONGLONG PreviousSize;
	/*0010*/
};

struct _FAST_ERESOURCE {
	/*0000*/ void * Reserved1[0x3];
	/*0018*/ ULONG Reserved2;
	/*0020*/ void * Reserved3[0x4];
	/*0040*/ ULONG Reserved4[0x4];
	/*0050*/ void * Reserved5;
	/*0058*/ void * Reserved6[0x2];
	/*0068*/
};

struct _FAST_ERESOURCE_INTERNAL {
	/*0000*/ _LIST_ENTRY SystemResourcesList;
	/*0010*/ void * ReservedPointer;
	/*0018*/ SHORT ActiveCount;
	/*001a*/ USHORT Flag;
	/*0020*/ _KWAIT_CHAIN SharedWaiters;
	/*0028*/ _KWAIT_CHAIN ExclusiveWaiters;
	/*0030*/ _LIST_ENTRY OwnerEntryListHead;
	/*0040*/ ULONG ActiveEntries;
	/*0044*/ ULONG ContentionCount;
	/*0048*/ ULONG NumberOfSharedWaiters;
	/*004c*/ ULONG NumberOfExclusiveWaiters;
	/*0050*/ void * ReservedWin64OnlyPointer;
	/*0058*/ void * Address;
	/*0058*/ ULONGLONG CreatorBackTraceIndex;
	/*0060*/ ULONGLONG SpinLock;
	/*0068*/
};

struct _FAST_IO_DISPATCH {
	/*0000*/ ULONG SizeOfFastIoDispatch;
	/*0008*/ UCHAR (* FastIoCheckIfPossible)( _FILE_OBJECT * , _LARGE_INTEGER * , ULONG , UCHAR , ULONG , UCHAR , _IO_STATUS_BLOCK * , _DEVICE_OBJECT * );
	/*0010*/ UCHAR (* FastIoRead)( _FILE_OBJECT * , _LARGE_INTEGER * , ULONG , UCHAR , ULONG , void * , _IO_STATUS_BLOCK * , _DEVICE_OBJECT * );
	/*0018*/ UCHAR (* FastIoWrite)( _FILE_OBJECT * , _LARGE_INTEGER * , ULONG , UCHAR , ULONG , void * , _IO_STATUS_BLOCK * , _DEVICE_OBJECT * );
	/*0020*/ UCHAR (* FastIoQueryBasicInfo)( _FILE_OBJECT * , UCHAR , _FILE_BASIC_INFORMATION * , _IO_STATUS_BLOCK * , _DEVICE_OBJECT * );
	/*0028*/ UCHAR (* FastIoQueryStandardInfo)( _FILE_OBJECT * , UCHAR , _FILE_STANDARD_INFORMATION * , _IO_STATUS_BLOCK * , _DEVICE_OBJECT * );
	/*0030*/ UCHAR (* FastIoLock)( _FILE_OBJECT * , _LARGE_INTEGER * , _LARGE_INTEGER * , _EPROCESS * , ULONG , UCHAR , UCHAR , _IO_STATUS_BLOCK * , _DEVICE_OBJECT * );
	/*0038*/ UCHAR (* FastIoUnlockSingle)( _FILE_OBJECT * , _LARGE_INTEGER * , _LARGE_INTEGER * , _EPROCESS * , ULONG , _IO_STATUS_BLOCK * , _DEVICE_OBJECT * );
	/*0040*/ UCHAR (* FastIoUnlockAll)( _FILE_OBJECT * , _EPROCESS * , _IO_STATUS_BLOCK * , _DEVICE_OBJECT * );
	/*0048*/ UCHAR (* FastIoUnlockAllByKey)( _FILE_OBJECT * , void * , ULONG , _IO_STATUS_BLOCK * , _DEVICE_OBJECT * );
	/*0050*/ UCHAR (* FastIoDeviceControl)( _FILE_OBJECT * , UCHAR , void * , ULONG , void * , ULONG , ULONG , _IO_STATUS_BLOCK * , _DEVICE_OBJECT * );
	/*0058*/ void (* AcquireFileForNtCreateSection)( _FILE_OBJECT * );
	/*0060*/ void (* ReleaseFileForNtCreateSection)( _FILE_OBJECT * );
	/*0068*/ void (* FastIoDetachDevice)( _DEVICE_OBJECT * , _DEVICE_OBJECT * );
	/*0070*/ UCHAR (* FastIoQueryNetworkOpenInfo)( _FILE_OBJECT * , UCHAR , _FILE_NETWORK_OPEN_INFORMATION * , _IO_STATUS_BLOCK * , _DEVICE_OBJECT * );
	/*0078*/ LONG (* AcquireForModWrite)( _FILE_OBJECT * , _LARGE_INTEGER * , _ERESOURCE * * , _DEVICE_OBJECT * );
	/*0080*/ UCHAR (* MdlRead)( _FILE_OBJECT * , _LARGE_INTEGER * , ULONG , ULONG , _MDL * * , _IO_STATUS_BLOCK * , _DEVICE_OBJECT * );
	/*0088*/ UCHAR (* MdlReadComplete)( _FILE_OBJECT * , _MDL * , _DEVICE_OBJECT * );
	/*0090*/ UCHAR (* PrepareMdlWrite)( _FILE_OBJECT * , _LARGE_INTEGER * , ULONG , ULONG , _MDL * * , _IO_STATUS_BLOCK * , _DEVICE_OBJECT * );
	/*0098*/ UCHAR (* MdlWriteComplete)( _FILE_OBJECT * , _LARGE_INTEGER * , _MDL * , _DEVICE_OBJECT * );
	/*00a0*/ UCHAR (* FastIoReadCompressed)( _FILE_OBJECT * , _LARGE_INTEGER * , ULONG , ULONG , void * , _MDL * * , _IO_STATUS_BLOCK * , _COMPRESSED_DATA_INFO * , ULONG , _DEVICE_OBJECT * );
	/*00a8*/ UCHAR (* FastIoWriteCompressed)( _FILE_OBJECT * , _LARGE_INTEGER * , ULONG , ULONG , void * , _MDL * * , _IO_STATUS_BLOCK * , _COMPRESSED_DATA_INFO * , ULONG , _DEVICE_OBJECT * );
	/*00b0*/ UCHAR (* MdlReadCompleteCompressed)( _FILE_OBJECT * , _MDL * , _DEVICE_OBJECT * );
	/*00b8*/ UCHAR (* MdlWriteCompleteCompressed)( _FILE_OBJECT * , _LARGE_INTEGER * , _MDL * , _DEVICE_OBJECT * );
	/*00c0*/ UCHAR (* FastIoQueryOpen)( _IRP * , _FILE_NETWORK_OPEN_INFORMATION * , _DEVICE_OBJECT * );
	/*00c8*/ LONG (* ReleaseForModWrite)( _FILE_OBJECT * , _ERESOURCE * , _DEVICE_OBJECT * );
	/*00d0*/ LONG (* AcquireForCcFlush)( _FILE_OBJECT * , _DEVICE_OBJECT * );
	/*00d8*/ LONG (* ReleaseForCcFlush)( _FILE_OBJECT * , _DEVICE_OBJECT * );
	/*00e0*/
};

struct _FAST_MUTEX {
	/*0000*/ LONG Count;
	/*0008*/ void * Owner;
	/*0010*/ ULONG Contention;
	/*0018*/ _KEVENT Event;
	/*0030*/ ULONG OldIrql;
	/*0038*/
};

struct _FAST_OWNER_ENTRY {
	/*0000*/ void * Reserved[0x9];
	/*0048*/
};

struct _FAST_OWNER_ENTRY_INTERNAL {
	/*0000*/ _LIST_ENTRY ListEntry;
	/*0010*/ UCHAR AbLockHandle;
	/*0011*/ UCHAR Disowned : 01; // 0x01;
	/*0011*/ UCHAR DynamicallyAllocated : 01; // 0x02;
	/*0011*/ UCHAR CallerExclusive : 01; // 0x04;
	/*0012*/ UCHAR IsSublistHead;
	/*0013*/ UCHAR IsWaiting;
	/*0018*/ void * LockAddress;
	/*0020*/ void * ThreadAddress;
	/*0028*/ _LIST_ENTRY SublistHead;
	/*0038*/ _LIST_ENTRY LockListEntry;
	/*0048*/
};

struct _FAULT_INFORMATION {
	/*0000*/ _FAULT_INFORMATION_ARCH Type;
	/*0008*/ _FAULT_INFORMATION_ARM64 Arm64;
	/*0030*/
};

enum _FAULT_INFORMATION_ARCH {
	FaultInformationInvalid = 0x0,
	FaultInformationArm64 = 0x1
};

struct _FAULT_INFORMATION_ARM64 {
	/*0000*/ void * DomainHandle;
	/*0008*/ void * FaultAddress;
	/*0010*/ _DEVICE_OBJECT * PhysicalDeviceObject;
	/*0018*/ ULONG InputMappingId;
	/*001c*/ _FAULT_INFORMATION_ARM64_FLAGS Flags;
	/*0020*/ _FAULT_INFORMATION_ARM64_TYPE Type;
	/*0028*/
};

struct _FAULT_INFORMATION_ARM64_FLAGS {
	/*0000*/ ULONG WriteNotRead : 01; // 0x00000001;
	/*0000*/ ULONG InstructionNotData : 01; // 0x00000002;
	/*0000*/ ULONG Privileged : 01; // 0x00000004;
	/*0000*/ ULONG FaultAddressValid : 01; // 0x00000008;
	/*0000*/ ULONG Reserved : 28; // 0xfffffff0;
	/*0004*/
};

enum _FAULT_INFORMATION_ARM64_TYPE {
	UnsupportedUpstreamTransaction = 0x0,
	AddressSizeFault = 0x1,
	TlbMatchConflict = 0x2,
	ExternalFault = 0x3,
	PermissionFault = 0x4,
	AccessFlagFault = 0x5,
	TranslationFault = 0x6,
	MaxFaultType = 0x7
};

struct _FILESYSTEM_DISK_COUNTERS {
	/*0000*/ ULONGLONG FsBytesRead;
	/*0008*/ ULONGLONG FsBytesWritten;
	/*0010*/
};

struct _FILE_BASIC_INFORMATION {
	/*0000*/ _LARGE_INTEGER CreationTime;
	/*0008*/ _LARGE_INTEGER LastAccessTime;
	/*0010*/ _LARGE_INTEGER LastWriteTime;
	/*0018*/ _LARGE_INTEGER ChangeTime;
	/*0020*/ ULONG FileAttributes;
	/*0028*/
};

struct _FILE_GET_QUOTA_INFORMATION {
	/*0000*/ ULONG NextEntryOffset;
	/*0004*/ ULONG SidLength;
	/*0008*/ _SID Sid;
	/*0014*/
};

enum _FILE_INFORMATION_CLASS {
	FileDirectoryInformation = 0x1,
	FileFullDirectoryInformation = 0x2,
	FileBothDirectoryInformation = 0x3,
	FileBasicInformation = 0x4,
	FileStandardInformation = 0x5,
	FileInternalInformation = 0x6,
	FileEaInformation = 0x7,
	FileAccessInformation = 0x8,
	FileNameInformation = 0x9,
	FileRenameInformation = 0xa,
	FileLinkInformation = 0xb,
	FileNamesInformation = 0xc,
	FileDispositionInformation = 0xd,
	FilePositionInformation = 0xe,
	FileFullEaInformation = 0xf,
	FileModeInformation = 0x10,
	FileAlignmentInformation = 0x11,
	FileAllInformation = 0x12,
	FileAllocationInformation = 0x13,
	FileEndOfFileInformation = 0x14,
	FileAlternateNameInformation = 0x15,
	FileStreamInformation = 0x16,
	FilePipeInformation = 0x17,
	FilePipeLocalInformation = 0x18,
	FilePipeRemoteInformation = 0x19,
	FileMailslotQueryInformation = 0x1a,
	FileMailslotSetInformation = 0x1b,
	FileCompressionInformation = 0x1c,
	FileObjectIdInformation = 0x1d,
	FileCompletionInformation = 0x1e,
	FileMoveClusterInformation = 0x1f,
	FileQuotaInformation = 0x20,
	FileReparsePointInformation = 0x21,
	FileNetworkOpenInformation = 0x22,
	FileAttributeTagInformation = 0x23,
	FileTrackingInformation = 0x24,
	FileIdBothDirectoryInformation = 0x25,
	FileIdFullDirectoryInformation = 0x26,
	FileValidDataLengthInformation = 0x27,
	FileShortNameInformation = 0x28,
	FileIoCompletionNotificationInformation = 0x29,
	FileIoStatusBlockRangeInformation = 0x2a,
	FileIoPriorityHintInformation = 0x2b,
	FileSfioReserveInformation = 0x2c,
	FileSfioVolumeInformation = 0x2d,
	FileHardLinkInformation = 0x2e,
	FileProcessIdsUsingFileInformation = 0x2f,
	FileNormalizedNameInformation = 0x30,
	FileNetworkPhysicalNameInformation = 0x31,
	FileIdGlobalTxDirectoryInformation = 0x32,
	FileIsRemoteDeviceInformation = 0x33,
	FileUnusedInformation = 0x34,
	FileNumaNodeInformation = 0x35,
	FileStandardLinkInformation = 0x36,
	FileRemoteProtocolInformation = 0x37,
	FileRenameInformationBypassAccessCheck = 0x38,
	FileLinkInformationBypassAccessCheck = 0x39,
	FileVolumeNameInformation = 0x3a,
	FileIdInformation = 0x3b,
	FileIdExtdDirectoryInformation = 0x3c,
	FileReplaceCompletionInformation = 0x3d,
	FileHardLinkFullIdInformation = 0x3e,
	FileIdExtdBothDirectoryInformation = 0x3f,
	FileDispositionInformationEx = 0x40,
	FileRenameInformationEx = 0x41,
	FileRenameInformationExBypassAccessCheck = 0x42,
	FileDesiredStorageClassInformation = 0x43,
	FileStatInformation = 0x44,
	FileMemoryPartitionInformation = 0x45,
	FileStatLxInformation = 0x46,
	FileCaseSensitiveInformation = 0x47,
	FileLinkInformationEx = 0x48,
	FileLinkInformationExBypassAccessCheck = 0x49,
	FileStorageReserveIdInformation = 0x4a,
	FileCaseSensitiveInformationForceAccessCheck = 0x4b,
	FileMaximumInformation = 0x4c
};

struct _FILE_NETWORK_OPEN_INFORMATION {
	/*0000*/ _LARGE_INTEGER CreationTime;
	/*0008*/ _LARGE_INTEGER LastAccessTime;
	/*0010*/ _LARGE_INTEGER LastWriteTime;
	/*0018*/ _LARGE_INTEGER ChangeTime;
	/*0020*/ _LARGE_INTEGER AllocationSize;
	/*0028*/ _LARGE_INTEGER EndOfFile;
	/*0030*/ ULONG FileAttributes;
	/*0038*/
};

struct _FILE_OBJECT {
	/*0000*/ SHORT Type;
	/*0002*/ SHORT Size;
	/*0008*/ _DEVICE_OBJECT * DeviceObject;
	/*0010*/ _VPB * Vpb;
	/*0018*/ void * FsContext;
	/*0020*/ void * FsContext2;
	/*0028*/ _SECTION_OBJECT_POINTERS * SectionObjectPointer;
	/*0030*/ void * PrivateCacheMap;
	/*0038*/ LONG FinalStatus;
	/*0040*/ _FILE_OBJECT * RelatedFileObject;
	/*0048*/ UCHAR LockOperation;
	/*0049*/ UCHAR DeletePending;
	/*004a*/ UCHAR ReadAccess;
	/*004b*/ UCHAR WriteAccess;
	/*004c*/ UCHAR DeleteAccess;
	/*004d*/ UCHAR SharedRead;
	/*004e*/ UCHAR SharedWrite;
	/*004f*/ UCHAR SharedDelete;
	/*0050*/ ULONG Flags;
	/*0058*/ _UNICODE_STRING FileName;
	/*0068*/ _LARGE_INTEGER CurrentByteOffset;
	/*0070*/ ULONG Waiters;
	/*0074*/ ULONG Busy;
	/*0078*/ void * LastLock;
	/*0080*/ _KEVENT Lock;
	/*0098*/ _KEVENT Event;
	/*00b0*/ _IO_COMPLETION_CONTEXT * CompletionContext;
	/*00b8*/ ULONGLONG IrpListLock;
	/*00c0*/ _LIST_ENTRY IrpList;
	/*00d0*/ void * FileObjectExtension;
	/*00d8*/
};

enum _FILE_OBJECT_EXTENSION_TYPE {
	FoExtTypeTransactionParams = 0x0,
	FoExtTypeInternal = 0x1,
	FoExtTypeIosbRange = 0x2,
	FoExtTypeGeneric = 0x3,
	FoExtTypeSfio = 0x4,
	FoExtTypeSymlink = 0x5,
	FoExtTypeOplockKey = 0x6,
	FoExtTypeSilo = 0x7,
	FoExtTypeMemoryPartitionInfo = 0x8,
	MaxFoExtTypes = 0x9
};

union _FILE_SEGMENT_ELEMENT {
	/*0000*/ void * Buffer;
	/*0000*/ ULONGLONG Alignment;
	/*0008*/
};

struct _FILE_STANDARD_INFORMATION {
	/*0000*/ _LARGE_INTEGER AllocationSize;
	/*0008*/ _LARGE_INTEGER EndOfFile;
	/*0010*/ ULONG NumberOfLinks;
	/*0014*/ UCHAR DeletePending;
	/*0015*/ UCHAR Directory;
	/*0018*/
};

struct _FIRMWARE_INFORMATION_LOADER_BLOCK {
	/*0000*/ ULONG FirmwareTypeUefi : 01; // 0x00000001;
	/*0000*/ ULONG EfiRuntimeUseIum : 01; // 0x00000002;
	/*0000*/ ULONG EfiRuntimePageProtectionSupported : 01; // 0x00000004;
	/*0000*/ ULONG Reserved : 29; // 0xfffffff8;
	union {
		/*0008*/ _EFI_FIRMWARE_INFORMATION EfiInformation;
		/*0008*/ _PCAT_FIRMWARE_INFORMATION PcatInformation;
		/*0040*/
	} u;
	/*0040*/
};

struct _FREE_DISPLAY {
	/*0000*/ ULONG RealVectorSize;
	/*0004*/ ULONG Hint;
	/*0008*/ _RTL_BITMAP Display;
	/*0018*/
};

enum _FSINFOCLASS {
	FileFsVolumeInformation = 0x1,
	FileFsLabelInformation = 0x2,
	FileFsSizeInformation = 0x3,
	FileFsDeviceInformation = 0x4,
	FileFsAttributeInformation = 0x5,
	FileFsControlInformation = 0x6,
	FileFsFullSizeInformation = 0x7,
	FileFsObjectIdInformation = 0x8,
	FileFsDriverPathInformation = 0x9,
	FileFsVolumeFlagsInformation = 0xa,
	FileFsSectorSizeInformation = 0xb,
	FileFsDataCopyInformation = 0xc,
	FileFsMetadataSizeInformation = 0xd,
	FileFsFullSizeInformationEx = 0xe,
	FileFsMaximumInformation = 0xf
};

struct _FSRTL_ADVANCED_FCB_HEADER {
	/*0000*/ SHORT NodeTypeCode;
	/*0002*/ SHORT NodeByteSize;
	/*0004*/ UCHAR Flags;
	/*0005*/ UCHAR IsFastIoPossible;
	/*0006*/ UCHAR Flags2;
	/*0007*/ UCHAR Reserved : 04; // 0x0f;
	/*0007*/ UCHAR Version : 04; // 0xf0;
	/*0008*/ _ERESOURCE * Resource;
	/*0010*/ _ERESOURCE * PagingIoResource;
	/*0018*/ _LARGE_INTEGER AllocationSize;
	/*0020*/ _LARGE_INTEGER FileSize;
	/*0028*/ _LARGE_INTEGER ValidDataLength;
	/*0030*/ _FAST_MUTEX * FastMutex;
	/*0038*/ _LIST_ENTRY FilterContexts;
	/*0048*/ _EX_PUSH_LOCK PushLock;
	/*0050*/ void * * FileContextSupportPointer;
	/*0058*/ void * Oplock;
	/*0058*/ void * ReservedForRemote;
	/*0060*/ void * ReservedContext;
	/*0068*/
};

struct _FS_FILTER_CALLBACKS {
	/*0000*/ ULONG SizeOfFsFilterCallbacks;
	/*0004*/ ULONG Reserved;
	/*0008*/ LONG (* PreAcquireForSectionSynchronization)( _FS_FILTER_CALLBACK_DATA * , void * * );
	/*0010*/ void (* PostAcquireForSectionSynchronization)( _FS_FILTER_CALLBACK_DATA * , LONG , void * );
	/*0018*/ LONG (* PreReleaseForSectionSynchronization)( _FS_FILTER_CALLBACK_DATA * , void * * );
	/*0020*/ void (* PostReleaseForSectionSynchronization)( _FS_FILTER_CALLBACK_DATA * , LONG , void * );
	/*0028*/ LONG (* PreAcquireForCcFlush)( _FS_FILTER_CALLBACK_DATA * , void * * );
	/*0030*/ void (* PostAcquireForCcFlush)( _FS_FILTER_CALLBACK_DATA * , LONG , void * );
	/*0038*/ LONG (* PreReleaseForCcFlush)( _FS_FILTER_CALLBACK_DATA * , void * * );
	/*0040*/ void (* PostReleaseForCcFlush)( _FS_FILTER_CALLBACK_DATA * , LONG , void * );
	/*0048*/ LONG (* PreAcquireForModifiedPageWriter)( _FS_FILTER_CALLBACK_DATA * , void * * );
	/*0050*/ void (* PostAcquireForModifiedPageWriter)( _FS_FILTER_CALLBACK_DATA * , LONG , void * );
	/*0058*/ LONG (* PreReleaseForModifiedPageWriter)( _FS_FILTER_CALLBACK_DATA * , void * * );
	/*0060*/ void (* PostReleaseForModifiedPageWriter)( _FS_FILTER_CALLBACK_DATA * , LONG , void * );
	/*0068*/ LONG (* PreQueryOpen)( _FS_FILTER_CALLBACK_DATA * , void * * );
	/*0070*/ void (* PostQueryOpen)( _FS_FILTER_CALLBACK_DATA * , LONG , void * );
	/*0078*/
};

struct _FS_FILTER_CALLBACK_DATA {
	/*0000*/ ULONG SizeOfFsFilterCallbackData;
	/*0004*/ UCHAR Operation;
	/*0005*/ UCHAR Reserved;
	/*0008*/ _DEVICE_OBJECT * DeviceObject;
	/*0010*/ _FILE_OBJECT * FileObject;
	/*0018*/ _FS_FILTER_PARAMETERS Parameters;
	/*0040*/
};

union _FS_FILTER_PARAMETERS {
	struct {
		/*0000*/ _LARGE_INTEGER * EndingOffset;
		/*0008*/ _ERESOURCE * * ResourceToRelease;
		/*0010*/
	} AcquireForModifiedPageWriter;
	struct {
		/*0000*/ _ERESOURCE * ResourceToRelease;
		/*0008*/
	} ReleaseForModifiedPageWriter;
	struct {
		/*0000*/ _FS_FILTER_SECTION_SYNC_TYPE SyncType;
		/*0004*/ ULONG PageProtection;
		/*0008*/ _FS_FILTER_SECTION_SYNC_OUTPUT * OutputInformation;
		/*0010*/
	} AcquireForSectionSynchronization;
	struct {
		/*0000*/ _IRP * Irp;
		/*0008*/ void * FileInformation;
		/*0010*/ ULONG * Length;
		/*0018*/ _FILE_INFORMATION_CLASS FileInformationClass;
		/*001c*/ LONG CompletionStatus;
		/*0020*/
	} QueryOpen;
	struct {
		/*0000*/ void * Argument1;
		/*0008*/ void * Argument2;
		/*0010*/ void * Argument3;
		/*0018*/ void * Argument4;
		/*0020*/ void * Argument5;
		/*0028*/
	} Others;
	/*0028*/
};

struct _FS_FILTER_SECTION_SYNC_OUTPUT {
	/*0000*/ ULONG StructureSize;
	/*0004*/ ULONG SizeReturned;
	/*0008*/ ULONG Flags;
	/*000c*/ ULONG DesiredReadAlignment;
	/*0010*/
};

enum _FS_FILTER_SECTION_SYNC_TYPE {
	SyncTypeOther = 0x0,
	SyncTypeCreateSection = 0x1
};

enum _FUNCTION_TABLE_TYPE {
	RF_SORTED = 0x0,
	RF_UNSORTED = 0x1,
	RF_CALLBACK = 0x2,
	RF_KERNEL_DYNAMIC = 0x3
};

struct _GDI_TEB_BATCH {
	/*0000*/ ULONG Offset : 31; // 0x7fffffff;
	/*0000*/ ULONG HasRenderingCommand : 01; // 0x80000000;
	/*0008*/ ULONGLONG HDC;
	/*0010*/ ULONG Buffer[0x136];
	/*04e8*/
};

struct _GDI_TEB_BATCH32 {
	/*0000*/ ULONG Offset : 31; // 0x7fffffff;
	/*0000*/ ULONG HasRenderingCommand : 01; // 0x80000000;
	/*0004*/ ULONG HDC;
	/*0008*/ ULONG Buffer[0x136];
	/*04e0*/
};

struct _GDI_TEB_BATCH64 {
	/*0000*/ ULONG Offset : 31; // 0x7fffffff;
	/*0000*/ ULONG HasRenderingCommand : 01; // 0x80000000;
	/*0008*/ ULONGLONG HDC;
	/*0010*/ ULONG Buffer[0x136];
	/*04e8*/
};

struct _GENERAL_LOOKASIDE {
	/*0000*/ _SLIST_HEADER ListHead;
	/*0000*/ _SINGLE_LIST_ENTRY SingleListHead;
	/*0010*/ USHORT Depth;
	/*0012*/ USHORT MaximumDepth;
	/*0014*/ ULONG TotalAllocates;
	/*0018*/ ULONG AllocateMisses;
	/*0018*/ ULONG AllocateHits;
	/*001c*/ ULONG TotalFrees;
	/*0020*/ ULONG FreeMisses;
	/*0020*/ ULONG FreeHits;
	/*0024*/ _POOL_TYPE Type;
	/*0028*/ ULONG Tag;
	/*002c*/ ULONG Size;
	/*0030*/ void * (* AllocateEx)( _POOL_TYPE , ULONGLONG , ULONG , _LOOKASIDE_LIST_EX * );
	/*0030*/ void * (* Allocate)( _POOL_TYPE , ULONGLONG , ULONG );
	/*0038*/ void (* FreeEx)( void * , _LOOKASIDE_LIST_EX * );
	/*0038*/ void (* Free)( void * );
	/*0040*/ _LIST_ENTRY ListEntry;
	/*0050*/ ULONG LastTotalAllocates;
	/*0054*/ ULONG LastAllocateMisses;
	/*0054*/ ULONG LastAllocateHits;
	/*0058*/ ULONG Future[0x2];
	/*0080*/
};

struct _GENERAL_LOOKASIDE_POOL {
	/*0000*/ _SLIST_HEADER ListHead;
	/*0000*/ _SINGLE_LIST_ENTRY SingleListHead;
	/*0010*/ USHORT Depth;
	/*0012*/ USHORT MaximumDepth;
	/*0014*/ ULONG TotalAllocates;
	/*0018*/ ULONG AllocateMisses;
	/*0018*/ ULONG AllocateHits;
	/*001c*/ ULONG TotalFrees;
	/*0020*/ ULONG FreeMisses;
	/*0020*/ ULONG FreeHits;
	/*0024*/ _POOL_TYPE Type;
	/*0028*/ ULONG Tag;
	/*002c*/ ULONG Size;
	/*0030*/ void * (* AllocateEx)( _POOL_TYPE , ULONGLONG , ULONG , _LOOKASIDE_LIST_EX * );
	/*0030*/ void * (* Allocate)( _POOL_TYPE , ULONGLONG , ULONG );
	/*0038*/ void (* FreeEx)( void * , _LOOKASIDE_LIST_EX * );
	/*0038*/ void (* Free)( void * );
	/*0040*/ _LIST_ENTRY ListEntry;
	/*0050*/ ULONG LastTotalAllocates;
	/*0054*/ ULONG LastAllocateMisses;
	/*0054*/ ULONG LastAllocateHits;
	/*0058*/ ULONG Future[0x2];
	/*0060*/
};

struct _GENERIC_MAPPING {
	/*0000*/ ULONG GenericRead;
	/*0004*/ ULONG GenericWrite;
	/*0008*/ ULONG GenericExecute;
	/*000c*/ ULONG GenericAll;
	/*0010*/
};

enum _GPIO_PIN_CONFIG_TYPE {
	PullDefault = 0x0,
	PullUp = 0x1,
	PullDown = 0x2,
	PullNone = 0x3
};

enum _GPIO_PIN_IORESTRICTION_TYPE {
	IoRestrictionNone = 0x0,
	IoRestrictionInputOnly = 0x1,
	IoRestrictionOutputOnly = 0x2,
	IoRestrictionNoneAndPreserve = 0x3
};

struct _GROUP_AFFINITY {
	/*0000*/ ULONGLONG Mask;
	/*0008*/ USHORT Group;
	/*000a*/ USHORT Reserved[0x3];
	/*0010*/
};

struct _GUID {
	/*0000*/ ULONG Data1;
	/*0004*/ USHORT Data2;
	/*0006*/ USHORT Data3;
	/*0008*/ UCHAR Data4[0x8];
	/*0010*/
};

struct _HAL_CHANNEL_MEMORY_RANGES {
	/*0000*/ ULONGLONG PageFrameIndex;
	/*0008*/ USHORT MpnId;
	/*000a*/ USHORT Node;
	/*000c*/ USHORT Channel;
	/*000e*/ UCHAR IsPowerManageable;
	/*000f*/ UCHAR DeepPowerState;
	/*0010*/
};

struct _HAL_CLOCK_TIMER_CONFIGURATION {
	/*0000*/ UCHAR Flags;
	/*0000*/ UCHAR AlwaysOnTimer : 01; // 0x01;
	/*0000*/ UCHAR HighLatency : 01; // 0x02;
	/*0000*/ UCHAR PerCpuTimer : 01; // 0x04;
	/*0000*/ UCHAR DynamicTickSupported : 01; // 0x08;
	/*0004*/ ULONG KnownType;
	/*0008*/ ULONG Capabilities;
	/*0010*/ ULONGLONG MaxIncrement;
	/*0018*/ ULONG MinIncrement;
	/*0020*/
};

enum _HAL_CLOCK_TIMER_MODE {
	HalClockTimerModePeriodic = 0x0,
	HalClockTimerModeOneShot = 0x1,
	HalClockTimerModeMax = 0x2
};

struct _HAL_DP_REPLACE_PARAMETERS {
	/*0000*/ ULONG Flags;
	/*0008*/ _PNP_REPLACE_PROCESSOR_LIST * TargetProcessors;
	/*0010*/ _PNP_REPLACE_PROCESSOR_LIST * SpareProcessors;
	/*0018*/
};

struct _HAL_HV_DMA_DOMAIN_INFO {
	/*0000*/ ULONG DomainId;
	/*0004*/ UCHAR IsStage1;
	/*0008*/
};

struct _HAL_HV_SVM_DEVICE_CAPABILITIES {
	/*0000*/ ULONG SvmSupported : 01; // 0x00000001;
	/*0000*/ ULONG PciExecute : 01; // 0x00000002;
	/*0000*/ ULONG NoExecute : 01; // 0x00000004;
	/*0000*/ ULONG Reserved : 28; // 0x7ffffff8;
	/*0000*/ ULONG OverflowPossible : 01; // 0x80000000;
	/*0004*/ ULONG PasidCount;
	/*0008*/ ULONG IommuIndex;
	/*000c*/
};

struct _HAL_HV_SVM_SYSTEM_CAPABILITIES {
	/*0000*/ ULONG SvmSupported : 01; // 0x00000001;
	/*0000*/ ULONG GpaAlwaysValid : 01; // 0x00000002;
	/*0004*/ ULONG MaxPasidSpaceCount;
	/*0008*/ ULONG MaxPasidSpacePasidCount;
	/*000c*/ ULONG MaxPrqSize;
	/*0010*/ ULONG IommuCount;
	/*0014*/ ULONG MinIommuPasidCount;
	/*0018*/
};

struct _HAL_INTEL_ENLIGHTENMENT_INFORMATION {
	/*0000*/ ULONG Enlightenments;
	/*0004*/ ULONG HypervisorConnected;
	/*0008*/ void (* EndOfInterrupt)();
	/*0010*/ void (* ApicWriteIcr)( ULONG , ULONG );
	/*0018*/ ULONG Reserved0;
	/*001c*/ ULONG SpinCountMask;
	/*0020*/ void (* LongSpinWait)( ULONG );
	/*0028*/ ULONGLONG (* GetReferenceTime)();
	/*0030*/ LONG (* SetSystemSleepProperty)( UINT , UCHAR , UCHAR );
	/*0038*/ LONG (* EnterSleepState)( UINT );
	/*0040*/ LONG (* NotifyDebugDeviceAvailable)();
	/*0048*/ LONG (* MapDeviceInterrupt)( ULONGLONG , void * , _GROUP_AFFINITY * , void * );
	/*0050*/ LONG (* UnmapDeviceInterrupt)( ULONGLONG , void * );
	/*0058*/ LONG (* RetargetDeviceInterrupt)( ULONGLONG , void * , void * , _GROUP_AFFINITY * , void * );
	/*0060*/ LONG (* SetHpetConfig)( _LARGE_INTEGER , ULONG , ULONGLONG , UCHAR , void * );
	/*0068*/ LONG (* NotifyHpetEnabled)();
	/*0070*/ LONG (* QueryAssociatedProcessors)( ULONG , ULONG * , ULONG * );
	/*0078*/ LONG (* ReadMultipleMsr)( ULONG , ULONG , ULONG * , ULONGLONG * );
	/*0080*/ LONG (* WriteMultipleMsr)( ULONG , ULONG , ULONG * , ULONGLONG * );
	/*0088*/ LONG (* ReadCpuid)( ULONG , ULONG , ULONG * , ULONG * , ULONG * , ULONG * );
	/*0090*/ LONG (* LpWritebackInvalidate)( ULONG );
	/*0098*/ LONG (* GetMachineCheckContext)( ULONG , UINT * , ULONGLONG * , UINT * );
	/*00a0*/ LONG (* SuspendPartition)( ULONGLONG );
	/*00a8*/ LONG (* ResumePartition)( ULONGLONG );
	/*00b0*/ LONG (* SetSystemMachineCheckProperty)( void * );
	/*00b8*/ LONG (* WheaErrorNotification)( _WHEA_RECOVERY_CONTEXT * , UCHAR , UCHAR );
	/*00c0*/ ULONG (* GetProcessorIndexFromVpIndex)( ULONG );
	/*00c8*/ LONG (* SyntheticClusterIpi)( _KAFFINITY_EX * , ULONG );
	/*00d0*/ UCHAR (* VpStartEnabled)();
	/*00d8*/ LONG (* StartVirtualProcessor)( ULONG , void * );
	/*00e0*/ LONG (* GetVpIndexFromApicId)( ULONG , ULONG * );
	/*00e8*/ LONG (* IumAccessPciDevice)( UCHAR , ULONG , ULONG , ULONG , ULONG , ULONG , ULONG , void * );
	/*00f0*/ ULONGLONG (* IumEfiRuntimeService)( ULONG , void * , ULONGLONG , ULONGLONG * );
	/*00f8*/ void (* SvmGetSystemCapabilities)( _HAL_HV_SVM_SYSTEM_CAPABILITIES * );
	/*0100*/ LONG (* SvmGetDeviceCapabilities)( ULONG , _HAL_HV_SVM_DEVICE_CAPABILITIES * );
	/*0108*/ LONG (* SvmCreatePasidSpace)( ULONG , ULONG );
	/*0110*/ LONG (* SvmSetPasidAddressSpace)( ULONG , ULONG , ULONGLONG );
	/*0118*/ void (* SvmFlushPasid)( ULONG , ULONG , ULONG , _KTB_FLUSH_VA * );
	/*0120*/ LONG (* SvmAttachPasidSpace)( ULONG , ULONG , ULONG , ULONG );
	/*0128*/ LONG (* SvmDetachPasidSpace)( ULONG );
	/*0130*/ LONG (* SvmEnablePasid)( ULONG , ULONG );
	/*0138*/ LONG (* SvmDisablePasid)( ULONG , ULONG );
	/*0140*/ LONG (* SvmAcknowledgePageRequest)( ULONG , void * , ULONG * );
	/*0148*/ LONG (* SvmCreatePrQueue)( ULONG , ULONG , _LARGE_INTEGER , ULONG , ULONG );
	/*0150*/ LONG (* SvmDeletePrQueue)( ULONG );
	/*0158*/ LONG (* SvmClearPrqStalled)( ULONG );
	/*0160*/ LONG (* SvmSetDeviceEnabled)( ULONG , UCHAR );
	/*0168*/ LONG (* HvDebuggerPowerHandler)( UCHAR );
	/*0170*/ LONG (* SetQpcBias)( ULONGLONG );
	/*0178*/ ULONGLONG (* GetQpcBias)();
	/*0180*/ LONG (* RegisterDeviceId)( _EXT_IOMMU_DEVICE_ID * , ULONGLONG );
	/*0188*/ LONG (* UnregisterDeviceId)( ULONGLONG );
	/*0190*/ LONG (* AllocateDeviceDomain)( _HAL_HV_DMA_DOMAIN_INFO * );
	/*0198*/ LONG (* AttachDeviceDomain)( _EXT_IOMMU_DEVICE_ID * , _HAL_HV_DMA_DOMAIN_INFO * );
	/*01a0*/ LONG (* DetachDeviceDomain)( ULONGLONG );
	/*01a8*/ LONG (* DeleteDeviceDomain)( _HAL_HV_DMA_DOMAIN_INFO * );
	/*01b0*/ LONG (* MapDeviceLogicalRange)( _HAL_HV_DMA_DOMAIN_INFO * , ULONG , ULONGLONG , ULONGLONG * , ULONGLONG * , UCHAR );
	/*01b8*/ LONG (* UnmapDeviceLogicalRange)( _HAL_HV_DMA_DOMAIN_INFO * , ULONGLONG , ULONGLONG * );
	/*01c0*/ LONG (* MapDeviceSparsePages)( _HAL_HV_DMA_DOMAIN_INFO * , ULONG , ULONGLONG * , ULONGLONG * );
	/*01c8*/ LONG (* UnmapDeviceSparsePages)( _HAL_HV_DMA_DOMAIN_INFO * , ULONGLONG * , ULONGLONG * );
	/*01d0*/ LONG (* GetDmaGuardEnabled)( UCHAR * );
	/*01d8*/ LONG (* UpdateMicrocode)( void * , UINT );
	/*01e0*/
};

struct _HAL_IOMMU_DISPATCH {
	/*0000*/ UCHAR (* HalIommuSupportEnabled)();
	/*0008*/ LONG (* HalIommuGetConfiguration)( ULONG , ULONG * , ULONG * , void * * );
	/*0010*/ LONG (* HalIommuGetLibraryContext)( ULONG , ULONG , void * * );
	/*0018*/ LONG (* HalIommuMapDevice)( void * , _EXT_IOMMU_DEVICE_ID * , _IOMMU_SVM_CAPABILITIES * , void * * );
	/*0020*/ LONG (* HalIommuEnableDevicePasid)( void * , void * );
	/*0028*/ LONG (* HalIommuSetAddressSpace)( void * , ULONGLONG );
	/*0030*/ LONG (* HalIommuDisableDevicePasid)( void * , void * );
	/*0038*/ LONG (* HalIommuUnmapDevice)( void * , void * );
	/*0040*/ LONG (* HalIommuFreeLibraryContext)( void * );
	/*0048*/ void (* HalIommuFlushTb)( void * , ULONG , _KTB_FLUSH_VA * );
	/*0050*/ void (* HalIommuFlushAllPasid)( void * , ULONG , _KTB_FLUSH_VA * );
	/*0058*/ UCHAR (* HalIommuProcessPageRequestQueue)( ULONG );
	/*0060*/ void (* HalIommuFaultRoutine)( ULONG );
	/*0068*/ void * (* HalIommuReferenceAsid)( ULONG );
	/*0070*/ void (* HalIommuDereferenceAsid)( ULONG );
	/*0078*/ LONG (* HalIommuServicePageFault)( ULONGLONG , void * , ULONG );
	/*0080*/ LONG (* HalIommuDevicePowerChange)( void * , void * , UCHAR );
	/*0088*/ LONG (* HalIommuBeginDeviceReset)( void * , ULONG * );
	/*0090*/ LONG (* HalIommuFinalizeDeviceReset)( void * );
	/*0098*/
};

struct _HAL_LBR_ENTRY {
	/*0000*/ void * FromAddress;
	/*0008*/ void * ToAddress;
	/*0010*/ void * Reserved;
	/*0018*/
};

struct _HAL_LOG_REGISTER_CONTEXT {
	/*0000*/ void (* LogRoutine)( ULONG , void * , ULONG );
	/*0008*/ ULONG Flag;
	/*0010*/
};

struct _HAL_NODE_RANGE {
	/*0000*/ ULONGLONG PageFrameIndex;
	/*0008*/ ULONG Node;
	/*0010*/
};

struct _HAL_PMC_COUNTERS;

enum _HAL_PROCESSOR_STAT_TYPE {
	HalProcessorStatResidency = 0x0,
	HalProcessorStatCount = 0x1,
	HalProcessorStatMax = 0x2
};

union _HAL_UNMASKED_INTERRUPT_FLAGS {
	/*0000*/ USHORT SecondaryInterrupt : 01; // 0x0001;
	/*0000*/ USHORT Reserved : 15; // 0xfffe;
	/*0000*/ USHORT AsUSHORT;
	/*0002*/
};

struct _HAL_UNMASKED_INTERRUPT_INFORMATION {
	/*0000*/ USHORT Version;
	/*0002*/ USHORT Size;
	/*0004*/ _HAL_UNMASKED_INTERRUPT_FLAGS Flags;
	/*0008*/ _KINTERRUPT_MODE Mode;
	/*000c*/ _KINTERRUPT_POLARITY Polarity;
	/*0010*/ ULONG Gsiv;
	/*0014*/ USHORT PinNumber;
	/*0018*/ void * DeviceHandle;
	/*0020*/
};

struct _HANDLE_REVOCATION_INFO {
	/*0000*/ _LIST_ENTRY ListEntry;
	/*0010*/ _OB_HANDLE_REVOCATION_BLOCK * RevocationBlock;
	/*0018*/ UCHAR AllowHandleRevocation;
	/*0019*/ UCHAR Padding1[0x3];
	/*001c*/ UCHAR Padding2[0x4];
	/*0020*/
};

struct _HANDLE_TABLE {
	/*0000*/ ULONG NextHandleNeedingPool;
	/*0004*/ LONG ExtraInfoPages;
	/*0008*/ ULONGLONG volatile TableCode;
	/*0010*/ _EPROCESS * QuotaProcess;
	/*0018*/ _LIST_ENTRY HandleTableList;
	/*0028*/ ULONG UniqueProcessId;
	/*002c*/ ULONG Flags;
	/*002c*/ UCHAR StrictFIFO : 01; // 0x01;
	/*002c*/ UCHAR EnableHandleExceptions : 01; // 0x02;
	/*002c*/ UCHAR Rundown : 01; // 0x04;
	/*002c*/ UCHAR Duplicated : 01; // 0x08;
	/*002c*/ UCHAR RaiseUMExceptionOnInvalidHandleClose : 01; // 0x10;
	/*0030*/ _EX_PUSH_LOCK HandleContentionEvent;
	/*0038*/ _EX_PUSH_LOCK HandleTableLock;
	/*0040*/ _HANDLE_TABLE_FREE_LIST FreeLists[0x1];
	/*0040*/ UCHAR ActualEntry[0x20];
	/*0060*/ _HANDLE_TRACE_DEBUG_INFO * DebugInfo;
	/*0080*/
};

union _HANDLE_TABLE_ENTRY {
	/*0000*/ LONGLONG volatile VolatileLowValue;
	/*0000*/ LONGLONG LowValue;
	/*0000*/ _HANDLE_TABLE_ENTRY_INFO * volatile InfoTable;
	/*0008*/ LONGLONG HighValue;
	/*0008*/ _HANDLE_TABLE_ENTRY * NextFreeHandleEntry;
	/*0008*/ _EXHANDLE LeafHandleValue;
	/*0000*/ LONGLONG RefCountField;
	/*0000*/ ULONGLONG Unlocked : 01; // 0x0000000000000001;
	/*0000*/ ULONGLONG RefCnt : 16; // 0x000000000001fffe;
	/*0000*/ ULONGLONG Attributes : 03; // 0x00000000000e0000;
	/*0000*/ ULONGLONG ObjectPointerBits : 44; // 0xfffffffffff00000;
	/*0008*/ ULONG GrantedAccessBits : 25; // 0x01ffffff;
	/*0008*/ ULONG NoRightsUpgrade : 01; // 0x02000000;
	/*0008*/ ULONG Spare1 : 06; // 0xfc000000;
	/*000c*/ ULONG Spare2;
	/*0010*/
};

struct _HANDLE_TABLE_ENTRY_INFO {
	/*0000*/ ULONG AuditMask;
	/*0004*/ ULONG MaxRelativeAccessMask;
	/*0008*/
};

struct _HANDLE_TABLE_FREE_LIST {
	/*0000*/ _EX_PUSH_LOCK FreeListLock;
	/*0008*/ _HANDLE_TABLE_ENTRY * FirstFreeHandleEntry;
	/*0010*/ _HANDLE_TABLE_ENTRY * LastFreeHandleEntry;
	/*0018*/ LONG HandleCount;
	/*001c*/ ULONG HighWaterMark;
	/*0040*/
};

struct _HANDLE_TRACE_DB_ENTRY {
	/*0000*/ _CLIENT_ID ClientId;
	/*0010*/ void * Handle;
	/*0018*/ ULONG Type;
	/*0020*/ void * StackTrace[0x10];
	/*00a0*/
};

struct _HANDLE_TRACE_DEBUG_INFO {
	/*0000*/ LONG RefCount;
	/*0004*/ ULONG TableSize;
	/*0008*/ ULONG BitMaskFlags;
	/*0010*/ _FAST_MUTEX CloseCompactionLock;
	/*0048*/ ULONG CurrentStackIndex;
	/*0050*/ _HANDLE_TRACE_DB_ENTRY TraceDb[0x1];
	/*00f0*/
};

enum _HARDWARE_COUNTER_TYPE {
	PMCCounter = 0x0,
	MaxHardwareCounterType = 0x1
};

struct _HARDWARE_PTE {
	/*0000*/ ULONGLONG Valid : 01; // 0x0000000000000001;
	/*0000*/ ULONGLONG Write : 01; // 0x0000000000000002;
	/*0000*/ ULONGLONG Owner : 01; // 0x0000000000000004;
	/*0000*/ ULONGLONG WriteThrough : 01; // 0x0000000000000008;
	/*0000*/ ULONGLONG CacheDisable : 01; // 0x0000000000000010;
	/*0000*/ ULONGLONG Accessed : 01; // 0x0000000000000020;
	/*0000*/ ULONGLONG Dirty : 01; // 0x0000000000000040;
	/*0000*/ ULONGLONG LargePage : 01; // 0x0000000000000080;
	/*0000*/ ULONGLONG Global : 01; // 0x0000000000000100;
	/*0000*/ ULONGLONG CopyOnWrite : 01; // 0x0000000000000200;
	/*0000*/ ULONGLONG Prototype : 01; // 0x0000000000000400;
	/*0000*/ ULONGLONG reserved0 : 01; // 0x0000000000000800;
	/*0000*/ ULONGLONG PageFrameNumber : 36; // 0x0000fffffffff000;
	/*0000*/ ULONGLONG reserved1 : 04; // 0x000f000000000000;
	/*0000*/ ULONGLONG SoftwareWsIndex : 11; // 0x7ff0000000000000;
	/*0000*/ ULONGLONG NoExecute : 01; // 0x8000000000000000;
	/*0008*/
};

struct _HBASE_BLOCK {
	/*0000*/ ULONG Signature;
	/*0004*/ ULONG Sequence1;
	/*0008*/ ULONG Sequence2;
	/*000c*/ _LARGE_INTEGER TimeStamp;
	/*0014*/ ULONG Major;
	/*0018*/ ULONG Minor;
	/*001c*/ ULONG Type;
	/*0020*/ ULONG Format;
	/*0024*/ ULONG RootCell;
	/*0028*/ ULONG Length;
	/*002c*/ ULONG Cluster;
	/*0030*/ UCHAR FileName[0x40];
	/*0070*/ _GUID RmId;
	/*0080*/ _GUID LogId;
	/*0090*/ ULONG Flags;
	/*0094*/ _GUID TmId;
	/*00a4*/ ULONG GuidSignature;
	/*00a8*/ ULONGLONG LastReorganizeTime;
	/*00b0*/ ULONG Reserved1[0x53];
	/*01fc*/ ULONG CheckSum;
	/*0200*/ ULONG Reserved2[0x372];
	/*0fc8*/ _GUID ThawTmId;
	/*0fd8*/ _GUID ThawRmId;
	/*0fe8*/ _GUID ThawLogId;
	/*0ff8*/ ULONG BootType;
	/*0ffc*/ ULONG BootRecover;
	/*1000*/
};

struct _HBIN {
	/*0000*/ ULONG Signature;
	/*0004*/ ULONG FileOffset;
	/*0008*/ ULONG Size;
	/*000c*/ ULONG Reserved1[0x2];
	/*0014*/ _LARGE_INTEGER TimeStamp;
	/*001c*/ ULONG Spare;
	/*0020*/
};

struct _HCELL {
	/*0000*/ LONG Size;
	union {
		struct {
			union {
				/*0004*/ ULONG UserData;
				/*0004*/ ULONG Next;
				/*0008*/
			} u;
			/*0008*/
		} NewCell;
		/*0008*/
	} u;
	/*0008*/
};

struct _HEADLESS_LOADER_BLOCK {
	/*0000*/ UCHAR UsedBiosSettings;
	/*0001*/ UCHAR DataBits;
	/*0002*/ UCHAR StopBits;
	/*0003*/ UCHAR Parity;
	/*0004*/ ULONG BaudRate;
	/*0008*/ ULONG PortNumber;
	/*0010*/ UCHAR * PortAddress;
	/*0018*/ USHORT PciDeviceId;
	/*001a*/ USHORT PciVendorId;
	/*001c*/ UCHAR PciBusNumber;
	/*001e*/ USHORT PciBusSegment;
	/*0020*/ UCHAR PciSlotNumber;
	/*0021*/ UCHAR PciFunctionNumber;
	/*0024*/ ULONG PciFlags;
	/*0028*/ _GUID SystemGUID;
	/*0038*/ UCHAR IsMMIODevice;
	/*0039*/ UCHAR TerminalType;
	/*003a*/ UCHAR InterfaceType;
	/*003b*/ UCHAR RegisterBitWidth;
	/*003c*/ UCHAR RegisterAccessSize;
	/*0040*/
};

struct _HEAP {
	/*0000*/ _HEAP_SEGMENT Segment;
	/*0000*/ _HEAP_ENTRY Entry;
	/*0010*/ ULONG SegmentSignature;
	/*0014*/ ULONG SegmentFlags;
	/*0018*/ _LIST_ENTRY SegmentListEntry;
	/*0028*/ _HEAP * Heap;
	/*0030*/ void * BaseAddress;
	/*0038*/ ULONG NumberOfPages;
	/*0040*/ _HEAP_ENTRY * FirstEntry;
	/*0048*/ _HEAP_ENTRY * LastValidEntry;
	/*0050*/ ULONG NumberOfUnCommittedPages;
	/*0054*/ ULONG NumberOfUnCommittedRanges;
	/*0058*/ USHORT SegmentAllocatorBackTraceIndex;
	/*005a*/ USHORT Reserved;
	/*0060*/ _LIST_ENTRY UCRSegmentList;
	/*0070*/ ULONG Flags;
	/*0074*/ ULONG ForceFlags;
	/*0078*/ ULONG CompatibilityFlags;
	/*007c*/ ULONG EncodeFlagMask;
	/*0080*/ _HEAP_ENTRY Encoding;
	/*0090*/ ULONG Interceptor;
	/*0094*/ ULONG VirtualMemoryThreshold;
	/*0098*/ ULONG Signature;
	/*00a0*/ ULONGLONG SegmentReserve;
	/*00a8*/ ULONGLONG SegmentCommit;
	/*00b0*/ ULONGLONG DeCommitFreeBlockThreshold;
	/*00b8*/ ULONGLONG DeCommitTotalFreeThreshold;
	/*00c0*/ ULONGLONG TotalFreeSize;
	/*00c8*/ ULONGLONG MaximumAllocationSize;
	/*00d0*/ USHORT ProcessHeapsListIndex;
	/*00d2*/ USHORT HeaderValidateLength;
	/*00d8*/ void * HeaderValidateCopy;
	/*00e0*/ USHORT NextAvailableTagIndex;
	/*00e2*/ USHORT MaximumTagIndex;
	/*00e8*/ _HEAP_TAG_ENTRY * TagEntries;
	/*00f0*/ _LIST_ENTRY UCRList;
	/*0100*/ ULONGLONG AlignRound;
	/*0108*/ ULONGLONG AlignMask;
	/*0110*/ _LIST_ENTRY VirtualAllocdBlocks;
	/*0120*/ _LIST_ENTRY SegmentList;
	/*0130*/ USHORT AllocatorBackTraceIndex;
	/*0134*/ ULONG NonDedicatedListLength;
	/*0138*/ void * BlocksIndex;
	/*0140*/ void * UCRIndex;
	/*0148*/ _HEAP_PSEUDO_TAG_ENTRY * PseudoTagEntries;
	/*0150*/ _LIST_ENTRY FreeLists;
	/*0160*/ _HEAP_LOCK * LockVariable;
	/*0168*/ LONG (* CommitRoutine)( void * , void * * , ULONGLONG * );
	/*0170*/ _RTL_RUN_ONCE StackTraceInitVar;
	/*0178*/ _RTL_HEAP_MEMORY_LIMIT_DATA CommitLimitData;
	/*0198*/ void * FrontEndHeap;
	/*01a0*/ USHORT FrontHeapLockCount;
	/*01a2*/ UCHAR FrontEndHeapType;
	/*01a3*/ UCHAR RequestedFrontEndHeapType;
	/*01a8*/ WCHAR * FrontEndHeapUsageData;
	/*01b0*/ USHORT FrontEndHeapMaximumIndex;
	/*01b2*/ UCHAR volatile FrontEndHeapStatusBitmap[0x81];
	/*0238*/ _HEAP_COUNTERS Counters;
	/*02b0*/ _HEAP_TUNING_PARAMETERS TuningParameters;
	/*02c0*/
};

struct _HEAP_COUNTERS {
	/*0000*/ ULONGLONG TotalMemoryReserved;
	/*0008*/ ULONGLONG TotalMemoryCommitted;
	/*0010*/ ULONGLONG TotalMemoryLargeUCR;
	/*0018*/ ULONGLONG TotalSizeInVirtualBlocks;
	/*0020*/ ULONG TotalSegments;
	/*0024*/ ULONG TotalUCRs;
	/*0028*/ ULONG CommittOps;
	/*002c*/ ULONG DeCommitOps;
	/*0030*/ ULONG LockAcquires;
	/*0034*/ ULONG LockCollisions;
	/*0038*/ ULONG CommitRate;
	/*003c*/ ULONG DecommittRate;
	/*0040*/ ULONG CommitFailures;
	/*0044*/ ULONG InBlockCommitFailures;
	/*0048*/ ULONG PollIntervalCounter;
	/*004c*/ ULONG DecommitsSinceLastCheck;
	/*0050*/ ULONG HeapPollInterval;
	/*0054*/ ULONG AllocAndFreeOps;
	/*0058*/ ULONG AllocationIndicesActive;
	/*005c*/ ULONG InBlockDeccommits;
	/*0060*/ ULONGLONG InBlockDeccomitSize;
	/*0068*/ ULONGLONG HighWatermarkSize;
	/*0070*/ ULONGLONG LastPolledSize;
	/*0078*/
};

struct _HEAP_DESCRIPTOR_KEY {
	/*0000*/ ULONG Key;
	/*0000*/ ULONG EncodedCommittedPageCount : 16; // 0x0000ffff;
	/*0000*/ ULONG LargePageCost : 08; // 0x00ff0000;
	/*0000*/ ULONG UnitCount : 08; // 0xff000000;
	/*0004*/
};

struct _HEAP_ENTRY {
	/*0000*/ _HEAP_UNPACKED_ENTRY UnpackedEntry;
	/*0000*/ void * PreviousBlockPrivateData;
	/*0008*/ USHORT Size;
	/*000a*/ UCHAR Flags;
	/*000b*/ UCHAR SmallTagIndex;
	/*0008*/ ULONG SubSegmentCode;
	/*000c*/ USHORT PreviousSize;
	/*000e*/ UCHAR SegmentOffset;
	/*000e*/ UCHAR LFHFlags;
	/*000f*/ UCHAR UnusedBytes;
	/*0008*/ ULONGLONG CompactHeader;
	/*0000*/ _HEAP_EXTENDED_ENTRY ExtendedEntry;
	/*0000*/ void * Reserved;
	/*0008*/ USHORT FunctionIndex;
	/*000a*/ USHORT ContextValue;
	/*0008*/ ULONG InterceptorValue;
	/*000c*/ USHORT UnusedBytesLength;
	/*000e*/ UCHAR EntryOffset;
	/*000f*/ UCHAR ExtendedBlockSignature;
	/*0000*/ void * ReservedForAlignment;
	/*0008*/ ULONG Code1;
	/*000c*/ USHORT Code2;
	/*000e*/ UCHAR Code3;
	/*000f*/ UCHAR Code4;
	/*000c*/ ULONG Code234;
	/*0008*/ ULONGLONG AgregateCode;
	/*0010*/
};

struct _HEAP_ENTRY_EXTRA {
	/*0000*/ USHORT AllocatorBackTraceIndex;
	/*0002*/ USHORT TagIndex;
	/*0008*/ ULONGLONG Settable;
	/*0000*/ ULONGLONG ZeroInit;
	/*0008*/ ULONGLONG ZeroInit1;
	/*0010*/
};

struct _HEAP_EXTENDED_ENTRY {
	/*0000*/ void * Reserved;
	/*0008*/ USHORT FunctionIndex;
	/*000a*/ USHORT ContextValue;
	/*0008*/ ULONG InterceptorValue;
	/*000c*/ USHORT UnusedBytesLength;
	/*000e*/ UCHAR EntryOffset;
	/*000f*/ UCHAR ExtendedBlockSignature;
	/*0010*/
};

struct _HEAP_FAILURE_INFORMATION {
	/*0000*/ ULONG Version;
	/*0004*/ ULONG StructureSize;
	/*0008*/ _HEAP_FAILURE_TYPE FailureType;
	/*0010*/ void * HeapAddress;
	/*0018*/ void * Address;
	/*0020*/ void * Param1;
	/*0028*/ void * Param2;
	/*0030*/ void * Param3;
	/*0038*/ void * PreviousBlock;
	/*0040*/ void * NextBlock;
	/*0048*/ _FAKE_HEAP_ENTRY ExpectedDecodedEntry;
	/*0058*/ void * StackTrace[0x20];
	/*0158*/ UCHAR HeapMajorVersion;
	/*0159*/ UCHAR HeapMinorVersion;
	/*0160*/ _EXCEPTION_RECORD ExceptionRecord;
	/*0200*/ _CONTEXT ContextRecord;
	/*06d0*/
};

enum _HEAP_FAILURE_TYPE {
	heap_failure_internal = 0x0,
	heap_failure_unknown = 0x1,
	heap_failure_generic = 0x2,
	heap_failure_entry_corruption = 0x3,
	heap_failure_multiple_entries_corruption = 0x4,
	heap_failure_virtual_block_corruption = 0x5,
	heap_failure_buffer_overrun = 0x6,
	heap_failure_buffer_underrun = 0x7,
	heap_failure_block_not_busy = 0x8,
	heap_failure_invalid_argument = 0x9,
	heap_failure_invalid_allocation_type = 0xa,
	heap_failure_usage_after_free = 0xb,
	heap_failure_cross_heap_operation = 0xc,
	heap_failure_freelists_corruption = 0xd,
	heap_failure_listentry_corruption = 0xe,
	heap_failure_lfh_bitmap_mismatch = 0xf,
	heap_failure_segment_lfh_bitmap_corruption = 0x10,
	heap_failure_segment_lfh_double_free = 0x11,
	heap_failure_vs_subsegment_corruption = 0x12,
	heap_failure_null_heap = 0x13,
	heap_failure_allocation_limit = 0x14,
	heap_failure_commit_limit = 0x15,
	heap_failure_invalid_va_mgr_query = 0x16
};

struct _HEAP_FREE_ENTRY {
	/*0000*/ _HEAP_ENTRY HeapEntry;
	/*0000*/ _HEAP_UNPACKED_ENTRY UnpackedEntry;
	/*0000*/ void * PreviousBlockPrivateData;
	/*0008*/ USHORT Size;
	/*000a*/ UCHAR Flags;
	/*000b*/ UCHAR SmallTagIndex;
	/*0008*/ ULONG SubSegmentCode;
	/*000c*/ USHORT PreviousSize;
	/*000e*/ UCHAR SegmentOffset;
	/*000e*/ UCHAR LFHFlags;
	/*000f*/ UCHAR UnusedBytes;
	/*0008*/ ULONGLONG CompactHeader;
	/*0000*/ _HEAP_EXTENDED_ENTRY ExtendedEntry;
	/*0000*/ void * Reserved;
	/*0008*/ USHORT FunctionIndex;
	/*000a*/ USHORT ContextValue;
	/*0008*/ ULONG InterceptorValue;
	/*000c*/ USHORT UnusedBytesLength;
	/*000e*/ UCHAR EntryOffset;
	/*000f*/ UCHAR ExtendedBlockSignature;
	/*0000*/ void * ReservedForAlignment;
	/*0008*/ ULONG Code1;
	/*000c*/ USHORT Code2;
	/*000e*/ UCHAR Code3;
	/*000f*/ UCHAR Code4;
	/*000c*/ ULONG Code234;
	/*0008*/ ULONGLONG AgregateCode;
	/*0010*/ _LIST_ENTRY FreeList;
	/*0020*/
};

struct _HEAP_FREE_ENTRY_EXTRA {
	/*0000*/ USHORT TagIndex;
	/*0002*/ USHORT FreeBackTraceIndex;
	/*0004*/
};

struct _HEAP_GLOBAL_APPCOMPAT_FLAGS {
	/*0000*/ ULONG SafeInputValidation : 01; // 0x00000001;
	/*0000*/ ULONG Padding : 01; // 0x00000002;
	/*0000*/ ULONG CommitLFHSubsegments : 01; // 0x00000004;
	/*0000*/ ULONG AllocateHeapFromEnv : 01; // 0x00000008;
	/*0004*/
};

struct _HEAP_LARGE_ALLOC_DATA {
	/*0000*/ _RTL_BALANCED_NODE TreeNode;
	/*0018*/ ULONGLONG VirtualAddress;
	/*0018*/ ULONGLONG UnusedBytes : 16; // 0x000000000000ffff;
	/*0020*/ ULONGLONG ExtraPresent : 01; // 0x0000000000000001;
	/*0020*/ ULONGLONG GuardPageCount : 01; // 0x0000000000000002;
	/*0020*/ ULONGLONG GuardPageAlignment : 06; // 0x00000000000000fc;
	/*0020*/ ULONGLONG Spare : 04; // 0x0000000000000f00;
	/*0020*/ ULONGLONG AllocatedPages : 52; // 0xfffffffffffff000;
	/*0028*/
};

struct _HEAP_LFH_AFFINITY_SLOT {
	/*0000*/ _HEAP_LFH_SUBSEGMENT_OWNER State;
	/*0038*/ _HEAP_LFH_FAST_REF ActiveSubsegment;
	/*0040*/
};

struct _HEAP_LFH_BUCKET {
	/*0000*/ _HEAP_LFH_SUBSEGMENT_OWNER State;
	/*0038*/ ULONGLONG TotalBlockCount;
	/*0040*/ ULONGLONG TotalSubsegmentCount;
	/*0048*/ ULONG ReciprocalBlockSize;
	/*004c*/ UCHAR Shift;
	/*004d*/ UCHAR ContentionCount;
	/*0050*/ ULONGLONG AffinityMappingLock;
	/*0058*/ UCHAR * ProcAffinityMapping;
	/*0060*/ _HEAP_LFH_AFFINITY_SLOT * * AffinitySlots;
	/*0068*/
};

struct _HEAP_LFH_CONTEXT {
	/*0000*/ void * BackendCtx;
	/*0008*/ _HEAP_SUBALLOCATOR_CALLBACKS Callbacks;
	/*0030*/ UCHAR const * AffinityModArray;
	/*0038*/ UCHAR MaxAffinity;
	/*0039*/ UCHAR LockType;
	/*003a*/ SHORT MemStatsOffset;
	/*003c*/ _RTL_HP_LFH_CONFIG Config;
	/*0040*/ _HEAP_LFH_SUBSEGMENT_STATS BucketStats;
	/*0048*/ ULONGLONG SubsegmentCreationLock;
	/*0080*/ _HEAP_LFH_BUCKET * Buckets[0x81];
	/*04c0*/
};

struct _HEAP_LFH_FAST_REF {
	/*0000*/ void * Target;
	/*0000*/ ULONGLONG Value;
	/*0000*/ ULONGLONG RefCount : 12; // 0x0000000000000fff;
	/*0008*/
};

enum _HEAP_LFH_LOCKMODE {
	HeapLockNotHeld = 0x0,
	HeapLockShared = 0x1,
	HeapLockExclusive = 0x2
};

union _HEAP_LFH_ONDEMAND_POINTER {
	/*0000*/ USHORT Invalid : 01; // 0x0001;
	/*0000*/ USHORT AllocationInProgress : 01; // 0x0002;
	/*0000*/ USHORT Spare0 : 14; // 0xfffc;
	/*0002*/ USHORT UsageData;
	/*0000*/ void * AllBits;
	/*0008*/
};

struct _HEAP_LFH_SUBSEGMENT {
	/*0000*/ _LIST_ENTRY ListEntry;
	/*0010*/ _HEAP_LFH_SUBSEGMENT_OWNER * Owner;
	/*0010*/ _HEAP_LFH_SUBSEGMENT_DELAY_FREE DelayFree;
	/*0018*/ ULONGLONG CommitLock;
	/*0020*/ USHORT FreeCount;
	/*0022*/ USHORT BlockCount;
	/*0020*/ SHORT volatile InterlockedShort;
	/*0020*/ LONG volatile InterlockedLong;
	/*0024*/ USHORT FreeHint;
	/*0026*/ UCHAR Location;
	/*0027*/ UCHAR WitheldBlockCount;
	/*0028*/ _HEAP_LFH_SUBSEGMENT_ENCODED_OFFSETS BlockOffsets;
	/*002c*/ UCHAR CommitUnitShift;
	/*002d*/ UCHAR CommitUnitCount;
	/*002e*/ USHORT CommitStateOffset;
	/*0030*/ ULONGLONG BlockBitmap[0x1];
	/*0038*/
};

union _HEAP_LFH_SUBSEGMENT_DELAY_FREE {
	/*0000*/ ULONGLONG DelayFree : 01; // 0x0000000000000001;
	/*0000*/ ULONGLONG Count : 63; // 0xfffffffffffffffe;
	/*0000*/ void * AllBits;
	/*0008*/
};

struct _HEAP_LFH_SUBSEGMENT_ENCODED_OFFSETS {
	/*0000*/ USHORT BlockSize;
	/*0002*/ USHORT FirstBlockOffset;
	/*0000*/ ULONG EncodedData;
	/*0004*/
};

struct _HEAP_LFH_SUBSEGMENT_OWNER {
	/*0000*/ UCHAR IsBucket : 01; // 0x01;
	/*0000*/ UCHAR Spare0 : 07; // 0xfe;
	/*0001*/ UCHAR BucketIndex;
	/*0002*/ UCHAR SlotCount;
	/*0002*/ UCHAR SlotIndex;
	/*0003*/ UCHAR Spare1;
	/*0008*/ ULONGLONG AvailableSubsegmentCount;
	/*0010*/ ULONGLONG Lock;
	/*0018*/ _LIST_ENTRY AvailableSubsegmentList;
	/*0028*/ _LIST_ENTRY FullSubsegmentList;
	/*0038*/
};

struct _HEAP_LFH_SUBSEGMENT_STAT {
	/*0000*/ UCHAR Index;
	/*0001*/ UCHAR Count;
	/*0002*/
};

union _HEAP_LFH_SUBSEGMENT_STATS {
	/*0000*/ _HEAP_LFH_SUBSEGMENT_STAT Buckets[0x4];
	/*0000*/ void * AllStats;
	/*0008*/
};

struct _HEAP_LFH_UNUSED_BYTES_INFO {
	/*0000*/ USHORT UnusedBytes : 14; // 0x3fff;
	/*0000*/ USHORT ExtraPresent : 01; // 0x4000;
	/*0000*/ USHORT OneByteUnused : 01; // 0x8000;
	/*0000*/ UCHAR Bytes[0x2];
	/*0002*/
};

struct _HEAP_LIST_LOOKUP {
	/*0000*/ _HEAP_LIST_LOOKUP * ExtendedLookup;
	/*0008*/ ULONG ArraySize;
	/*000c*/ ULONG ExtraItem;
	/*0010*/ ULONG ItemCount;
	/*0014*/ ULONG OutOfRangeItems;
	/*0018*/ ULONG BaseIndex;
	/*0020*/ _LIST_ENTRY * ListHead;
	/*0028*/ ULONG * ListsInUseUlong;
	/*0030*/ _LIST_ENTRY * * ListHints;
	/*0038*/
};

struct _HEAP_LOCK {
	union {
		/*0000*/ _RTL_CRITICAL_SECTION CriticalSection;
		/*0000*/ _ERESOURCE Resource;
		/*0068*/
	} Lock;
	/*0068*/
};

struct _HEAP_OPPORTUNISTIC_LARGE_PAGE_STATS {
	/*0000*/ ULONGLONG volatile SmallPagesInUseWithinLarge;
	/*0008*/ ULONGLONG volatile OpportunisticLargePageCount;
	/*0010*/
};

struct _HEAP_PAGE_RANGE_DESCRIPTOR {
	/*0000*/ _RTL_BALANCED_NODE TreeNode;
	/*0000*/ ULONG TreeSignature;
	/*0004*/ ULONG UnusedBytes;
	/*0008*/ USHORT ExtraPresent : 01; // 0x0001;
	/*0008*/ USHORT Spare0 : 15; // 0xfffe;
	/*0018*/ UCHAR volatile RangeFlags;
	/*0019*/ UCHAR CommittedPageCount;
	/*001a*/ USHORT Spare;
	/*001c*/ _HEAP_DESCRIPTOR_KEY Key;
	/*001c*/ UCHAR Align[0x3];
	/*001f*/ UCHAR UnitOffset;
	/*001f*/ UCHAR UnitSize;
	/*0020*/
};

union _HEAP_PAGE_SEGMENT {
	/*0000*/ _LIST_ENTRY ListEntry;
	/*0010*/ ULONGLONG Signature;
	/*0018*/ _HEAP_SEGMENT_MGR_COMMIT_STATE * SegmentCommitState;
	/*0020*/ UCHAR UnusedWatermark;
	/*0000*/ _HEAP_PAGE_RANGE_DESCRIPTOR DescArray[0x100];
	/*2000*/
};

struct _HEAP_PSEUDO_TAG_ENTRY {
	/*0000*/ ULONG Allocs;
	/*0004*/ ULONG Frees;
	/*0008*/ ULONGLONG Size;
	/*0010*/
};

struct _HEAP_RUNTIME_MEMORY_STATS {
	/*0000*/ ULONGLONG volatile TotalReservedPages;
	/*0008*/ ULONGLONG volatile TotalCommittedPages;
	/*0010*/ ULONGLONG FreeCommittedPages;
	/*0018*/ ULONGLONG LfhFreeCommittedPages;
	/*0020*/ _HEAP_OPPORTUNISTIC_LARGE_PAGE_STATS LargePageStats[0x2];
	/*0040*/ _RTL_HP_SEG_ALLOC_POLICY LargePageUtilizationPolicy;
	/*0058*/
};

struct _HEAP_SEGMENT {
	/*0000*/ _HEAP_ENTRY Entry;
	/*0010*/ ULONG SegmentSignature;
	/*0014*/ ULONG SegmentFlags;
	/*0018*/ _LIST_ENTRY SegmentListEntry;
	/*0028*/ _HEAP * Heap;
	/*0030*/ void * BaseAddress;
	/*0038*/ ULONG NumberOfPages;
	/*0040*/ _HEAP_ENTRY * FirstEntry;
	/*0048*/ _HEAP_ENTRY * LastValidEntry;
	/*0050*/ ULONG NumberOfUnCommittedPages;
	/*0054*/ ULONG NumberOfUnCommittedRanges;
	/*0058*/ USHORT SegmentAllocatorBackTraceIndex;
	/*005a*/ USHORT Reserved;
	/*0060*/ _LIST_ENTRY UCRSegmentList;
	/*0070*/
};

union _HEAP_SEGMENT_MGR_COMMIT_STATE {
	/*0000*/ USHORT CommittedPageCount : 11; // 0x07ff;
	/*0000*/ USHORT Spare : 03; // 0x3800;
	/*0000*/ USHORT LargePageOperationInProgress : 01; // 0x4000;
	/*0000*/ USHORT LargePageCommit : 01; // 0x8000;
	/*0000*/ USHORT volatile EntireUShortV;
	/*0000*/ USHORT EntireUShort;
	/*0002*/
};

enum _HEAP_SEGMGR_LARGE_PAGE_POLICY {
	HeapSegMgrNoLargePages = 0x0,
	HeapSegMgrEnableLargePages = 0x1,
	HeapSegMgrNormalPolicy = 0x1,
	HeapSegMgrForceSmall = 0x2,
	HeapSegMgrForceLarge = 0x3,
	HeapSegMgrForceRandom = 0x4,
	HeapSegMgrLargePagePolicyMax = 0x5
};

struct _HEAP_SEG_CONTEXT {
	/*0000*/ ULONGLONG SegmentMask;
	/*0008*/ UCHAR UnitShift;
	/*0009*/ UCHAR PagesPerUnitShift;
	/*000a*/ UCHAR FirstDescriptorIndex;
	/*000b*/ UCHAR CachedCommitSoftShift;
	/*000c*/ UCHAR CachedCommitHighShift;
	union {
		/*000d*/ UCHAR LargePagePolicy : 03; // 0x07;
		/*000d*/ UCHAR FullDecommit : 01; // 0x08;
		/*000d*/ UCHAR ReleaseEmptySegments : 01; // 0x10;
		/*000d*/ UCHAR AllFlags;
		/*000e*/
	} Flags;
	/*0010*/ ULONG MaxAllocationSize;
	/*0014*/ SHORT OlpStatsOffset;
	/*0016*/ SHORT MemStatsOffset;
	/*0018*/ void * LfhContext;
	/*0020*/ void * VsContext;
	/*0028*/ RTL_HP_ENV_HANDLE EnvHandle;
	/*0038*/ void * Heap;
	/*0040*/ ULONGLONG SegmentLock;
	/*0048*/ _LIST_ENTRY SegmentListHead;
	/*0058*/ ULONGLONG SegmentCount;
	/*0060*/ _RTL_RB_TREE FreePageRanges;
	/*0070*/ ULONGLONG FreeSegmentListLock;
	/*0078*/ _SINGLE_LIST_ENTRY FreeSegmentList[0x2];
	/*00c0*/
};

enum _HEAP_SEG_RANGE_TYPE {
	HeapSegRangeUser = 0x0,
	HeapSegRangeInternal = 0x1,
	HeapSegRangeLFH = 0x2,
	HeapSegRangeVS = 0x3,
	HeapSegRangeTypeMax = 0x3
};

struct _HEAP_STOP_ON_TAG {
	/*0000*/ ULONG HeapAndTagIndex;
	/*0000*/ USHORT TagIndex;
	/*0002*/ USHORT HeapIndex;
	/*0004*/
};

struct _HEAP_STOP_ON_VALUES {
	/*0000*/ ULONGLONG AllocAddress;
	/*0008*/ _HEAP_STOP_ON_TAG AllocTag;
	/*0010*/ ULONGLONG ReAllocAddress;
	/*0018*/ _HEAP_STOP_ON_TAG ReAllocTag;
	/*0020*/ ULONGLONG FreeAddress;
	/*0028*/ _HEAP_STOP_ON_TAG FreeTag;
	/*0030*/
};

struct _HEAP_SUBALLOCATOR_CALLBACKS {
	/*0000*/ ULONGLONG Allocate;
	/*0008*/ ULONGLONG Free;
	/*0010*/ ULONGLONG Commit;
	/*0018*/ ULONGLONG Decommit;
	/*0020*/ ULONGLONG ExtendContext;
	/*0028*/
};

struct _HEAP_TAG_ENTRY {
	/*0000*/ ULONG Allocs;
	/*0004*/ ULONG Frees;
	/*0008*/ ULONGLONG Size;
	/*0010*/ USHORT TagIndex;
	/*0012*/ USHORT CreatorBackTraceIndex;
	/*0014*/ WCHAR TagName[0x18];
	/*0048*/
};

struct _HEAP_TUNING_PARAMETERS {
	/*0000*/ ULONG CommittThresholdShift;
	/*0008*/ ULONGLONG MaxPreCommittThreshold;
	/*0010*/
};

struct _HEAP_UCR_DESCRIPTOR {
	/*0000*/ _LIST_ENTRY ListEntry;
	/*0010*/ _LIST_ENTRY SegmentEntry;
	/*0020*/ void * Address;
	/*0028*/ ULONGLONG Size;
	/*0030*/
};

struct _HEAP_UNPACKED_ENTRY {
	/*0000*/ void * PreviousBlockPrivateData;
	/*0008*/ USHORT Size;
	/*000a*/ UCHAR Flags;
	/*000b*/ UCHAR SmallTagIndex;
	/*0008*/ ULONG SubSegmentCode;
	/*000c*/ USHORT PreviousSize;
	/*000e*/ UCHAR SegmentOffset;
	/*000e*/ UCHAR LFHFlags;
	/*000f*/ UCHAR UnusedBytes;
	/*0008*/ ULONGLONG CompactHeader;
	/*0010*/
};

struct _HEAP_VAMGR_ALLOCATOR {
	/*0000*/ ULONGLONG TreeLock;
	/*0008*/ _RTL_RB_TREE FreeRanges;
	/*0018*/ _HEAP_VAMGR_VASPACE * VaSpace;
	/*0020*/ void * PartitionHandle;
	/*0028*/ USHORT ChunksPerRegion;
	/*002a*/ USHORT RefCount;
	/*002c*/ UCHAR AllocatorIndex;
	/*002d*/ UCHAR NumaNode;
	/*002e*/ UCHAR LockType : 01; // 0x01;
	/*002e*/ UCHAR MemoryType : 02; // 0x06;
	/*002e*/ UCHAR ConstrainedVA : 01; // 0x08;
	/*002e*/ UCHAR AllowFreeHead : 01; // 0x10;
	/*002e*/ UCHAR Spare0 : 03; // 0xe0;
	/*002f*/ UCHAR Spare1;
	/*0030*/
};

struct _HEAP_VAMGR_CTX {
	/*0000*/ _HEAP_VAMGR_VASPACE VaSpace;
	/*0860*/ ULONGLONG AllocatorLock;
	/*0868*/ ULONG AllocatorCount;
	/*0870*/ _HEAP_VAMGR_ALLOCATOR Allocators[0xff];
	/*3840*/
};

struct _HEAP_VAMGR_RANGE {
	/*0000*/ _RTL_BALANCED_NODE RbNode;
	/*0000*/ _SINGLE_LIST_ENTRY Next;
	/*0000*/ UCHAR Allocated : 01; // 0x01;
	/*0000*/ UCHAR Internal : 01; // 0x02;
	/*0000*/ UCHAR Standalone : 01; // 0x04;
	/*0000*/ UCHAR Spare0 : 05; // 0xf8;
	/*0001*/ UCHAR AllocatorIndex;
	/*0008*/ ULONGLONG OwnerCtx[0x2];
	/*0018*/ ULONGLONG SizeInChunks;
	/*0018*/ USHORT ChunkCount;
	/*001a*/ USHORT PrevChunkCount;
	/*0018*/ ULONGLONG Signature;
	/*0020*/
};

struct _HEAP_VAMGR_VASPACE {
	/*0000*/ _RTLP_HP_ADDRESS_SPACE_TYPE AddressSpaceType;
	/*0008*/ ULONGLONG BaseAddress;
	/*0010*/ _RTL_SPARSE_ARRAY VaRangeArray;
	/*0010*/ UCHAR VaRangeArrayBuffer[0x850];
	/*0860*/
};

struct _HEAP_VIRTUAL_ALLOC_ENTRY {
	/*0000*/ _LIST_ENTRY Entry;
	/*0010*/ _HEAP_ENTRY_EXTRA ExtraStuff;
	/*0020*/ ULONGLONG CommitSize;
	/*0028*/ ULONGLONG ReserveSize;
	/*0030*/ _HEAP_ENTRY BusyBlock;
	/*0040*/
};

struct _HEAP_VS_CHUNK_FREE_HEADER {
	/*0000*/ _HEAP_VS_CHUNK_HEADER Header;
	/*0000*/ ULONGLONG OverlapsHeader;
	/*0008*/ _RTL_BALANCED_NODE Node;
	/*0020*/
};

struct _HEAP_VS_CHUNK_HEADER {
	/*0000*/ _HEAP_VS_CHUNK_HEADER_SIZE Sizes;
	/*0008*/ ULONG EncodedSegmentPageOffset : 08; // 0x000000ff;
	/*0008*/ ULONG UnusedBytes : 01; // 0x00000100;
	/*0008*/ ULONG SkipDuringWalk : 01; // 0x00000200;
	/*0008*/ ULONG Spare : 22; // 0xfffffc00;
	/*0008*/ ULONG AllocatedChunkBits;
	/*0010*/
};

union _HEAP_VS_CHUNK_HEADER_SIZE {
	/*0000*/ ULONG MemoryCost : 16; // 0x0000ffff;
	/*0000*/ ULONG UnsafeSize : 16; // 0xffff0000;
	/*0004*/ ULONG UnsafePrevSize : 16; // 0x0000ffff;
	/*0004*/ ULONG Allocated : 08; // 0x00ff0000;
	/*0000*/ USHORT KeyUShort;
	/*0000*/ ULONG KeyULong;
	/*0000*/ ULONGLONG HeaderBits;
	/*0008*/
};

struct _HEAP_VS_CONTEXT {
	/*0000*/ ULONGLONG Lock;
	/*0008*/ _RTLP_HP_LOCK_TYPE LockType;
	/*0010*/ _RTL_RB_TREE FreeChunkTree;
	/*0020*/ _LIST_ENTRY SubsegmentList;
	/*0030*/ ULONGLONG TotalCommittedUnits;
	/*0038*/ ULONGLONG FreeCommittedUnits;
	/*0040*/ _HEAP_VS_DELAY_FREE_CONTEXT DelayFreeContext;
	/*0080*/ void * BackendCtx;
	/*0088*/ _HEAP_SUBALLOCATOR_CALLBACKS Callbacks;
	/*00b0*/ _RTL_HP_VS_CONFIG Config;
	/*00b4*/ ULONG Flags;
	/*00c0*/
};

struct _HEAP_VS_DELAY_FREE_CONTEXT {
	/*0000*/ _SLIST_HEADER ListHead;
	/*0010*/
};

struct _HEAP_VS_SUBSEGMENT {
	/*0000*/ _LIST_ENTRY ListEntry;
	/*0010*/ ULONGLONG CommitBitmap;
	/*0018*/ ULONGLONG CommitLock;
	/*0020*/ USHORT Size;
	/*0022*/ USHORT Signature : 15; // 0x7fff;
	/*0022*/ USHORT FullCommit : 01; // 0x8000;
	/*0028*/
};

struct _HEAP_VS_UNUSED_BYTES_INFO {
	/*0000*/ USHORT UnusedBytes : 13; // 0x1fff;
	/*0000*/ USHORT LfhSubsegment : 01; // 0x2000;
	/*0000*/ USHORT ExtraPresent : 01; // 0x4000;
	/*0000*/ USHORT OneByteUnused : 01; // 0x8000;
	/*0000*/ UCHAR Bytes[0x2];
	/*0002*/
};

struct _HHIVE {
	/*0000*/ ULONG Signature;
	/*0008*/ _CELL_DATA * (* GetCellRoutine)( _HHIVE * , ULONG , _HV_GET_CELL_CONTEXT * );
	/*0010*/ void (* ReleaseCellRoutine)( _HHIVE * , _HV_GET_CELL_CONTEXT * );
	/*0018*/ void * (* Allocate)( ULONG , UCHAR , ULONG );
	/*0020*/ void (* Free)( void * , ULONG );
	/*0028*/ LONG (* FileWrite)( _HHIVE * , ULONG , CMP_OFFSET_ARRAY * , ULONG , ULONG );
	/*0030*/ LONG (* FileRead)( _HHIVE * , ULONG , ULONG , void * , ULONG );
	/*0038*/ void * HiveLoadFailure;
	/*0040*/ _HBASE_BLOCK * BaseBlock;
	/*0048*/ _CMSI_RW_LOCK FlusherLock;
	/*0050*/ _CMSI_RW_LOCK WriterLock;
	/*0058*/ _RTL_BITMAP DirtyVector;
	/*0068*/ ULONG DirtyCount;
	/*006c*/ ULONG DirtyAlloc;
	/*0070*/ _RTL_BITMAP UnreconciledVector;
	/*0080*/ ULONG UnreconciledCount;
	/*0084*/ ULONG BaseBlockAlloc;
	/*0088*/ ULONG Cluster;
	/*008c*/ UCHAR Flat : 01; // 0x01;
	/*008c*/ UCHAR ReadOnly : 01; // 0x02;
	/*008c*/ UCHAR Reserved : 06; // 0xfc;
	/*008d*/ UCHAR DirtyFlag;
	/*0090*/ ULONG HvBinHeadersUse;
	/*0094*/ ULONG HvFreeCellsUse;
	/*0098*/ ULONG HvUsedCellsUse;
	/*009c*/ ULONG CmUsedCellsUse;
	/*00a0*/ ULONG HiveFlags;
	/*00a4*/ ULONG CurrentLog;
	/*00a8*/ ULONG CurrentLogSequence;
	/*00ac*/ ULONG CurrentLogMinimumSequence;
	/*00b0*/ ULONG CurrentLogOffset;
	/*00b4*/ ULONG MinimumLogSequence;
	/*00b8*/ ULONG LogFileSizeCap;
	/*00bc*/ UCHAR LogDataPresent[0x2];
	/*00be*/ UCHAR PrimaryFileValid;
	/*00bf*/ UCHAR BaseBlockDirty;
	/*00c0*/ _LARGE_INTEGER LastLogSwapTime;
	/*00c8*/ USHORT FirstLogFile : 03; // 0x0007;
	/*00c8*/ USHORT SecondLogFile : 03; // 0x0038;
	/*00c8*/ USHORT HeaderRecovered : 01; // 0x0040;
	/*00c8*/ USHORT LegacyRecoveryIndicated : 01; // 0x0080;
	/*00c8*/ USHORT RecoveryInformationReserved : 08; // 0xff00;
	/*00c8*/ USHORT RecoveryInformation;
	/*00ca*/ UCHAR LogEntriesRecovered[0x2];
	/*00cc*/ ULONG RefreshCount;
	/*00d0*/ ULONG StorageTypeCount;
	/*00d4*/ ULONG Version;
	/*00d8*/ _HVP_VIEW_MAP ViewMap;
	/*0110*/ _DUAL Storage[0x2];
	/*0600*/
};

struct _HIDDEN_PROCESSOR_POWER_INTERFACE {
	/*0000*/ ULONG Version;
	/*0008*/ LONG (* ReadPerfMsr)( ULONG , ULONG , ULONGLONG * );
	/*0010*/ LONG (* WritePerfMsr)( ULONG , ULONG , ULONGLONG , ULONGLONG );
	/*0018*/ LONG (* ReadPerfIoPort)( ULONG , USHORT , USHORT , ULONG * );
	/*0020*/ LONG (* WritePerfIoPort)( ULONG , USHORT , USHORT , ULONG , ULONG );
	/*0028*/
};

struct _HIVE_LIST_ENTRY {
	/*0000*/ WCHAR * FileName;
	/*0008*/ WCHAR * BaseName;
	/*0010*/ WCHAR * RegRootName;
	/*0018*/ _CMHIVE * CmHive;
	/*0020*/ ULONG HHiveFlags;
	/*0024*/ ULONG CmHiveFlags;
	/*0028*/ ULONG CmKcbCacheSize;
	/*0030*/ _CMHIVE * CmHive2;
	/*0038*/ UCHAR HiveMounted;
	/*0039*/ UCHAR ThreadFinished;
	/*003a*/ UCHAR ThreadStarted;
	/*003b*/ UCHAR Allocate;
	/*003c*/ UCHAR WinPERequired;
	/*0040*/ _KEVENT StartEvent;
	/*0058*/ _KEVENT FinishedEvent;
	/*0070*/ _KEVENT MountLock;
	/*0088*/ _UNICODE_STRING FilePath;
	/*0098*/
};

struct _HIVE_LOAD_FAILURE {
	/*0000*/ _HHIVE * Hive;
	/*0008*/ USHORT Index;
	/*000a*/ USHORT RecoverableIndex;
	struct {
		/*0000*/ _CM_LOAD_FAILURE_TYPE Failure;
		/*0004*/ LONG Status;
		/*0008*/ ULONG Point;
		/*000c*/
	} Locations[0x8];
	struct {
		/*0000*/ _CM_LOAD_FAILURE_TYPE Failure;
		/*0004*/ LONG Status;
		/*0008*/ ULONG Point;
		/*000c*/
	} RecoverableLocations[0x8];
	struct {
		/*00d0*/ ULONG Action;
		/*00d8*/ void * Handle;
		/*00e0*/ LONG Status;
		/*00e8*/
	} RegistryIO;
	struct {
		/*00e8*/ void * CheckStack;
		/*00f0*/
	} CheckRegistry2;
	struct {
		/*00f0*/ ULONG Cell;
		/*00f8*/ _CELL_DATA * CellPoint;
		/*0100*/ void * RootPoint;
		/*0108*/ ULONG Index;
		/*0110*/
	} CheckKey;
	struct {
		/*0110*/ _CELL_DATA * List;
		/*0118*/ ULONG Index;
		/*011c*/ ULONG Cell;
		/*0120*/ _CELL_DATA * CellPoint;
		/*0128*/
	} CheckValueList;
	struct {
		/*0128*/ ULONG Space;
		/*012c*/ ULONG MapPoint;
		/*0130*/ _HBIN * BinPoint;
		/*0138*/
	} CheckHive;
	struct {
		/*0138*/ ULONG Space;
		/*013c*/ ULONG MapPoint;
		/*0140*/ _HBIN * BinPoint;
		/*0148*/
	} CheckHive1;
	struct {
		/*0148*/ _HBIN * Bin;
		/*0150*/ _HCELL * CellPoint;
		/*0158*/
	} CheckBin;
	struct {
		/*0158*/ ULONG FileOffset;
		/*015c*/
	} RecoverData;
	/*0160*/
};

struct _HIVE_WAIT_PACKET {
	/*0000*/ _KEVENT WakeEvent;
	/*0018*/ LONG Status;
	/*0020*/ _HIVE_WAIT_PACKET * Next;
	/*0028*/
};

struct _HIVE_WRITE_WAIT_QUEUE {
	/*0000*/ _ETHREAD * ActiveThread;
	/*0008*/ _HIVE_WAIT_PACKET * WaitList;
	/*0010*/
};

struct _HMAP_DIRECTORY {
	/*0000*/ _HMAP_TABLE * Directory[0x400];
	/*2000*/
};

struct _HMAP_ENTRY {
	/*0000*/ ULONGLONG BlockOffset;
	/*0008*/ ULONGLONG PermanentBinAddress;
	/*0010*/ ULONG MemAlloc;
	/*0018*/
};

struct _HMAP_TABLE {
	/*0000*/ _HMAP_ENTRY Table[0x200];
	/*3000*/
};

struct _HVP_VIEW_MAP {
	/*0000*/ void * SectionReference;
	/*0008*/ LONGLONG StorageEndFileOffset;
	/*0010*/ LONGLONG SectionEndFileOffset;
	/*0018*/ _CMSI_PROCESS_TUPLE * ProcessTuple;
	/*0020*/ ULONG Flags;
	/*0028*/ _RTL_RB_TREE ViewTree;
	/*0038*/
};

enum _HV_EXT_EPF_MODE {
	HvExtEpfModeMin = 0x0,
	HvExtEpfModeNt = 0x0,
	HvExtEpfModeMax = 0x1
};

struct _HV_GET_BIN_CONTEXT {
	/*0000*/ USHORT OutstandingReference : 01; // 0x0001;
	/*0002*/
};

struct _HV_GET_CELL_CONTEXT {
	/*0000*/ ULONG Cell;
	/*0004*/ _HV_GET_BIN_CONTEXT BinContext;
	/*0008*/
};

union _HV_PARTITION_PRIVILEGE_MASK {
	/*0000*/ ULONGLONG AsUINT64;
	/*0000*/ ULONGLONG AccessVpRunTimeReg : 01; // 0x0000000000000001;
	/*0000*/ ULONGLONG AccessPartitionReferenceCounter : 01; // 0x0000000000000002;
	/*0000*/ ULONGLONG AccessSynicRegs : 01; // 0x0000000000000004;
	/*0000*/ ULONGLONG AccessSyntheticTimerRegs : 01; // 0x0000000000000008;
	/*0000*/ ULONGLONG AccessIntrCtrlRegs : 01; // 0x0000000000000010;
	/*0000*/ ULONGLONG AccessHypercallMsrs : 01; // 0x0000000000000020;
	/*0000*/ ULONGLONG AccessVpIndex : 01; // 0x0000000000000040;
	/*0000*/ ULONGLONG AccessResetReg : 01; // 0x0000000000000080;
	/*0000*/ ULONGLONG AccessStatsReg : 01; // 0x0000000000000100;
	/*0000*/ ULONGLONG AccessPartitionReferenceTsc : 01; // 0x0000000000000200;
	/*0000*/ ULONGLONG AccessGuestIdleReg : 01; // 0x0000000000000400;
	/*0000*/ ULONGLONG AccessFrequencyRegs : 01; // 0x0000000000000800;
	/*0000*/ ULONGLONG AccessDebugRegs : 01; // 0x0000000000001000;
	/*0000*/ ULONGLONG AccessReenlightenmentControls : 01; // 0x0000000000002000;
	/*0000*/ ULONGLONG AccessRootSchedulerReg : 01; // 0x0000000000004000;
	/*0000*/ ULONGLONG Reserved1 : 17; // 0x00000000ffff8000;
	/*0000*/ ULONGLONG CreatePartitions : 01; // 0x0000000100000000;
	/*0000*/ ULONGLONG AccessPartitionId : 01; // 0x0000000200000000;
	/*0000*/ ULONGLONG AccessMemoryPool : 01; // 0x0000000400000000;
	/*0000*/ ULONGLONG AdjustMessageBuffers : 01; // 0x0000000800000000;
	/*0000*/ ULONGLONG PostMessages : 01; // 0x0000001000000000;
	/*0000*/ ULONGLONG SignalEvents : 01; // 0x0000002000000000;
	/*0000*/ ULONGLONG CreatePort : 01; // 0x0000004000000000;
	/*0000*/ ULONGLONG ConnectPort : 01; // 0x0000008000000000;
	/*0000*/ ULONGLONG AccessStats : 01; // 0x0000010000000000;
	/*0000*/ ULONGLONG Reserved2 : 02; // 0x0000060000000000;
	/*0000*/ ULONGLONG Debugging : 01; // 0x0000080000000000;
	/*0000*/ ULONGLONG CpuManagement : 01; // 0x0000100000000000;
	/*0000*/ ULONGLONG ConfigureProfiler : 01; // 0x0000200000000000;
	/*0000*/ ULONGLONG AccessVpExitTracing : 01; // 0x0000400000000000;
	/*0000*/ ULONGLONG EnableExtendedGvaRangesForFlushVirtualAddressList : 01; // 0x0000800000000000;
	/*0000*/ ULONGLONG AccessVsm : 01; // 0x0001000000000000;
	/*0000*/ ULONGLONG AccessVpRegisters : 01; // 0x0002000000000000;
	/*0000*/ ULONGLONG UnusedBit : 01; // 0x0004000000000000;
	/*0000*/ ULONGLONG FastHypercallOutput : 01; // 0x0008000000000000;
	/*0000*/ ULONGLONG EnableExtendedHypercalls : 01; // 0x0010000000000000;
	/*0000*/ ULONGLONG StartVirtualProcessor : 01; // 0x0020000000000000;
	/*0000*/ ULONGLONG Isolation : 01; // 0x0040000000000000;
	/*0000*/ ULONGLONG Reserved3 : 09; // 0xff80000000000000;
	/*0008*/
};

struct _HV_X64_HYPERVISOR_FEATURES {
	/*0000*/ _HV_PARTITION_PRIVILEGE_MASK PartitionPrivileges;
	/*0008*/ UINT MaxSupportedCState : 04; // 0x0000000f;
	/*0008*/ UINT HpetNeededForC3PowerState_Deprecated : 01; // 0x00000010;
	/*0008*/ UINT Reserved : 27; // 0xffffffe0;
	/*000c*/ UINT MwaitAvailable_Deprecated : 01; // 0x00000001;
	/*000c*/ UINT GuestDebuggingAvailable : 01; // 0x00000002;
	/*000c*/ UINT PerformanceMonitorsAvailable : 01; // 0x00000004;
	/*000c*/ UINT CpuDynamicPartitioningAvailable : 01; // 0x00000008;
	/*000c*/ UINT XmmRegistersForFastHypercallAvailable : 01; // 0x00000010;
	/*000c*/ UINT GuestIdleAvailable : 01; // 0x00000020;
	/*000c*/ UINT HypervisorSleepStateSupportAvailable : 01; // 0x00000040;
	/*000c*/ UINT NumaDistanceQueryAvailable : 01; // 0x00000080;
	/*000c*/ UINT FrequencyRegsAvailable : 01; // 0x00000100;
	/*000c*/ UINT SyntheticMachineCheckAvailable : 01; // 0x00000200;
	/*000c*/ UINT GuestCrashRegsAvailable : 01; // 0x00000400;
	/*000c*/ UINT DebugRegsAvailable : 01; // 0x00000800;
	/*000c*/ UINT Npiep1Available : 01; // 0x00001000;
	/*000c*/ UINT DisableHypervisorAvailable : 01; // 0x00002000;
	/*000c*/ UINT ExtendedGvaRangesForFlushVirtualAddressListAvailable : 01; // 0x00004000;
	/*000c*/ UINT FastHypercallOutputAvailable : 01; // 0x00008000;
	/*000c*/ UINT SvmFeaturesAvailable : 01; // 0x00010000;
	/*000c*/ UINT SintPollingModeAvailable : 01; // 0x00020000;
	/*000c*/ UINT HypercallMsrLockAvailable : 01; // 0x00040000;
	/*000c*/ UINT DirectSyntheticTimers : 01; // 0x00080000;
	/*000c*/ UINT RegisterPatAvailable : 01; // 0x00100000;
	/*000c*/ UINT RegisterBndcfgsAvailable : 01; // 0x00200000;
	/*000c*/ UINT WatchdogTimerAvailable : 01; // 0x00400000;
	/*000c*/ UINT SyntheticTimeUnhaltedTimerAvailable : 01; // 0x00800000;
	/*000c*/ UINT DeviceDomainsAvailable : 01; // 0x01000000;
	/*000c*/ UINT S1DeviceDomainsAvailable : 01; // 0x02000000;
	/*000c*/ UINT LbrAvailable : 01; // 0x04000000;
	/*000c*/ UINT IptAvailable : 01; // 0x08000000;
	/*000c*/ UINT CrossVtlFlushAvailable : 01; // 0x10000000;
	/*000c*/ UINT Reserved1 : 03; // 0xe0000000;
	/*0010*/
};

struct _I386_LOADER_BLOCK {
	/*0000*/ void * CommonDataArea;
	/*0008*/ ULONG MachineType;
	/*000c*/ ULONG VirtualBias;
	/*0010*/
};

struct _IA64_DBGKD_CONTROL_SET {
	/*0000*/ ULONG Continue;
	/*0004*/ ULONGLONG CurrentSymbolStart;
	/*000c*/ ULONGLONG CurrentSymbolEnd;
	/*0014*/
};

struct _IMAGE_DATA_DIRECTORY {
	/*0000*/ ULONG VirtualAddress;
	/*0004*/ ULONG Size;
	/*0008*/
};

struct _IMAGE_DEBUG_DIRECTORY {
	/*0000*/ ULONG Characteristics;
	/*0004*/ ULONG TimeDateStamp;
	/*0008*/ USHORT MajorVersion;
	/*000a*/ USHORT MinorVersion;
	/*000c*/ ULONG Type;
	/*0010*/ ULONG SizeOfData;
	/*0014*/ ULONG AddressOfRawData;
	/*0018*/ ULONG PointerToRawData;
	/*001c*/
};

struct _IMAGE_DOS_HEADER {
	/*0000*/ USHORT e_magic;
	/*0002*/ USHORT e_cblp;
	/*0004*/ USHORT e_cp;
	/*0006*/ USHORT e_crlc;
	/*0008*/ USHORT e_cparhdr;
	/*000a*/ USHORT e_minalloc;
	/*000c*/ USHORT e_maxalloc;
	/*000e*/ USHORT e_ss;
	/*0010*/ USHORT e_sp;
	/*0012*/ USHORT e_csum;
	/*0014*/ USHORT e_ip;
	/*0016*/ USHORT e_cs;
	/*0018*/ USHORT e_lfarlc;
	/*001a*/ USHORT e_ovno;
	/*001c*/ USHORT e_res[0x4];
	/*0024*/ USHORT e_oemid;
	/*0026*/ USHORT e_oeminfo;
	/*0028*/ USHORT e_res2[0xa];
	/*003c*/ LONG e_lfanew;
	/*0040*/
};

struct _IMAGE_FILE_HEADER {
	/*0000*/ USHORT Machine;
	/*0002*/ USHORT NumberOfSections;
	/*0004*/ ULONG TimeDateStamp;
	/*0008*/ ULONG PointerToSymbolTable;
	/*000c*/ ULONG NumberOfSymbols;
	/*0010*/ USHORT SizeOfOptionalHeader;
	/*0012*/ USHORT Characteristics;
	/*0014*/
};

struct _IMAGE_NT_HEADERS64 {
	/*0000*/ ULONG Signature;
	/*0004*/ _IMAGE_FILE_HEADER FileHeader;
	/*0018*/ _IMAGE_OPTIONAL_HEADER64 OptionalHeader;
	/*0108*/
};

struct _IMAGE_OPTIONAL_HEADER64 {
	/*0000*/ USHORT Magic;
	/*0002*/ UCHAR MajorLinkerVersion;
	/*0003*/ UCHAR MinorLinkerVersion;
	/*0004*/ ULONG SizeOfCode;
	/*0008*/ ULONG SizeOfInitializedData;
	/*000c*/ ULONG SizeOfUninitializedData;
	/*0010*/ ULONG AddressOfEntryPoint;
	/*0014*/ ULONG BaseOfCode;
	/*0018*/ ULONGLONG ImageBase;
	/*0020*/ ULONG SectionAlignment;
	/*0024*/ ULONG FileAlignment;
	/*0028*/ USHORT MajorOperatingSystemVersion;
	/*002a*/ USHORT MinorOperatingSystemVersion;
	/*002c*/ USHORT MajorImageVersion;
	/*002e*/ USHORT MinorImageVersion;
	/*0030*/ USHORT MajorSubsystemVersion;
	/*0032*/ USHORT MinorSubsystemVersion;
	/*0034*/ ULONG Win32VersionValue;
	/*0038*/ ULONG SizeOfImage;
	/*003c*/ ULONG SizeOfHeaders;
	/*0040*/ ULONG CheckSum;
	/*0044*/ USHORT Subsystem;
	/*0046*/ USHORT DllCharacteristics;
	/*0048*/ ULONGLONG SizeOfStackReserve;
	/*0050*/ ULONGLONG SizeOfStackCommit;
	/*0058*/ ULONGLONG SizeOfHeapReserve;
	/*0060*/ ULONGLONG SizeOfHeapCommit;
	/*0068*/ ULONG LoaderFlags;
	/*006c*/ ULONG NumberOfRvaAndSizes;
	/*0070*/ _IMAGE_DATA_DIRECTORY DataDirectory[0x10];
	/*00f0*/
};

struct _IMAGE_ROM_OPTIONAL_HEADER {
	/*0000*/ USHORT Magic;
	/*0002*/ UCHAR MajorLinkerVersion;
	/*0003*/ UCHAR MinorLinkerVersion;
	/*0004*/ ULONG SizeOfCode;
	/*0008*/ ULONG SizeOfInitializedData;
	/*000c*/ ULONG SizeOfUninitializedData;
	/*0010*/ ULONG AddressOfEntryPoint;
	/*0014*/ ULONG BaseOfCode;
	/*0018*/ ULONG BaseOfData;
	/*001c*/ ULONG BaseOfBss;
	/*0020*/ ULONG GprMask;
	/*0024*/ ULONG CprMask[0x4];
	/*0034*/ ULONG GpValue;
	/*0038*/
};

struct _IMAGE_RUNTIME_FUNCTION_ENTRY {
	/*0000*/ ULONG BeginAddress;
	/*0004*/ ULONG EndAddress;
	/*0008*/ ULONG UnwindInfoAddress;
	/*0008*/ ULONG UnwindData;
	/*000c*/
};

struct _IMAGE_SECTION_HEADER {
	/*0000*/ UCHAR Name[0x8];
	union {
		/*0008*/ ULONG PhysicalAddress;
		/*0008*/ ULONG VirtualSize;
		/*000c*/
	} Misc;
	/*000c*/ ULONG VirtualAddress;
	/*0010*/ ULONG SizeOfRawData;
	/*0014*/ ULONG PointerToRawData;
	/*0018*/ ULONG PointerToRelocations;
	/*001c*/ ULONG PointerToLinenumbers;
	/*0020*/ USHORT NumberOfRelocations;
	/*0022*/ USHORT NumberOfLinenumbers;
	/*0024*/ ULONG Characteristics;
	/*0028*/
};

struct _IMAGE_SECURITY_CONTEXT {
	/*0000*/ void * PageHashes;
	/*0000*/ ULONGLONG Value;
	/*0000*/ ULONGLONG SecurityBeingCreated : 02; // 0x0000000000000003;
	/*0000*/ ULONGLONG SecurityMandatory : 01; // 0x0000000000000004;
	/*0000*/ ULONGLONG PageHashPointer : 61; // 0xfffffffffffffff8;
	/*0008*/
};

struct _INITIAL_PRIVILEGE_SET {
	/*0000*/ ULONG PrivilegeCount;
	/*0004*/ ULONG Control;
	/*0008*/ _LUID_AND_ATTRIBUTES Privilege[0x3];
	/*002c*/
};

struct _INPUT_MAPPING_ELEMENT {
	/*0000*/ ULONG InputMappingId;
	/*0004*/
};

struct _INTERFACE {
	/*0000*/ USHORT Size;
	/*0002*/ USHORT Version;
	/*0008*/ void * Context;
	/*0010*/ void (* InterfaceReference)( void * );
	/*0018*/ void (* InterfaceDereference)( void * );
	/*0020*/
};

enum _INTERFACE_TYPE {
	InterfaceTypeUndefined = 0xffffffff,
	Internal = 0x0,
	Isa = 0x1,
	Eisa = 0x2,
	MicroChannel = 0x3,
	TurboChannel = 0x4,
	PCIBus = 0x5,
	VMEBus = 0x6,
	NuBus = 0x7,
	PCMCIABus = 0x8,
	CBus = 0x9,
	MPIBus = 0xa,
	MPSABus = 0xb,
	ProcessorInternal = 0xc,
	InternalPowerBus = 0xd,
	PNPISABus = 0xe,
	PNPBus = 0xf,
	Vmcs = 0x10,
	ACPIBus = 0x11,
	MaximumInterfaceType = 0x12
};

enum _INTERLOCKED_RESULT {
	ResultNegative = 0x1,
	ResultZero = 0x0,
	ResultPositive = 0x2
};

struct _INTERRUPT_CONNECTION_DATA {
	/*0000*/ ULONG Count;
	/*0008*/ _INTERRUPT_VECTOR_DATA Vectors[0x1];
	/*0060*/
};

struct _INTERRUPT_HT_INTR_INFO {
	union {
		struct {
			/*0000*/ ULONG Mask : 01; // 0x00000001;
			/*0000*/ ULONG Polarity : 01; // 0x00000002;
			/*0000*/ ULONG MessageType : 03; // 0x0000001c;
			/*0000*/ ULONG RequestEOI : 01; // 0x00000020;
			/*0000*/ ULONG DestinationMode : 01; // 0x00000040;
			/*0000*/ ULONG MessageType3 : 01; // 0x00000080;
			/*0000*/ ULONG Destination : 08; // 0x0000ff00;
			/*0000*/ ULONG Vector : 08; // 0x00ff0000;
			/*0000*/ ULONG ExtendedAddress : 08; // 0xff000000;
			/*0004*/
		} bits;
		/*0000*/ ULONG AsULONG;
		/*0004*/
	} LowPart;
	union {
		struct {
			/*0004*/ ULONG ExtendedDestination : 24; // 0x00ffffff;
			/*0004*/ ULONG Reserved : 06; // 0x3f000000;
			/*0004*/ ULONG PassPW : 01; // 0x40000000;
			/*0004*/ ULONG WaitingForEOI : 01; // 0x80000000;
			/*0008*/
		} bits;
		/*0004*/ ULONG AsULONG;
		/*0008*/
	} HighPart;
	/*0008*/
};

struct _INTERRUPT_REMAPPING_INFO {
	/*0000*/ ULONG IrtIndex : 30; // 0x3fffffff;
	/*0000*/ ULONG FlagHalInternal : 01; // 0x40000000;
	/*0000*/ ULONG FlagTranslated : 01; // 0x80000000;
	union {
		struct {
			/*0004*/ ULONG MessageAddressHigh;
			/*0008*/ ULONG MessageAddressLow;
			/*000c*/ USHORT MessageData;
			/*000e*/ USHORT Reserved;
			/*0010*/
		} Msi;
		/*0010*/
	} u;
	/*0010*/
};

struct _INTERRUPT_VECTOR_DATA {
	/*0000*/ INTERRUPT_CONNECTION_TYPE Type;
	/*0004*/ ULONG Vector;
	/*0008*/ UCHAR Irql;
	/*000c*/ _KINTERRUPT_POLARITY Polarity;
	/*0010*/ _KINTERRUPT_MODE Mode;
	/*0018*/ _GROUP_AFFINITY TargetProcessors;
	/*0028*/ _INTERRUPT_REMAPPING_INFO IntRemapInfo;
	struct {
		/*0038*/ ULONG Gsiv;
		/*003c*/ ULONG WakeInterrupt : 01; // 0x00000001;
		/*003c*/ ULONG ReservedFlags : 31; // 0xfffffffe;
		/*0040*/
	} ControllerInput;
	/*0040*/ ULONGLONG HvDeviceId;
	struct {
		/*0048*/ _LARGE_INTEGER Address;
		/*0050*/ ULONG DataPayload;
		/*0058*/
	} XapicMessage;
	struct {
		/*0048*/ _INTERRUPT_HT_INTR_INFO IntrInfo;
		/*0050*/
	} Hypertransport;
	struct {
		/*0048*/ _LARGE_INTEGER Address;
		/*0050*/ ULONG DataPayload;
		/*0058*/
	} GenericMessage;
	struct {
		/*0048*/ HAL_APIC_DESTINATION_MODE DestinationMode;
		/*004c*/
	} MessageRequest;
	/*0058*/
};

struct _INVERTED_FUNCTION_TABLE {
	/*0000*/ ULONG CurrentSize;
	/*0004*/ ULONG MaximumSize;
	/*0008*/ ULONG volatile Epoch;
	/*000c*/ UCHAR Overflow;
	/*0010*/ _INVERTED_FUNCTION_TABLE_ENTRY TableEntry[0x100];
	/*1810*/
};

struct _INVERTED_FUNCTION_TABLE_ENTRY {
	/*0000*/ _IMAGE_RUNTIME_FUNCTION_ENTRY * FunctionTable;
	/*0000*/ _DYNAMIC_FUNCTION_TABLE * DynamicTable;
	/*0008*/ void * ImageBase;
	/*0010*/ ULONG SizeOfImage;
	/*0014*/ ULONG SizeOfTable;
	/*0018*/
};

union _INVPCID_DESCRIPTOR {
	struct {
		/*0000*/ ULONGLONG Pcid : 12; // 0x0000000000000fff;
		/*0000*/ ULONGLONG Reserved : 52; // 0xfffffffffffff000;
		/*0000*/ ULONGLONG EntirePcid;
		/*0008*/ ULONGLONG Virtual;
		/*0010*/
	} IndividualAddress;
	struct {
		/*0000*/ ULONGLONG Pcid : 12; // 0x0000000000000fff;
		/*0000*/ ULONGLONG Reserved : 52; // 0xfffffffffffff000;
		/*0000*/ ULONGLONG EntirePcid;
		/*0008*/ ULONGLONG Reserved2;
		/*0010*/
	} SingleContext;
	struct {
		/*0000*/ ULONGLONG Reserved[0x2];
		/*0010*/
	} AllContextAndGlobals;
	struct {
		/*0000*/ ULONGLONG Reserved[0x2];
		/*0010*/
	} AllContext;
	/*0010*/
};

enum _INVPCID_TYPE {
	InvpcidIndividualAddress = 0x0,
	InvpcidSingleContext = 0x1,
	InvpcidAllContextAndGlobals = 0x2,
	InvpcidAllContext = 0x3
};

struct _IOMMU_DMA_DOMAIN;

union _IOMMU_SVM_CAPABILITIES {
	/*0000*/ ULONG AtsCapability : 01; // 0x00000001;
	/*0000*/ ULONG PriCapability : 01; // 0x00000002;
	/*0000*/ ULONG PasidCapability : 01; // 0x00000004;
	struct {
		/*0004*/ ULONG PasidMaxWidth : 05; // 0x0000001f;
		/*0004*/ ULONG PasidExePerm : 01; // 0x00000020;
		/*0004*/ ULONG PasidPrivMode : 01; // 0x00000040;
		/*0004*/ ULONG AtsPageAlignedRequest : 01; // 0x00000080;
		/*0004*/ ULONG AtsGlobalInvalidate : 01; // 0x00000100;
		/*0004*/ ULONG AtsInvalidateQueueDepth : 05; // 0x00003e00;
		/*0008*/
	} CapReg;
	/*0008*/ ULONG Rsvd : 15; // 0x00007fff;
	/*0000*/ ULONG AsULONG;
	/*000c*/
};

struct _IOP_FILE_OBJECT_EXTENSION {
	/*0000*/ ULONG FoExtFlags;
	/*0008*/ void * FoExtPerTypeExtension[0x9];
	/*0050*/ _IOP_PRIORITY_HINT FoIoPriorityHint;
	/*0058*/
};

struct _IOP_IRP_EXTENSION {
	/*0000*/ USHORT ExtensionFlags;
	/*0000*/ USHORT Allocated : 01; // 0x0001;
	/*0000*/ USHORT PropagateId : 01; // 0x0002;
	/*0000*/ USHORT SpareBits : 14; // 0xfffc;
	/*0002*/ USHORT TypesAllocated;
	/*0004*/ UCHAR GenericExtension[0x4];
	/*0008*/ void * VerifierContext;
	/*0010*/ ULONGLONG DiskIoAttributionHandle;
	/*0018*/ _GUID ActivityId;
	/*0028*/ _LARGE_INTEGER Timestamp;
	/*0028*/ ULONG ZeroingOffset;
	/*0028*/ _IO_IRP_EXT_TRACK_OFFSET_HEADER * FsTrackOffsetBlob;
	/*0030*/ LONGLONG FsTrackedOffset;
	/*0028*/ _IO_ADAPTER_CRYPTO_PARAMETERS AdapterCryptoParameters;
	union {
		/*0038*/ ULONGLONG Value;
		/*0038*/ ULONGLONG UserFlags : 32; // 0x00000000ffffffff;
		/*0038*/ ULONGLONG SystemFlags : 16; // 0x0000ffff00000000;
		/*0038*/ ULONGLONG UserFlagsId : 16; // 0xffff000000000000;
		/*0040*/
	} DriverFlags;
	/*0040*/
};

struct _IOP_IRP_EXTENSION_STATUS {
	/*0000*/ ULONG Flags;
	/*0004*/ ULONG ActivityId;
	/*0008*/ ULONG IoTracking;
	/*000c*/
};

struct _IOP_IRP_STACK_PROFILER {
	/*0000*/ ULONG Profile[0x14];
	/*0050*/ ULONG TotalIrps;
	/*0054*/
};

enum _IOP_PRIORITY_HINT {
	IopIoPriorityNotSet = 0x0,
	IopIoPriorityVeryLow = 0x1,
	IopIoPriorityLow = 0x2,
	IopIoPriorityNormal = 0x3,
	IopIoPriorityHigh = 0x4,
	IopIoPriorityCritical = 0x5,
	MaxIopIoPriorityTypes = 0x6
};

struct _IOV_FORCED_PENDING_TRACE {
	/*0000*/ _IRP * Irp;
	/*0008*/ _ETHREAD * Thread;
	/*0010*/ void * StackTrace[0x3e];
	/*0200*/
};

struct _IOV_IRP_TRACE {
	/*0000*/ _IRP * Irp;
	/*0008*/ _KTHREAD * Thread;
	/*0010*/ SHORT KernelApcDisable;
	/*0012*/ SHORT SpecialApcDisable;
	/*0010*/ ULONG CombinedApcDisable;
	/*0014*/ UCHAR Irql;
	/*0018*/ void * StackTrace[0xd];
	/*0080*/
};

struct _IO_ADAPTER_CRYPTO_KEY_DESCRIPTOR {
	/*0000*/ ULONG Version;
	/*0004*/ ULONG Size;
	/*0008*/ ULONG CryptoIndex;
	/*000c*/ ULONG AlgorithmId;
	/*0010*/ ULONG DataUnitSize;
	/*0014*/ ULONG KeySize;
	/*0018*/ UCHAR KeyHash[0x20];
	/*0038*/ void * KeyVirtualAddress;
	/*0040*/ _LARGE_INTEGER KeyPhysicalAddress;
	/*0048*/
};

struct _IO_ADAPTER_CRYPTO_PARAMETERS {
	/*0000*/ ULONGLONG Tweak;
	/*0008*/ _IO_ADAPTER_CRYPTO_KEY_DESCRIPTOR * KeyDescriptor;
	/*0010*/
};

enum _IO_ALLOCATION_ACTION {
	KeepObject = 0x1,
	DeallocateObject = 0x2,
	DeallocateObjectKeepRegisters = 0x3
};

struct _IO_CLIENT_EXTENSION {
	/*0000*/ _IO_CLIENT_EXTENSION * NextExtension;
	/*0008*/ void * ClientIdentificationAddress;
	/*0010*/
};

struct _IO_COMPLETION_CONTEXT {
	/*0000*/ void * Port;
	/*0008*/ void * Key;
	/*0010*/
};

struct _IO_DRIVER_CREATE_CONTEXT {
	/*0000*/ SHORT Size;
	/*0008*/ _ECP_LIST * ExtraCreateParameter;
	/*0010*/ void * DeviceObjectHint;
	/*0018*/ _TXN_PARAMETER_BLOCK * TxnParameters;
	/*0020*/ _EJOB * SiloContext;
	/*0028*/
};

struct _IO_IRP_EXT_TRACK_OFFSET_HEADER {
	/*0000*/ USHORT Validation;
	/*0002*/ USHORT Flags;
	/*0008*/ void (* TrackedOffsetCallback)( _IO_IRP_EXT_TRACK_OFFSET_HEADER * , _IO_IRP_EXT_TRACK_OFFSET_HEADER * , LONGLONG );
	/*0010*/
};

struct _IO_MINI_COMPLETION_PACKET_USER {
	/*0000*/ _LIST_ENTRY ListEntry;
	/*0010*/ ULONG PacketType;
	/*0018*/ void * KeyContext;
	/*0020*/ void * ApcContext;
	/*0028*/ LONG IoStatus;
	/*0030*/ ULONGLONG IoStatusInformation;
	/*0038*/ void (* MiniPacketCallback)( _IO_MINI_COMPLETION_PACKET_USER * , void * );
	/*0040*/ void * Context;
	/*0048*/ UCHAR Allocated;
	/*0050*/
};

enum _IO_PRIORITY_HINT {
	IoPriorityVeryLow = 0x0,
	IoPriorityLow = 0x1,
	IoPriorityNormal = 0x2,
	IoPriorityHigh = 0x3,
	IoPriorityCritical = 0x4,
	MaxIoPriorityTypes = 0x5
};

struct _IO_PRIORITY_INFO {
	/*0000*/ ULONG Size;
	/*0004*/ ULONG ThreadPriority;
	/*0008*/ ULONG PagePriority;
	/*000c*/ _IO_PRIORITY_HINT IoPriority;
	/*0010*/
};

enum _IO_RATE_CONTROL_TYPE {
	IoRateControlTypeCapMin = 0x0,
	IoRateControlTypeIopsCap = 0x0,
	IoRateControlTypeBandwidthCap = 0x1,
	IoRateControlTypeTimePercentCap = 0x2,
	IoRateControlTypeCapMax = 0x2,
	IoRateControlTypeReservationMin = 0x3,
	IoRateControlTypeIopsReservation = 0x3,
	IoRateControlTypeBandwidthReservation = 0x4,
	IoRateControlTypeTimePercentReservation = 0x5,
	IoRateControlTypeReservationMax = 0x5,
	IoRateControlTypeCriticalReservationMin = 0x6,
	IoRateControlTypeIopsCriticalReservation = 0x6,
	IoRateControlTypeBandwidthCriticalReservation = 0x7,
	IoRateControlTypeTimePercentCriticalReservation = 0x8,
	IoRateControlTypeCriticalReservationMax = 0x8,
	IoRateControlTypeSoftCapMin = 0x9,
	IoRateControlTypeIopsSoftCap = 0x9,
	IoRateControlTypeBandwidthSoftCap = 0xa,
	IoRateControlTypeTimePercentSoftCap = 0xb,
	IoRateControlTypeSoftCapMax = 0xb,
	IoRateControlTypeLimitExcessNotifyMin = 0xc,
	IoRateControlTypeIopsLimitExcessNotify = 0xc,
	IoRateControlTypeBandwidthLimitExcessNotify = 0xd,
	IoRateControlTypeTimePercentLimitExcessNotify = 0xe,
	IoRateControlTypeLimitExcessNotifyMax = 0xe,
	IoRateControlTypeMax = 0xf
};

struct _IO_REMOVE_LOCK {
	/*0000*/ _IO_REMOVE_LOCK_COMMON_BLOCK Common;
	/*0020*/
};

struct _IO_REMOVE_LOCK_COMMON_BLOCK {
	/*0000*/ UCHAR Removed;
	/*0001*/ UCHAR Reserved[0x3];
	/*0004*/ LONG IoCount;
	/*0008*/ _KEVENT RemoveEvent;
	/*0020*/
};

struct _IO_RESOURCE_DESCRIPTOR {
	/*0000*/ UCHAR Option;
	/*0001*/ UCHAR Type;
	/*0002*/ UCHAR ShareDisposition;
	/*0003*/ UCHAR Spare1;
	/*0004*/ USHORT Flags;
	/*0006*/ USHORT Spare2;
	union {
		struct {
			/*0008*/ ULONG Length;
			/*000c*/ ULONG Alignment;
			/*0010*/ _LARGE_INTEGER MinimumAddress;
			/*0018*/ _LARGE_INTEGER MaximumAddress;
			/*0020*/
		} Port;
		struct {
			/*0008*/ ULONG Length;
			/*000c*/ ULONG Alignment;
			/*0010*/ _LARGE_INTEGER MinimumAddress;
			/*0018*/ _LARGE_INTEGER MaximumAddress;
			/*0020*/
		} Memory;
		struct {
			/*0008*/ ULONG MinimumVector;
			/*000c*/ ULONG MaximumVector;
			/*0010*/ USHORT AffinityPolicy;
			/*0012*/ USHORT Group;
			/*0014*/ _IRQ_PRIORITY PriorityPolicy;
			/*0018*/ ULONGLONG TargetedProcessors;
			/*0020*/
		} Interrupt;
		struct {
			/*0008*/ ULONG MinimumChannel;
			/*000c*/ ULONG MaximumChannel;
			/*0010*/
		} Dma;
		struct {
			/*0008*/ ULONG RequestLine;
			/*000c*/ ULONG Reserved;
			/*0010*/ ULONG Channel;
			/*0014*/ ULONG TransferWidth;
			/*0018*/
		} DmaV3;
		struct {
			/*0008*/ ULONG Length;
			/*000c*/ ULONG Alignment;
			/*0010*/ _LARGE_INTEGER MinimumAddress;
			/*0018*/ _LARGE_INTEGER MaximumAddress;
			/*0020*/
		} Generic;
		struct {
			/*0008*/ ULONG Data[0x3];
			/*0014*/
		} DevicePrivate;
		struct {
			/*0008*/ ULONG Length;
			/*000c*/ ULONG MinBusNumber;
			/*0010*/ ULONG MaxBusNumber;
			/*0014*/ ULONG Reserved;
			/*0018*/
		} BusNumber;
		struct {
			/*0008*/ ULONG Priority;
			/*000c*/ ULONG Reserved1;
			/*0010*/ ULONG Reserved2;
			/*0014*/
		} ConfigData;
		struct {
			/*0008*/ ULONG Length40;
			/*000c*/ ULONG Alignment40;
			/*0010*/ _LARGE_INTEGER MinimumAddress;
			/*0018*/ _LARGE_INTEGER MaximumAddress;
			/*0020*/
		} Memory40;
		struct {
			/*0008*/ ULONG Length48;
			/*000c*/ ULONG Alignment48;
			/*0010*/ _LARGE_INTEGER MinimumAddress;
			/*0018*/ _LARGE_INTEGER MaximumAddress;
			/*0020*/
		} Memory48;
		struct {
			/*0008*/ ULONG Length64;
			/*000c*/ ULONG Alignment64;
			/*0010*/ _LARGE_INTEGER MinimumAddress;
			/*0018*/ _LARGE_INTEGER MaximumAddress;
			/*0020*/
		} Memory64;
		struct {
			/*0008*/ UCHAR Class;
			/*0009*/ UCHAR Type;
			/*000a*/ UCHAR Reserved1;
			/*000b*/ UCHAR Reserved2;
			/*000c*/ ULONG IdLowPart;
			/*0010*/ ULONG IdHighPart;
			/*0014*/
		} Connection;
		/*0020*/
	} u;
	/*0020*/
};

struct _IO_RESOURCE_LIST {
	/*0000*/ USHORT Version;
	/*0002*/ USHORT Revision;
	/*0004*/ ULONG Count;
	/*0008*/ _IO_RESOURCE_DESCRIPTOR Descriptors[0x1];
	/*0028*/
};

struct _IO_RESOURCE_REQUIREMENTS_LIST {
	/*0000*/ ULONG ListSize;
	/*0004*/ _INTERFACE_TYPE InterfaceType;
	/*0008*/ ULONG BusNumber;
	/*000c*/ ULONG SlotNumber;
	/*0010*/ ULONG Reserved[0x3];
	/*001c*/ ULONG AlternativeLists;
	/*0020*/ _IO_RESOURCE_LIST List[0x1];
	/*0048*/
};

struct _IO_SECURITY_CONTEXT {
	/*0000*/ _SECURITY_QUALITY_OF_SERVICE * SecurityQos;
	/*0008*/ _ACCESS_STATE * AccessState;
	/*0010*/ ULONG DesiredAccess;
	/*0014*/ ULONG FullCreateOptions;
	/*0018*/
};

enum _IO_SESSION_STATE {
	IoSessionStateCreated = 0x1,
	IoSessionStateInitialized = 0x2,
	IoSessionStateConnected = 0x3,
	IoSessionStateDisconnected = 0x4,
	IoSessionStateDisconnectedLoggedOn = 0x5,
	IoSessionStateLoggedOn = 0x6,
	IoSessionStateLoggedOff = 0x7,
	IoSessionStateTerminated = 0x8,
	IoSessionStateMax = 0x9
};

struct _IO_STACK_LOCATION {
	/*0000*/ UCHAR MajorFunction;
	/*0001*/ UCHAR MinorFunction;
	/*0002*/ UCHAR Flags;
	/*0003*/ UCHAR Control;
	union {
		struct {
			/*0008*/ _IO_SECURITY_CONTEXT * SecurityContext;
			/*0010*/ ULONG Options;
			/*0018*/ USHORT FileAttributes;
			/*001a*/ USHORT ShareAccess;
			/*0020*/ ULONG EaLength;
			/*0028*/
		} Create;
		struct {
			/*0008*/ _IO_SECURITY_CONTEXT * SecurityContext;
			/*0010*/ ULONG Options;
			/*0018*/ USHORT Reserved;
			/*001a*/ USHORT ShareAccess;
			/*0020*/ _NAMED_PIPE_CREATE_PARAMETERS * Parameters;
			/*0028*/
		} CreatePipe;
		struct {
			/*0008*/ _IO_SECURITY_CONTEXT * SecurityContext;
			/*0010*/ ULONG Options;
			/*0018*/ USHORT Reserved;
			/*001a*/ USHORT ShareAccess;
			/*0020*/ _MAILSLOT_CREATE_PARAMETERS * Parameters;
			/*0028*/
		} CreateMailslot;
		struct {
			/*0008*/ ULONG Length;
			/*0010*/ ULONG Key;
			/*0014*/ ULONG Flags;
			/*0018*/ _LARGE_INTEGER ByteOffset;
			/*0020*/
		} Read;
		struct {
			/*0008*/ ULONG Length;
			/*0010*/ ULONG Key;
			/*0014*/ ULONG Flags;
			/*0018*/ _LARGE_INTEGER ByteOffset;
			/*0020*/
		} Write;
		struct {
			/*0008*/ ULONG Length;
			/*0010*/ _UNICODE_STRING * FileName;
			/*0018*/ _FILE_INFORMATION_CLASS FileInformationClass;
			/*0020*/ ULONG FileIndex;
			/*0028*/
		} QueryDirectory;
		struct {
			/*0008*/ ULONG Length;
			/*0010*/ ULONG CompletionFilter;
			/*0018*/
		} NotifyDirectory;
		struct {
			/*0008*/ ULONG Length;
			/*0010*/ ULONG CompletionFilter;
			/*0018*/ _DIRECTORY_NOTIFY_INFORMATION_CLASS DirectoryNotifyInformationClass;
			/*0020*/
		} NotifyDirectoryEx;
		struct {
			/*0008*/ ULONG Length;
			/*0010*/ _FILE_INFORMATION_CLASS FileInformationClass;
			/*0018*/
		} QueryFile;
		struct {
			/*0008*/ ULONG Length;
			/*0010*/ _FILE_INFORMATION_CLASS FileInformationClass;
			/*0018*/ _FILE_OBJECT * FileObject;
			/*0020*/ UCHAR ReplaceIfExists;
			/*0021*/ UCHAR AdvanceOnly;
			/*0020*/ ULONG ClusterCount;
			/*0020*/ void * DeleteHandle;
			/*0028*/
		} SetFile;
		struct {
			/*0008*/ ULONG Length;
			/*0010*/ void * EaList;
			/*0018*/ ULONG EaListLength;
			/*0020*/ ULONG EaIndex;
			/*0028*/
		} QueryEa;
		struct {
			/*0008*/ ULONG Length;
			/*000c*/
		} SetEa;
		struct {
			/*0008*/ ULONG Length;
			/*0010*/ _FSINFOCLASS FsInformationClass;
			/*0018*/
		} QueryVolume;
		struct {
			/*0008*/ ULONG Length;
			/*0010*/ _FSINFOCLASS FsInformationClass;
			/*0018*/
		} SetVolume;
		struct {
			/*0008*/ ULONG OutputBufferLength;
			/*0010*/ ULONG InputBufferLength;
			/*0018*/ ULONG FsControlCode;
			/*0020*/ void * Type3InputBuffer;
			/*0028*/
		} FileSystemControl;
		struct {
			/*0008*/ _LARGE_INTEGER * Length;
			/*0010*/ ULONG Key;
			/*0018*/ _LARGE_INTEGER ByteOffset;
			/*0020*/
		} LockControl;
		struct {
			/*0008*/ ULONG OutputBufferLength;
			/*0010*/ ULONG InputBufferLength;
			/*0018*/ ULONG IoControlCode;
			/*0020*/ void * Type3InputBuffer;
			/*0028*/
		} DeviceIoControl;
		struct {
			/*0008*/ ULONG SecurityInformation;
			/*0010*/ ULONG Length;
			/*0018*/
		} QuerySecurity;
		struct {
			/*0008*/ ULONG SecurityInformation;
			/*0010*/ void * SecurityDescriptor;
			/*0018*/
		} SetSecurity;
		struct {
			/*0008*/ _VPB * Vpb;
			/*0010*/ _DEVICE_OBJECT * DeviceObject;
			/*0018*/
		} MountVolume;
		struct {
			/*0008*/ _VPB * Vpb;
			/*0010*/ _DEVICE_OBJECT * DeviceObject;
			/*0018*/
		} VerifyVolume;
		struct {
			/*0008*/ _SCSI_REQUEST_BLOCK * Srb;
			/*0010*/
		} Scsi;
		struct {
			/*0008*/ ULONG Length;
			/*0010*/ void * StartSid;
			/*0018*/ _FILE_GET_QUOTA_INFORMATION * SidList;
			/*0020*/ ULONG SidListLength;
			/*0028*/
		} QueryQuota;
		struct {
			/*0008*/ ULONG Length;
			/*000c*/
		} SetQuota;
		struct {
			/*0008*/ _DEVICE_RELATION_TYPE Type;
			/*000c*/
		} QueryDeviceRelations;
		struct {
			/*0008*/ _GUID const * InterfaceType;
			/*0010*/ USHORT Size;
			/*0012*/ USHORT Version;
			/*0018*/ _INTERFACE * Interface;
			/*0020*/ void * InterfaceSpecificData;
			/*0028*/
		} QueryInterface;
		struct {
			/*0008*/ _DEVICE_CAPABILITIES * Capabilities;
			/*0010*/
		} DeviceCapabilities;
		struct {
			/*0008*/ _IO_RESOURCE_REQUIREMENTS_LIST * IoResourceRequirementList;
			/*0010*/
		} FilterResourceRequirements;
		struct {
			/*0008*/ ULONG WhichSpace;
			/*0010*/ void * Buffer;
			/*0018*/ ULONG Offset;
			/*0020*/ ULONG Length;
			/*0028*/
		} ReadWriteConfig;
		struct {
			/*0008*/ UCHAR Lock;
			/*0009*/
		} SetLock;
		struct {
			/*0008*/ BUS_QUERY_ID_TYPE IdType;
			/*000c*/
		} QueryId;
		struct {
			/*0008*/ DEVICE_TEXT_TYPE DeviceTextType;
			/*0010*/ ULONG LocaleId;
			/*0018*/
		} QueryDeviceText;
		struct {
			/*0008*/ UCHAR InPath;
			/*0009*/ UCHAR Reserved[0x3];
			/*0010*/ _DEVICE_USAGE_NOTIFICATION_TYPE Type;
			/*0018*/
		} UsageNotification;
		struct {
			/*0008*/ _SYSTEM_POWER_STATE PowerState;
			/*000c*/
		} WaitWake;
		struct {
			/*0008*/ _POWER_SEQUENCE * PowerSequence;
			/*0010*/
		} PowerSequence;
		struct {
			/*0008*/ ULONG SystemContext;
			/*0008*/ _SYSTEM_POWER_STATE_CONTEXT SystemPowerStateContext;
			/*0010*/ _POWER_STATE_TYPE Type;
			/*0018*/ _POWER_STATE State;
			/*0020*/ POWER_ACTION ShutdownType;
			/*0028*/
		} Power;
		struct {
			/*0008*/ _CM_RESOURCE_LIST * AllocatedResources;
			/*0010*/ _CM_RESOURCE_LIST * AllocatedResourcesTranslated;
			/*0018*/
		} StartDevice;
		struct {
			/*0008*/ ULONGLONG ProviderId;
			/*0010*/ void * DataPath;
			/*0018*/ ULONG BufferSize;
			/*0020*/ void * Buffer;
			/*0028*/
		} WMI;
		struct {
			/*0008*/ void * Argument1;
			/*0010*/ void * Argument2;
			/*0018*/ void * Argument3;
			/*0020*/ void * Argument4;
			/*0028*/
		} Others;
		/*0028*/
	} Parameters;
	/*0028*/ _DEVICE_OBJECT * DeviceObject;
	/*0030*/ _FILE_OBJECT * FileObject;
	/*0038*/ LONG (* CompletionRoutine)( _DEVICE_OBJECT * , _IRP * , void * );
	/*0040*/ void * Context;
	/*0048*/
};

struct _IO_STATUS_BLOCK {
	/*0000*/ LONG Status;
	/*0000*/ void * Pointer;
	/*0008*/ ULONGLONG Information;
	/*0010*/
};

struct _IO_TIMER {
	/*0000*/ SHORT Type;
	/*0002*/ SHORT TimerFlag;
	/*0008*/ _LIST_ENTRY TimerList;
	/*0018*/ void (* TimerRoutine)( _DEVICE_OBJECT * , void * );
	/*0020*/ void * Context;
	/*0028*/ _DEVICE_OBJECT * DeviceObject;
	/*0030*/
};

struct _IO_WORKITEM {
	/*0000*/ _WORK_QUEUE_ITEM WorkItem;
	/*0020*/ void (* Routine)( void * , void * , _IO_WORKITEM * );
	/*0028*/ void * IoObject;
	/*0030*/ void * Context;
	/*0038*/ _ETHREAD * WorkOnBehalfThread;
	/*0040*/ ULONG Type;
	/*0044*/ _GUID ActivityId;
	/*0058*/
};

struct _IRP {
	/*0000*/ SHORT Type;
	/*0002*/ USHORT Size;
	/*0004*/ USHORT AllocationProcessorNumber;
	/*0006*/ USHORT Reserved;
	/*0008*/ _MDL * MdlAddress;
	/*0010*/ ULONG Flags;
	union {
		/*0018*/ _IRP * MasterIrp;
		/*0018*/ LONG IrpCount;
		/*0018*/ void * SystemBuffer;
		/*0020*/
	} AssociatedIrp;
	/*0020*/ _LIST_ENTRY ThreadListEntry;
	/*0030*/ _IO_STATUS_BLOCK IoStatus;
	/*0040*/ CHAR RequestorMode;
	/*0041*/ UCHAR PendingReturned;
	/*0042*/ CHAR StackCount;
	/*0043*/ CHAR CurrentLocation;
	/*0044*/ UCHAR Cancel;
	/*0045*/ UCHAR CancelIrql;
	/*0046*/ CHAR ApcEnvironment;
	/*0047*/ UCHAR AllocationFlags;
	/*0048*/ _IO_STATUS_BLOCK * UserIosb;
	/*0050*/ _KEVENT * UserEvent;
	union {
		struct {
			/*0058*/ void (* UserApcRoutine)( void * , _IO_STATUS_BLOCK * , ULONG );
			/*0058*/ void * IssuingProcess;
			/*0060*/ void * UserApcContext;
			/*0068*/
		} AsynchronousParameters;
		/*0058*/ _LARGE_INTEGER AllocationSize;
		/*0068*/
	} Overlay;
	/*0068*/ void (* CancelRoutine)( _DEVICE_OBJECT * , _IRP * );
	/*0070*/ void * UserBuffer;
	union {
		struct {
			/*0078*/ _KDEVICE_QUEUE_ENTRY DeviceQueueEntry;
			/*0078*/ void * DriverContext[0x4];
			/*0098*/ _ETHREAD * Thread;
			/*00a0*/ CHAR * AuxiliaryBuffer;
			/*00a8*/ _LIST_ENTRY ListEntry;
			/*00b8*/ _IO_STACK_LOCATION * CurrentStackLocation;
			/*00b8*/ ULONG PacketType;
			/*00c0*/ _FILE_OBJECT * OriginalFileObject;
			/*00c8*/ void * IrpExtension;
			/*00d0*/
		} Overlay;
		/*0078*/ _KAPC Apc;
		/*0078*/ void * CompletionKey;
		/*00d0*/
	} Tail;
	/*00d0*/
};

enum _IRQ_PRIORITY {
	IrqPriorityUndefined = 0x0,
	IrqPriorityLow = 0x1,
	IrqPriorityNormal = 0x2,
	IrqPriorityHigh = 0x3
};

struct _ISRDPCSTATS {
	/*0000*/ ULONGLONG IsrTime;
	/*0008*/ ULONGLONG IsrTimeStart;
	/*0010*/ ULONGLONG IsrCount;
	/*0018*/ ULONGLONG DpcTime;
	/*0020*/ ULONGLONG DpcTimeStart;
	/*0028*/ ULONGLONG DpcCount;
	/*0030*/ UCHAR IsrActive;
	/*0031*/ UCHAR Reserved[0xf];
	/*0040*/
};

struct _ISR_THUNK {
	/*0000*/ UCHAR PushImm;
	/*0001*/ UCHAR Vector;
	/*0002*/ UCHAR PushRbp;
	/*0003*/ UCHAR JmpOp;
	/*0004*/ LONG JmpOffset;
	/*0008*/
};

enum _JOBOBJECTINFOCLASS {
	JobObjectBasicAccountingInformation = 0x1,
	JobObjectBasicLimitInformation = 0x2,
	JobObjectBasicProcessIdList = 0x3,
	JobObjectBasicUIRestrictions = 0x4,
	JobObjectSecurityLimitInformation = 0x5,
	JobObjectEndOfJobTimeInformation = 0x6,
	JobObjectAssociateCompletionPortInformation = 0x7,
	JobObjectBasicAndIoAccountingInformation = 0x8,
	JobObjectExtendedLimitInformation = 0x9,
	JobObjectJobSetInformation = 0xa,
	JobObjectGroupInformation = 0xb,
	JobObjectNotificationLimitInformation = 0xc,
	JobObjectLimitViolationInformation = 0xd,
	JobObjectGroupInformationEx = 0xe,
	JobObjectCpuRateControlInformation = 0xf,
	JobObjectCompletionFilter = 0x10,
	JobObjectCompletionCounter = 0x11,
	JobObjectFreezeInformation = 0x12,
	JobObjectExtendedAccountingInformation = 0x13,
	JobObjectWakeInformation = 0x14,
	JobObjectBackgroundInformation = 0x15,
	JobObjectSchedulingRankBiasInformation = 0x16,
	JobObjectTimerVirtualizationInformation = 0x17,
	JobObjectCycleTimeNotification = 0x18,
	JobObjectClearEvent = 0x19,
	JobObjectInterferenceInformation = 0x1a,
	JobObjectClearPeakJobMemoryUsed = 0x1b,
	JobObjectMemoryUsageInformation = 0x1c,
	JobObjectSharedCommit = 0x1d,
	JobObjectContainerId = 0x1e,
	JobObjectIoRateControlInformation = 0x1f,
	JobObjectSiloRootDirectory = 0x25,
	JobObjectServerSiloBasicInformation = 0x26,
	JobObjectServerSiloUserSharedData = 0x27,
	JobObjectServerSiloInitialize = 0x28,
	JobObjectServerSiloRunningState = 0x29,
	JobObjectIoAttribution = 0x2a,
	JobObjectMemoryPartitionInformation = 0x2b,
	JobObjectContainerTelemetryId = 0x2c,
	JobObjectSiloSystemRoot = 0x2d,
	JobObjectEnergyTrackingState = 0x2e,
	JobObjectThreadImpersonationInformation = 0x2f,
	JobObjectReserved1Information = 0x12,
	JobObjectReserved2Information = 0x13,
	JobObjectReserved3Information = 0x14,
	JobObjectReserved4Information = 0x15,
	JobObjectReserved5Information = 0x16,
	JobObjectReserved6Information = 0x17,
	JobObjectReserved7Information = 0x18,
	JobObjectReserved8Information = 0x19,
	JobObjectReserved9Information = 0x1a,
	JobObjectReserved10Information = 0x1b,
	JobObjectReserved11Information = 0x1c,
	JobObjectReserved12Information = 0x1d,
	JobObjectReserved13Information = 0x1e,
	JobObjectReserved14Information = 0x1f,
	JobObjectNetRateControlInformation = 0x20,
	JobObjectNotificationLimitInformation2 = 0x21,
	JobObjectLimitViolationInformation2 = 0x22,
	JobObjectCreateSilo = 0x23,
	JobObjectSiloBasicInformation = 0x24,
	JobObjectReserved15Information = 0x25,
	JobObjectReserved16Information = 0x26,
	JobObjectReserved17Information = 0x27,
	JobObjectReserved18Information = 0x28,
	JobObjectReserved19Information = 0x29,
	JobObjectReserved20Information = 0x2a,
	JobObjectReserved21Information = 0x2b,
	JobObjectReserved22Information = 0x2c,
	JobObjectReserved23Information = 0x2d,
	JobObjectReserved24Information = 0x2e,
	JobObjectReserved25Information = 0x2f,
	MaxJobObjectInfoClass = 0x30
};

union _JOBOBJECT_ENERGY_TRACKING_STATE {
	/*0000*/ ULONGLONG Value;
	/*0000*/ ULONG UpdateMask;
	/*0004*/ ULONG DesiredState;
	/*0008*/
};

struct _JOBOBJECT_WAKE_FILTER {
	/*0000*/ ULONG HighEdgeFilter;
	/*0004*/ ULONG LowEdgeFilter;
	/*0008*/
};

struct _JOB_ACCESS_STATE;

struct _JOB_CPU_RATE_CONTROL;

struct _JOB_NET_RATE_CONTROL;

struct _JOB_NOTIFICATION_INFORMATION;

struct _JOB_RATE_CONTROL_HEADER {
	/*0000*/ void * RateControlQuotaReference;
	/*0008*/ _RTL_BITMAP OverQuotaHistory;
	/*0018*/ UCHAR * BitMapBuffer;
	/*0020*/ ULONGLONG BitMapBufferSize;
	/*0028*/
};

struct _KAFFINITY_EX {
	/*0000*/ USHORT Count;
	/*0002*/ USHORT Size;
	/*0004*/ ULONG Reserved;
	/*0008*/ ULONGLONG Bitmap[0x14];
	/*00a8*/
};

union _KALPC_DIRECT_EVENT {
	/*0000*/ ULONGLONG Value;
	/*0000*/ ULONGLONG DirectType : 01; // 0x0000000000000001;
	/*0000*/ ULONGLONG EventReferenced : 01; // 0x0000000000000002;
	/*0000*/ ULONGLONG EventObjectBits : 62; // 0xfffffffffffffffc;
	/*0008*/
};

struct _KALPC_HANDLE_DATA {
	/*0000*/ ULONG ObjectType;
	/*0004*/ ULONG Count;
	/*0008*/ _OB_DUPLICATE_OBJECT_STATE DuplicateContext;
	/*0030*/
};

struct _KALPC_MESSAGE {
	/*0000*/ _LIST_ENTRY Entry;
	/*0010*/ _ALPC_PORT * PortQueue;
	/*0018*/ _ALPC_PORT * OwnerPort;
	/*0020*/ _ETHREAD * WaitingThread;
	union {
		struct {
			/*0028*/ ULONG QueueType : 03; // 0x00000007;
			/*0028*/ ULONG QueuePortType : 04; // 0x00000078;
			/*0028*/ ULONG Canceled : 01; // 0x00000080;
			/*0028*/ ULONG Ready : 01; // 0x00000100;
			/*0028*/ ULONG ReleaseMessage : 01; // 0x00000200;
			/*0028*/ ULONG SharedQuota : 01; // 0x00000400;
			/*0028*/ ULONG ReplyWaitReply : 01; // 0x00000800;
			/*0028*/ ULONG OwnerPortReference : 01; // 0x00001000;
			/*0028*/ ULONG ReceiverReference : 01; // 0x00002000;
			/*0028*/ ULONG ViewAttributeRetrieved : 01; // 0x00004000;
			/*0028*/ ULONG InDispatch : 01; // 0x00008000;
			/*002c*/
		} s1;
		/*0028*/ ULONG State;
		/*002c*/
	} u1;
	/*002c*/ LONG SequenceNo;
	/*0030*/ _EPROCESS * QuotaProcess;
	/*0030*/ void * QuotaBlock;
	/*0038*/ _ALPC_PORT * CancelSequencePort;
	/*0040*/ _ALPC_PORT * CancelQueuePort;
	/*0048*/ LONG CancelSequenceNo;
	/*0050*/ _LIST_ENTRY CancelListEntry;
	/*0060*/ _KALPC_RESERVE * Reserve;
	/*0068*/ _KALPC_MESSAGE_ATTRIBUTES MessageAttributes;
	/*00b0*/ void * DataUserVa;
	/*00b8*/ _ALPC_COMMUNICATION_INFO * CommunicationInfo;
	/*00c0*/ _ALPC_PORT * ConnectionPort;
	/*00c8*/ _ETHREAD * ServerThread;
	/*00d0*/ void * WakeReference;
	/*00d8*/ void * WakeReference2;
	/*00e0*/ void * ExtensionBuffer;
	/*00e8*/ ULONGLONG ExtensionBufferSize;
	/*00f0*/ _PORT_MESSAGE PortMessage;
	/*0118*/
};

struct _KALPC_MESSAGE_ATTRIBUTES {
	/*0000*/ void * ClientContext;
	/*0008*/ void * ServerContext;
	/*0010*/ void * PortContext;
	/*0018*/ void * CancelPortContext;
	/*0020*/ _KALPC_SECURITY_DATA * SecurityData;
	/*0028*/ _KALPC_VIEW * View;
	/*0030*/ _KALPC_HANDLE_DATA * HandleData;
	/*0038*/ _KALPC_DIRECT_EVENT DirectEvent;
	/*0040*/ _KALPC_WORK_ON_BEHALF_DATA WorkOnBehalfData;
	/*0048*/
};

struct _KALPC_REGION {
	/*0000*/ _LIST_ENTRY RegionListEntry;
	/*0010*/ _KALPC_SECTION * Section;
	/*0018*/ ULONGLONG Offset;
	/*0020*/ ULONGLONG Size;
	/*0028*/ ULONGLONG ViewSize;
	union {
		struct {
			/*0030*/ ULONG Secure : 01; // 0x00000001;
			/*0034*/
		} s1;
		/*0034*/
	} u1;
	/*0034*/ ULONG NumberOfViews;
	/*0038*/ _LIST_ENTRY ViewListHead;
	/*0048*/ _KALPC_VIEW * ReadOnlyView;
	/*0050*/ _KALPC_VIEW * ReadWriteView;
	/*0058*/
};

struct _KALPC_RESERVE {
	/*0000*/ _ALPC_PORT * OwnerPort;
	/*0008*/ _ALPC_HANDLE_TABLE * HandleTable;
	/*0010*/ void * Handle;
	/*0018*/ _KALPC_MESSAGE * Message;
	/*0020*/ LONG Active;
	/*0028*/
};

struct _KALPC_SECTION {
	/*0000*/ void * SectionObject;
	/*0008*/ ULONGLONG Size;
	/*0010*/ _ALPC_HANDLE_TABLE * HandleTable;
	/*0018*/ void * SectionHandle;
	/*0020*/ _EPROCESS * OwnerProcess;
	/*0028*/ _ALPC_PORT * OwnerPort;
	union {
		struct {
			/*0030*/ ULONG Internal : 01; // 0x00000001;
			/*0030*/ ULONG Secure : 01; // 0x00000002;
			/*0034*/
		} s1;
		/*0034*/
	} u1;
	/*0034*/ ULONG NumberOfRegions;
	/*0038*/ _LIST_ENTRY RegionListHead;
	/*0048*/
};

struct _KALPC_SECURITY_DATA {
	/*0000*/ _ALPC_HANDLE_TABLE * HandleTable;
	/*0008*/ void * ContextHandle;
	/*0010*/ _EPROCESS * OwningProcess;
	/*0018*/ _ALPC_PORT * OwnerPort;
	/*0020*/ _SECURITY_CLIENT_CONTEXT DynamicSecurity;
	union {
		struct {
			/*0068*/ ULONG Revoked : 01; // 0x00000001;
			/*0068*/ ULONG Impersonated : 01; // 0x00000002;
			/*006c*/
		} s1;
		/*006c*/
	} u1;
	/*0070*/
};

struct _KALPC_VIEW {
	/*0000*/ _LIST_ENTRY ViewListEntry;
	/*0010*/ _KALPC_REGION * Region;
	/*0018*/ _ALPC_PORT * OwnerPort;
	/*0020*/ _EPROCESS * OwnerProcess;
	/*0028*/ void * Address;
	/*0030*/ ULONGLONG Size;
	/*0038*/ void * SecureViewHandle;
	/*0040*/ void * WriteAccessHandle;
	union {
		struct {
			/*0048*/ ULONG WriteAccess : 01; // 0x00000001;
			/*0048*/ ULONG AutoRelease : 01; // 0x00000002;
			/*0048*/ ULONG ForceUnlink : 01; // 0x00000004;
			/*0048*/ ULONG SystemSpace : 01; // 0x00000008;
			/*004c*/
		} s1;
		/*004c*/
	} u1;
	/*004c*/ ULONG NumberOfOwnerMessages;
	/*0050*/ _LIST_ENTRY ProcessViewListEntry;
	/*0060*/
};

struct _KALPC_WORK_ON_BEHALF_DATA {
	/*0000*/ _ALPC_WORK_ON_BEHALF_TICKET Ticket;
	/*0008*/
};

struct _KAPC {
	/*0000*/ UCHAR Type;
	/*0001*/ UCHAR SpareByte0;
	/*0002*/ UCHAR Size;
	/*0003*/ UCHAR SpareByte1;
	/*0004*/ ULONG SpareLong0;
	/*0008*/ _KTHREAD * Thread;
	/*0010*/ _LIST_ENTRY ApcListEntry;
	/*0020*/ void (* KernelRoutine)( _KAPC * , void (* * )( void * , void * , void * ), void * * , void * * , void * * );
	/*0028*/ void (* RundownRoutine)( _KAPC * );
	/*0030*/ void (* NormalRoutine)( void * , void * , void * );
	/*0020*/ void * Reserved[0x3];
	/*0038*/ void * NormalContext;
	/*0040*/ void * SystemArgument1;
	/*0048*/ void * SystemArgument2;
	/*0050*/ CHAR ApcStateIndex;
	/*0051*/ CHAR ApcMode;
	/*0052*/ UCHAR Inserted;
	/*0058*/
};

struct _KAPC_STATE {
	/*0000*/ _LIST_ENTRY ApcListHead[0x2];
	/*0020*/ _KPROCESS * Process;
	/*0028*/ UCHAR InProgressFlags;
	/*0028*/ UCHAR KernelApcInProgress : 01; // 0x01;
	/*0028*/ UCHAR SpecialApcInProgress : 01; // 0x02;
	/*0029*/ UCHAR KernelApcPending;
	/*002a*/ UCHAR UserApcPendingAll;
	/*002a*/ UCHAR SpecialUserApcPending : 01; // 0x01;
	/*002a*/ UCHAR UserApcPending : 01; // 0x02;
	/*0030*/
};

struct _KDESCRIPTOR {
	/*0000*/ USHORT Pad[0x3];
	/*0006*/ USHORT Limit;
	/*0008*/ void * Base;
	/*0010*/
};

struct _KDEVICE_QUEUE {
	/*0000*/ SHORT Type;
	/*0002*/ SHORT Size;
	/*0008*/ _LIST_ENTRY DeviceListHead;
	/*0018*/ ULONGLONG Lock;
	/*0020*/ UCHAR Busy;
	/*0020*/ LONGLONG Reserved : 08; // 0x00000000000000ff;
	/*0020*/ LONGLONG Hint : 56; // 0xffffffffffffff00;
	/*0028*/
};

struct _KDEVICE_QUEUE_ENTRY {
	/*0000*/ _LIST_ENTRY DeviceListEntry;
	/*0010*/ ULONG SortKey;
	/*0014*/ UCHAR Inserted;
	/*0018*/
};

struct _KDPC {
	/*0000*/ ULONG TargetInfoAsUlong;
	/*0000*/ UCHAR Type;
	/*0001*/ UCHAR Importance;
	/*0002*/ USHORT volatile Number;
	/*0008*/ _SINGLE_LIST_ENTRY DpcListEntry;
	/*0010*/ ULONGLONG ProcessorHistory;
	/*0018*/ void (* DeferredRoutine)( _KDPC * , void * , void * , void * );
	/*0020*/ void * DeferredContext;
	/*0028*/ void * SystemArgument1;
	/*0030*/ void * SystemArgument2;
	/*0038*/ void * DpcData;
	/*0040*/
};

struct _KDPC_DATA {
	/*0000*/ _KDPC_LIST DpcList;
	/*0010*/ ULONGLONG DpcLock;
	/*0018*/ LONG volatile DpcQueueDepth;
	/*001c*/ ULONG DpcCount;
	/*0020*/ _KDPC * volatile ActiveDpc;
	/*0028*/
};

struct _KDPC_LIST {
	/*0000*/ _SINGLE_LIST_ENTRY ListHead;
	/*0008*/ _SINGLE_LIST_ENTRY * LastEntry;
	/*0010*/
};

struct _KENLISTMENT {
	/*0000*/ ULONG cookie;
	/*0008*/ _KTMOBJECT_NAMESPACE_LINK NamespaceLink;
	/*0030*/ _GUID EnlistmentId;
	/*0040*/ _KMUTANT Mutex;
	/*0078*/ _LIST_ENTRY NextSameTx;
	/*0088*/ _LIST_ENTRY NextSameRm;
	/*0098*/ _KRESOURCEMANAGER * ResourceManager;
	/*00a0*/ _KTRANSACTION * Transaction;
	/*00a8*/ _KENLISTMENT_STATE State;
	/*00ac*/ ULONG Flags;
	/*00b0*/ ULONG NotificationMask;
	/*00b8*/ void * Key;
	/*00c0*/ ULONG KeyRefCount;
	/*00c8*/ void * RecoveryInformation;
	/*00d0*/ ULONG RecoveryInformationLength;
	/*00d8*/ void * DynamicNameInformation;
	/*00e0*/ ULONG DynamicNameInformationLength;
	/*00e8*/ _KTMNOTIFICATION_PACKET * FinalNotification;
	/*00f0*/ _KENLISTMENT * SupSubEnlistment;
	/*00f8*/ void * SupSubEnlHandle;
	/*0100*/ void * SubordinateTxHandle;
	/*0108*/ _GUID CrmEnlistmentEnId;
	/*0118*/ _GUID CrmEnlistmentTmId;
	/*0128*/ _GUID CrmEnlistmentRmId;
	/*0138*/ ULONG NextHistory;
	/*013c*/ _KENLISTMENT_HISTORY History[0x14];
	/*01e0*/
};

struct _KENLISTMENT_HISTORY {
	/*0000*/ ULONG Notification;
	/*0004*/ _KENLISTMENT_STATE NewState;
	/*0008*/
};

enum _KENLISTMENT_STATE {
	KEnlistmentUninitialized = 0x0,
	KEnlistmentActive = 0x100,
	KEnlistmentPreparing = 0x101,
	KEnlistmentPrepared = 0x102,
	KEnlistmentInDoubt = 0x103,
	KEnlistmentCommitted = 0x104,
	KEnlistmentCommittedNotify = 0x105,
	KEnlistmentCommitRequested = 0x106,
	KEnlistmentAborted = 0x107,
	KEnlistmentDelegated = 0x108,
	KEnlistmentDelegatedDisconnected = 0x109,
	KEnlistmentPrePreparing = 0x10a,
	KEnlistmentForgotten = 0x10b,
	KEnlistmentRecovering = 0x10c,
	KEnlistmentAborting = 0x10d,
	KEnlistmentReadOnly = 0x10e,
	KEnlistmentOutcomeUnavailable = 0x10f,
	KEnlistmentOffline = 0x110,
	KEnlistmentPrePrepared = 0x111,
	KEnlistmentInitialized = 0x112
};

struct _KENTROPY_TIMING_STATE {
	/*0000*/ ULONG EntropyCount;
	/*0004*/ ULONG Buffer[0x40];
	/*0108*/ _KDPC Dpc;
	/*0148*/ ULONG LastDeliveredBuffer;
	/*0150*/
};

enum _KERNEL_STACK_LIMITS {
	BugcheckStackLimits = 0x0,
	DPCStackLimits = 0x1,
	ExpandedStackLimits = 0x2,
	NormalStackLimits = 0x3,
	Win32kStackLimits = 0x4,
	SwapBusyStackLimits = 0x5,
	IsrStackLimits = 0x6,
	DebuggerStackLimits = 0x7,
	NmiStackLimits = 0x8,
	MachineCheckStackLimits = 0x9,
	ExceptionStackLimits = 0xa,
	MaximumStackLimits = 0xb
};

struct _KERNEL_STACK_SEGMENT {
	/*0000*/ ULONGLONG StackBase;
	/*0008*/ ULONGLONG StackLimit;
	/*0010*/ ULONGLONG KernelStack;
	/*0018*/ ULONGLONG InitialStack;
	/*0020*/
};

struct _KEVENT {
	/*0000*/ _DISPATCHER_HEADER Header;
	/*0018*/
};

struct _KEXCEPTION_FRAME {
	/*0000*/ ULONGLONG P1Home;
	/*0008*/ ULONGLONG P2Home;
	/*0010*/ ULONGLONG P3Home;
	/*0018*/ ULONGLONG P4Home;
	/*0020*/ ULONGLONG P5;
	/*0028*/ ULONGLONG Spare1;
	/*0030*/ _M128A Xmm6;
	/*0040*/ _M128A Xmm7;
	/*0050*/ _M128A Xmm8;
	/*0060*/ _M128A Xmm9;
	/*0070*/ _M128A Xmm10;
	/*0080*/ _M128A Xmm11;
	/*0090*/ _M128A Xmm12;
	/*00a0*/ _M128A Xmm13;
	/*00b0*/ _M128A Xmm14;
	/*00c0*/ _M128A Xmm15;
	/*00d0*/ ULONGLONG TrapFrame;
	/*00d8*/ ULONGLONG OutputBuffer;
	/*00e0*/ ULONGLONG OutputLength;
	/*00e8*/ ULONGLONG Spare2;
	/*00f0*/ ULONGLONG MxCsr;
	/*00f8*/ ULONGLONG Rbp;
	/*0100*/ ULONGLONG Rbx;
	/*0108*/ ULONGLONG Rdi;
	/*0110*/ ULONGLONG Rsi;
	/*0118*/ ULONGLONG R12;
	/*0120*/ ULONGLONG R13;
	/*0128*/ ULONGLONG R14;
	/*0130*/ ULONGLONG R15;
	/*0138*/ ULONGLONG Return;
	/*0140*/
};

union _KEXECUTE_OPTIONS {
	/*0000*/ UCHAR ExecuteDisable : 01; // 0x01;
	/*0000*/ UCHAR ExecuteEnable : 01; // 0x02;
	/*0000*/ UCHAR DisableThunkEmulation : 01; // 0x04;
	/*0000*/ UCHAR Permanent : 01; // 0x08;
	/*0000*/ UCHAR ExecuteDispatchEnable : 01; // 0x10;
	/*0000*/ UCHAR ImageDispatchEnable : 01; // 0x20;
	/*0000*/ UCHAR DisableExceptionChainValidation : 01; // 0x40;
	/*0000*/ UCHAR Spare : 01; // 0x80;
	/*0000*/ UCHAR volatile ExecuteOptions;
	/*0000*/ UCHAR ExecuteOptionsNV;
	/*0001*/
};

enum _KE_WAKE_SOURCE_TYPE {
	KeWakeSourceTypeSpuriousWake = 0x0,
	KeWakeSourceTypeSpuriousClock = 0x1,
	KeWakeSourceTypeSpuriousInterrupt = 0x2,
	KeWakeSourceTypeQueryFailure = 0x3,
	KeWakeSourceTypeAccountingFailure = 0x4,
	KeWakeSourceTypeStaticSourceMax = 0x4,
	KeWakeSourceTypeInterrupt = 0x5,
	KeWakeSourceTypeIRTimer = 0x6,
	KeWakeSourceTypeMax = 0x7
};

struct _KFLOATING_SAVE {
	/*0000*/ ULONG Dummy;
	/*0004*/
};

struct _KGATE {
	/*0000*/ _DISPATCHER_HEADER Header;
	/*0018*/
};

union _KGDTENTRY64 {
	/*0000*/ USHORT LimitLow;
	/*0002*/ USHORT BaseLow;
	struct {
		/*0004*/ UCHAR BaseMiddle;
		/*0005*/ UCHAR Flags1;
		/*0006*/ UCHAR Flags2;
		/*0007*/ UCHAR BaseHigh;
		/*0008*/
	} Bytes;
	struct {
		/*0004*/ ULONG BaseMiddle : 08; // 0x000000ff;
		/*0004*/ ULONG Type : 05; // 0x00001f00;
		/*0004*/ ULONG Dpl : 02; // 0x00006000;
		/*0004*/ ULONG Present : 01; // 0x00008000;
		/*0004*/ ULONG LimitHigh : 04; // 0x000f0000;
		/*0004*/ ULONG System : 01; // 0x00100000;
		/*0004*/ ULONG LongMode : 01; // 0x00200000;
		/*0004*/ ULONG DefaultBig : 01; // 0x00400000;
		/*0004*/ ULONG Granularity : 01; // 0x00800000;
		/*0004*/ ULONG BaseHigh : 08; // 0xff000000;
		/*0008*/
	} Bits;
	/*0008*/ ULONG BaseUpper;
	/*000c*/ ULONG MustBeZero;
	/*0000*/ LONGLONG DataLow;
	/*0008*/ LONGLONG DataHigh;
	/*0010*/
};

enum _KHETERO_CPU_POLICY {
	KHeteroCpuPolicyAll = 0x0,
	KHeteroCpuPolicyLarge = 0x1,
	KHeteroCpuPolicyLargeOrIdle = 0x2,
	KHeteroCpuPolicySmall = 0x3,
	KHeteroCpuPolicySmallOrIdle = 0x4,
	KHeteroCpuPolicyDynamic = 0x5,
	KHeteroCpuPolicyStaticMax = 0x5,
	KHeteroCpuPolicyBiasedSmall = 0x6,
	KHeteroCpuPolicyBiasedLarge = 0x7,
	KHeteroCpuPolicyDefault = 0x8,
	KHeteroCpuPolicyMax = 0x9
};

enum _KHETERO_CPU_QOS {
	KHeteroCpuQosDefault = 0x0,
	KHeteroCpuQosHigh = 0x0,
	KHeteroCpuQosMedium = 0x1,
	KHeteroCpuQosLow = 0x2,
	KHeteroCpuQosMultimedia = 0x3,
	KHeteroCpuQosDynamic = 0x4,
	KHeteroCpuQosMax = 0x4
};

struct _KHETERO_PROCESSOR_SET {
	/*0000*/ ULONGLONG IdealMask;
	/*0008*/ ULONGLONG PreferredMask;
	/*0010*/ ULONGLONG AvailableMask;
	/*0018*/
};

enum _KHETERO_RUNNING_TYPE {
	KHeteroShortRunning = 0x0,
	KHeteroLongRunning = 0x1,
	KHeteroRunningTypeMax = 0x2
};

union _KIDTENTRY64 {
	/*0000*/ USHORT OffsetLow;
	/*0002*/ USHORT Selector;
	/*0004*/ USHORT IstIndex : 03; // 0x0007;
	/*0004*/ USHORT Reserved0 : 05; // 0x00f8;
	/*0004*/ USHORT Type : 05; // 0x1f00;
	/*0004*/ USHORT Dpl : 02; // 0x6000;
	/*0004*/ USHORT Present : 01; // 0x8000;
	/*0006*/ USHORT OffsetMiddle;
	/*0008*/ ULONG OffsetHigh;
	/*000c*/ ULONG Reserved1;
	/*0000*/ ULONGLONG Alignment;
	/*0010*/
};

struct _KINTERRUPT {
	/*0000*/ SHORT Type;
	/*0002*/ SHORT Size;
	/*0008*/ _LIST_ENTRY InterruptListEntry;
	/*0018*/ UCHAR (* ServiceRoutine)( _KINTERRUPT * , void * );
	/*0020*/ UCHAR (* MessageServiceRoutine)( _KINTERRUPT * , void * , ULONG );
	/*0028*/ ULONG MessageIndex;
	/*0030*/ void * ServiceContext;
	/*0038*/ ULONGLONG SpinLock;
	/*0040*/ ULONG TickCount;
	/*0048*/ ULONGLONG * ActualLock;
	/*0050*/ void (* DispatchAddress)();
	/*0058*/ ULONG Vector;
	/*005c*/ UCHAR Irql;
	/*005d*/ UCHAR SynchronizeIrql;
	/*005e*/ UCHAR FloatingSave;
	/*005f*/ UCHAR Connected;
	/*0060*/ ULONG Number;
	/*0064*/ UCHAR ShareVector;
	/*0065*/ UCHAR EmulateActiveBoth;
	/*0066*/ USHORT ActiveCount;
	/*0068*/ LONG InternalState;
	/*006c*/ _KINTERRUPT_MODE Mode;
	/*0070*/ _KINTERRUPT_POLARITY Polarity;
	/*0074*/ ULONG ServiceCount;
	/*0078*/ ULONG DispatchCount;
	/*0080*/ _KEVENT * PassiveEvent;
	/*0088*/ _KTRAP_FRAME * TrapFrame;
	/*0090*/ void * DisconnectData;
	/*0098*/ _KTHREAD * volatile ServiceThread;
	/*00a0*/ _INTERRUPT_CONNECTION_DATA * ConnectionData;
	/*00a8*/ void * IntTrackEntry;
	/*00b0*/ _ISRDPCSTATS IsrDpcStats;
	/*00f0*/ void * RedirectObject;
	/*00f8*/ UCHAR Padding[0x8];
	/*0100*/
};

enum _KINTERRUPT_MODE {
	LevelSensitive = 0x0,
	Latched = 0x1
};

enum _KINTERRUPT_POLARITY {
	InterruptPolarityUnknown = 0x0,
	InterruptActiveHigh = 0x1,
	InterruptRisingEdge = 0x1,
	InterruptActiveLow = 0x2,
	InterruptFallingEdge = 0x2,
	InterruptActiveBoth = 0x3,
	InterruptActiveBothTriggerLow = 0x3,
	InterruptActiveBothTriggerHigh = 0x4
};

struct _KIST_BASE_FRAME {
	/*0000*/ _KPCR * KernelGsBase;
	/*0008*/ _KIST_LINK_FRAME * IstStack;
	/*0010*/ ULONGLONG PreviousGsBase;
	/*0018*/ ULONGLONG PreviousCr3;
	/*0020*/ ULONGLONG IstPad;
	/*0028*/ ULONGLONG Reserved;
	/*0030*/
};

struct _KIST_LINK_FRAME {
	/*0000*/ _KIST_BASE_FRAME * IstBaseFrame;
	/*0008*/ ULONG Signature;
	/*000c*/ ULONG Reserved0;
	/*0010*/ ULONGLONG Reserved[0x2];
	/*0020*/
};

enum _KI_CALLBACK {
	KiCallbackNmi = 0x0,
	KiCallbackBound = 0x1,
	KiCallbackSx = 0x2,
	KiCallbackCount = 0x3,
	KiFirstCallback = 0x0
};

struct _KLDR_DATA_TABLE_ENTRY {
	/*0000*/ _LIST_ENTRY InLoadOrderLinks;
	/*0010*/ void * ExceptionTable;
	/*0018*/ ULONG ExceptionTableSize;
	/*0020*/ void * GpValue;
	/*0028*/ _NON_PAGED_DEBUG_INFO * NonPagedDebugInfo;
	/*0030*/ void * DllBase;
	/*0038*/ void * EntryPoint;
	/*0040*/ ULONG SizeOfImage;
	/*0048*/ _UNICODE_STRING FullDllName;
	/*0058*/ _UNICODE_STRING BaseDllName;
	/*0068*/ ULONG Flags;
	/*006c*/ USHORT LoadCount;
	union {
		/*006e*/ USHORT SignatureLevel : 04; // 0x000f;
		/*006e*/ USHORT SignatureType : 03; // 0x0070;
		/*006e*/ USHORT Unused : 09; // 0xff80;
		/*006e*/ USHORT EntireField;
		/*0070*/
	} u1;
	/*0070*/ void * SectionPointer;
	/*0078*/ ULONG CheckSum;
	/*007c*/ ULONG CoverageSectionSize;
	/*0080*/ void * CoverageSection;
	/*0088*/ void * LoadedImports;
	/*0090*/ void * Spare;
	/*0098*/ ULONG SizeOfImageNotRounded;
	/*009c*/ ULONG TimeDateStamp;
	/*00a0*/
};

struct _KLOCK_ENTRY {
	/*0000*/ _RTL_BALANCED_NODE TreeNode;
	/*0000*/ _SINGLE_LIST_ENTRY FreeListEntry;
	/*0018*/ ULONG EntryFlags;
	/*0018*/ UCHAR EntryOffset;
	/*0019*/ UCHAR ThreadLocalFlags;
	/*0019*/ UCHAR WaitingBit : 01; // 0x01;
	/*0019*/ UCHAR Spare0 : 07; // 0xfe;
	/*001a*/ UCHAR AcquiredByte;
	/*001a*/ UCHAR AcquiredBit : 01; // 0x01;
	/*001b*/ UCHAR CrossThreadFlags;
	/*001b*/ UCHAR HeadNodeBit : 01; // 0x01;
	/*001b*/ UCHAR IoPriorityBit : 01; // 0x02;
	/*001b*/ UCHAR IoQoSWaiter : 01; // 0x04;
	/*001b*/ UCHAR Spare1 : 05; // 0xf8;
	/*0018*/ ULONG StaticState : 08; // 0x000000ff;
	/*0018*/ ULONG AllFlags : 24; // 0xffffff00;
	/*001c*/ ULONG SpareFlags;
	/*0020*/ _KLOCK_ENTRY_LOCK_STATE LockState;
	/*0020*/ void * volatile LockUnsafe;
	/*0020*/ UCHAR volatile CrossThreadReleasableAndBusyByte;
	/*0021*/ UCHAR Reserved[0x6];
	/*0027*/ UCHAR volatile InTreeByte;
	/*0028*/ void * SessionState;
	/*0028*/ ULONG SessionId;
	/*002c*/ ULONG SessionPad;
	/*0030*/ _RTL_RB_TREE OwnerTree;
	/*0040*/ _RTL_RB_TREE WaiterTree;
	/*0030*/ CHAR CpuPriorityKey;
	/*0050*/ ULONGLONG EntryLock;
	/*0058*/ _KLOCK_ENTRY_BOOST_BITMAP BoostBitmap;
	/*005c*/ ULONG SparePad;
	/*0060*/
};

union _KLOCK_ENTRY_BOOST_BITMAP {
	/*0000*/ ULONG AllFields;
	/*0000*/ ULONG AllBoosts : 17; // 0x0001ffff;
	/*0000*/ ULONG Reserved : 15; // 0xfffe0000;
	/*0000*/ USHORT CpuBoostsBitmap : 15; // 0x7fff;
	/*0000*/ USHORT IoBoost : 01; // 0x8000;
	/*0002*/ USHORT IoQoSBoost : 01; // 0x0001;
	/*0002*/ USHORT IoNormalPriorityWaiterCount : 08; // 0x01fe;
	/*0002*/ USHORT IoQoSWaiterCount : 07; // 0xfe00;
	/*0004*/
};

struct _KLOCK_ENTRY_LOCK_STATE {
	/*0000*/ ULONGLONG CrossThreadReleasable : 01; // 0x0000000000000001;
	/*0000*/ ULONGLONG Busy : 01; // 0x0000000000000002;
	/*0000*/ ULONGLONG Reserved : 61; // 0x7ffffffffffffffc;
	/*0000*/ ULONGLONG InTree : 01; // 0x8000000000000000;
	/*0000*/ void * LockState;
	/*0008*/ void * SessionState;
	/*0008*/ ULONG SessionId;
	/*000c*/ ULONG SessionPad;
	/*0010*/
};

struct _KLOCK_QUEUE_HANDLE {
	/*0000*/ _KSPIN_LOCK_QUEUE LockQueue;
	/*0010*/ UCHAR OldIrql;
	/*0018*/
};

struct _KMUTANT {
	/*0000*/ _DISPATCHER_HEADER Header;
	/*0018*/ _LIST_ENTRY MutantListEntry;
	/*0028*/ _KTHREAD * OwnerThread;
	/*0030*/ UCHAR MutantFlags;
	/*0030*/ UCHAR Abandoned : 01; // 0x01;
	/*0030*/ UCHAR Spare1 : 07; // 0xfe;
	/*0030*/ UCHAR Abandoned2 : 01; // 0x01;
	/*0030*/ UCHAR AbEnabled : 01; // 0x02;
	/*0030*/ UCHAR Spare2 : 06; // 0xfc;
	/*0031*/ UCHAR ApcDisable;
	/*0038*/
};

struct _KNODE {
	/*0000*/ ULONGLONG IdleNonParkedCpuSet;
	/*0008*/ ULONGLONG IdleSmtSet;
	/*0010*/ ULONGLONG IdleCpuSet;
	/*0040*/ ULONGLONG DeepIdleSet;
	/*0048*/ ULONGLONG IdleConstrainedSet;
	/*0050*/ ULONGLONG NonParkedSet;
	/*0058*/ ULONGLONG NonIsrTargetedSet;
	/*0060*/ LONG ParkLock;
	/*0064*/ USHORT ThreadSeed;
	/*0066*/ USHORT ProcessSeed;
	/*0080*/ ULONG SiblingMask;
	/*0088*/ _GROUP_AFFINITY Affinity;
	/*0088*/ UCHAR AffinityFill[0xa];
	/*0092*/ USHORT NodeNumber;
	/*0094*/ USHORT PrimaryNodeNumber;
	/*0096*/ USHORT Spare0;
	/*0098*/ ULONGLONG SharedReadyQueueMask;
	/*00a0*/ ULONGLONG StrideMask;
	/*00a8*/ ULONG ProximityId;
	/*00ac*/ ULONG Lowest;
	/*00b0*/ ULONG Highest;
	/*00b4*/ UCHAR MaximumProcessors;
	/*00b5*/ _flags Flags;
	/*00b6*/ UCHAR Spare10;
	/*00b8*/ _KHETERO_PROCESSOR_SET HeteroSets[0x5];
	/*0130*/ ULONGLONG PpmConfiguredQosSets[0x4];
	/*0150*/ ULONGLONG LLCLeaders;
	/*0180*/
};

enum _KOBJECTS {
	EventNotificationObject = 0x0,
	EventSynchronizationObject = 0x1,
	MutantObject = 0x2,
	ProcessObject = 0x3,
	QueueObject = 0x4,
	SemaphoreObject = 0x5,
	ThreadObject = 0x6,
	GateObject = 0x7,
	TimerNotificationObject = 0x8,
	TimerSynchronizationObject = 0x9,
	Spare2Object = 0xa,
	Spare3Object = 0xb,
	Spare4Object = 0xc,
	Spare5Object = 0xd,
	Spare6Object = 0xe,
	Spare7Object = 0xf,
	Spare8Object = 0x10,
	ProfileCallbackObject = 0x11,
	ApcObject = 0x12,
	DpcObject = 0x13,
	DeviceQueueObject = 0x14,
	PriQueueObject = 0x15,
	InterruptObject = 0x16,
	ProfileObject = 0x17,
	Timer2NotificationObject = 0x18,
	Timer2SynchronizationObject = 0x19,
	ThreadedDpcObject = 0x1a,
	MaximumKernelObject = 0x1b
};

struct _KPCR {
	/*0000*/ _NT_TIB NtTib;
	/*0000*/ _KGDTENTRY64 * GdtBase;
	/*0008*/ _KTSS64 * TssBase;
	/*0010*/ ULONGLONG UserRsp;
	/*0018*/ _KPCR * Self;
	/*0020*/ _KPRCB * CurrentPrcb;
	/*0028*/ _KSPIN_LOCK_QUEUE * LockArray;
	/*0030*/ void * Used_Self;
	/*0038*/ _KIDTENTRY64 * IdtBase;
	/*0040*/ ULONGLONG Unused[0x2];
	/*0050*/ UCHAR Irql;
	/*0051*/ UCHAR SecondLevelCacheAssociativity;
	/*0052*/ UCHAR ObsoleteNumber;
	/*0053*/ UCHAR Fill0;
	/*0054*/ ULONG Unused0[0x3];
	/*0060*/ USHORT MajorVersion;
	/*0062*/ USHORT MinorVersion;
	/*0064*/ ULONG StallScaleFactor;
	/*0068*/ void * Unused1[0x3];
	/*0080*/ ULONG KernelReserved[0xf];
	/*00bc*/ ULONG SecondLevelCacheSize;
	/*00c0*/ ULONG HalReserved[0x10];
	/*0100*/ ULONG Unused2;
	/*0108*/ void * KdVersionBlock;
	/*0110*/ void * Unused3;
	/*0118*/ ULONG PcrAlign1[0x18];
	/*0180*/ _KPRCB Prcb;
	/*9080*/
};

struct _KPRCB {
	/*0000*/ ULONG MxCsr;
	/*0004*/ UCHAR LegacyNumber;
	/*0005*/ UCHAR ReservedMustBeZero;
	/*0006*/ UCHAR InterruptRequest;
	/*0007*/ UCHAR IdleHalt;
	/*0008*/ _KTHREAD * CurrentThread;
	/*0010*/ _KTHREAD * NextThread;
	/*0018*/ _KTHREAD * IdleThread;
	/*0020*/ UCHAR NestingLevel;
	/*0021*/ UCHAR ClockOwner;
	/*0022*/ UCHAR PendingTickFlags;
	/*0022*/ UCHAR PendingTick : 01; // 0x01;
	/*0022*/ UCHAR PendingBackupTick : 01; // 0x02;
	/*0023*/ UCHAR IdleState;
	/*0024*/ ULONG Number;
	/*0028*/ ULONGLONG RspBase;
	/*0030*/ ULONGLONG PrcbLock;
	/*0038*/ CHAR * PriorityState;
	/*0040*/ CHAR CpuType;
	/*0041*/ CHAR CpuID;
	/*0042*/ USHORT CpuStep;
	/*0042*/ UCHAR CpuStepping;
	/*0043*/ UCHAR CpuModel;
	/*0044*/ ULONG MHz;
	/*0048*/ ULONGLONG HalReserved[0x8];
	/*0088*/ USHORT MinorVersion;
	/*008a*/ USHORT MajorVersion;
	/*008c*/ UCHAR BuildType;
	/*008d*/ UCHAR CpuVendor;
	/*008e*/ UCHAR CoresPerPhysicalProcessor;
	/*008f*/ UCHAR LogicalProcessorsPerCore;
	/*0090*/ ULONGLONG TscFrequency;
	/*0098*/ ULONGLONG PrcbPad04[0x5];
	/*00c0*/ _KNODE * ParentNode;
	/*00c8*/ ULONGLONG GroupSetMember;
	/*00d0*/ UCHAR Group;
	/*00d1*/ UCHAR GroupIndex;
	/*00d2*/ UCHAR PrcbPad05[0x2];
	/*00d4*/ ULONG InitialApicId;
	/*00d8*/ ULONG ScbOffset;
	/*00dc*/ ULONG ApicMask;
	/*00e0*/ void * AcpiReserved;
	/*00e8*/ ULONG CFlushSize;
	/*00ec*/ _KPRCBFLAG PrcbFlags;
	/*00f0*/ ULONGLONG TrappedSecurityDomain;
	/*00f8*/ UCHAR BpbState;
	/*00f8*/ UCHAR BpbCpuIdle : 01; // 0x01;
	/*00f8*/ UCHAR BpbFlushRsbOnTrap : 01; // 0x02;
	/*00f8*/ UCHAR BpbIbpbOnReturn : 01; // 0x04;
	/*00f8*/ UCHAR BpbIbpbOnTrap : 01; // 0x08;
	/*00f8*/ UCHAR BpbIbpbOnRetpolineExit : 01; // 0x10;
	/*00f8*/ UCHAR BpbStateReserved : 03; // 0xe0;
	/*00f9*/ UCHAR BpbFeatures;
	/*00f9*/ UCHAR BpbClearOnIdle : 01; // 0x01;
	/*00f9*/ UCHAR BpbEnabled : 01; // 0x02;
	/*00f9*/ UCHAR BpbSmep : 01; // 0x04;
	/*00f9*/ UCHAR BpbFeaturesReserved : 05; // 0xf8;
	/*00fa*/ UCHAR BpbCurrentSpecCtrl;
	/*00fb*/ UCHAR BpbKernelSpecCtrl;
	/*00fc*/ UCHAR BpbNmiSpecCtrl;
	/*00fd*/ UCHAR BpbUserSpecCtrl;
	/*00fe*/ SHORT volatile PairRegister;
	/*00f0*/ ULONGLONG PrcbPad11[0x2];
	/*0100*/ _KPROCESSOR_STATE ProcessorState;
	/*06c0*/ _XSAVE_AREA_HEADER * ExtendedSupervisorState;
	/*06c8*/ ULONG ProcessorSignature;
	/*06cc*/ ULONG ProcessorFlags;
	/*06d0*/ UCHAR BpbRetpolineExitSpecCtrl;
	/*06d1*/ UCHAR BpbTrappedRetpolineExitSpecCtrl;
	/*06d2*/ UCHAR BpbTrappedBpbState;
	/*06d2*/ UCHAR BpbTrappedCpuIdle : 01; // 0x01;
	/*06d2*/ UCHAR BpbTrappedFlushRsbOnTrap : 01; // 0x02;
	/*06d2*/ UCHAR BpbTrappedIbpbOnReturn : 01; // 0x04;
	/*06d2*/ UCHAR BpbTrappedIbpbOnTrap : 01; // 0x08;
	/*06d2*/ UCHAR BpbTrappedIbpbOnRetpolineExit : 01; // 0x10;
	/*06d2*/ UCHAR BpbtrappedBpbStateReserved : 03; // 0xe0;
	/*06d3*/ UCHAR BpbRetpolineState;
	/*06d3*/ UCHAR BpbRunningNonRetpolineCode : 01; // 0x01;
	/*06d3*/ UCHAR BpbIndirectCallsSafe : 01; // 0x02;
	/*06d3*/ UCHAR BpbRetpolineEnabled : 01; // 0x04;
	/*06d3*/ UCHAR BpbRetpolineStateReserved : 05; // 0xf8;
	/*06d4*/ ULONG PrcbPad12b;
	/*06d0*/ ULONGLONG PrcbPad12a;
	/*06d8*/ ULONGLONG PrcbPad12[0x3];
	/*06f0*/ _KSPIN_LOCK_QUEUE LockQueue[0x11];
	/*0800*/ _PP_LOOKASIDE_LIST PPLookasideList[0x10];
	/*0900*/ _GENERAL_LOOKASIDE_POOL PPNxPagedLookasideList[0x20];
	/*1500*/ _GENERAL_LOOKASIDE_POOL PPNPagedLookasideList[0x20];
	/*2100*/ _GENERAL_LOOKASIDE_POOL PPPagedLookasideList[0x20];
	/*2d00*/ ULONGLONG PrcbPad20;
	/*2d08*/ _SINGLE_LIST_ENTRY DeferredReadyListHead;
	/*2d10*/ LONG volatile MmPageFaultCount;
	/*2d14*/ LONG volatile MmCopyOnWriteCount;
	/*2d18*/ LONG volatile MmTransitionCount;
	/*2d1c*/ LONG volatile MmDemandZeroCount;
	/*2d20*/ LONG volatile MmPageReadCount;
	/*2d24*/ LONG volatile MmPageReadIoCount;
	/*2d28*/ LONG volatile MmDirtyPagesWriteCount;
	/*2d2c*/ LONG volatile MmDirtyWriteIoCount;
	/*2d30*/ LONG volatile MmMappedPagesWriteCount;
	/*2d34*/ LONG volatile MmMappedWriteIoCount;
	/*2d38*/ ULONG KeSystemCalls;
	/*2d3c*/ ULONG KeContextSwitches;
	/*2d40*/ ULONG PrcbPad40;
	/*2d44*/ ULONG CcFastReadNoWait;
	/*2d48*/ ULONG CcFastReadWait;
	/*2d4c*/ ULONG CcFastReadNotPossible;
	/*2d50*/ ULONG CcCopyReadNoWait;
	/*2d54*/ ULONG CcCopyReadWait;
	/*2d58*/ ULONG CcCopyReadNoWaitMiss;
	/*2d5c*/ LONG volatile IoReadOperationCount;
	/*2d60*/ LONG volatile IoWriteOperationCount;
	/*2d64*/ LONG volatile IoOtherOperationCount;
	/*2d68*/ _LARGE_INTEGER IoReadTransferCount;
	/*2d70*/ _LARGE_INTEGER IoWriteTransferCount;
	/*2d78*/ _LARGE_INTEGER IoOtherTransferCount;
	/*2d80*/ LONG volatile PacketBarrier;
	/*2d84*/ LONG volatile TargetCount;
	/*2d88*/ ULONG volatile IpiFrozen;
	/*2d8c*/ ULONG PrcbPad30;
	/*2d90*/ void * IsrDpcStats;
	/*2d98*/ ULONG DeviceInterrupts;
	/*2d9c*/ LONG LookasideIrpFloat;
	/*2da0*/ ULONG InterruptLastCount;
	/*2da4*/ ULONG InterruptRate;
	/*2da8*/ ULONGLONG LastNonHrTimerExpiration;
	/*2db0*/ _KPRCB * PairPrcb;
	/*2db8*/ ULONGLONG PrcbPad35[0x1];
	/*2dc0*/ _SLIST_HEADER InterruptObjectPool;
	/*2dd0*/ ULONGLONG PrcbPad41[0x6];
	/*2e00*/ _KDPC_DATA DpcData[0x2];
	/*2e50*/ void * DpcStack;
	/*2e58*/ LONG MaximumDpcQueueDepth;
	/*2e5c*/ ULONG DpcRequestRate;
	/*2e60*/ ULONG MinimumDpcRate;
	/*2e64*/ ULONG DpcLastCount;
	/*2e68*/ UCHAR ThreadDpcEnable;
	/*2e69*/ UCHAR volatile QuantumEnd;
	/*2e6a*/ UCHAR volatile DpcRoutineActive;
	/*2e6b*/ UCHAR volatile IdleSchedule;
	/*2e6c*/ LONG volatile DpcRequestSummary;
	/*2e6c*/ SHORT DpcRequestSlot[0x2];
	/*2e6c*/ SHORT NormalDpcState;
	/*2e6e*/ SHORT ThreadDpcState;
	/*2e6c*/ ULONG DpcNormalProcessingActive : 01; // 0x00000001;
	/*2e6c*/ ULONG DpcNormalProcessingRequested : 01; // 0x00000002;
	/*2e6c*/ ULONG DpcNormalThreadSignal : 01; // 0x00000004;
	/*2e6c*/ ULONG DpcNormalTimerExpiration : 01; // 0x00000008;
	/*2e6c*/ ULONG DpcNormalDpcPresent : 01; // 0x00000010;
	/*2e6c*/ ULONG DpcNormalLocalInterrupt : 01; // 0x00000020;
	/*2e6c*/ ULONG DpcNormalSpare : 10; // 0x0000ffc0;
	/*2e6c*/ ULONG DpcThreadActive : 01; // 0x00010000;
	/*2e6c*/ ULONG DpcThreadRequested : 01; // 0x00020000;
	/*2e6c*/ ULONG DpcThreadSpare : 14; // 0xfffc0000;
	/*2e70*/ ULONG LastTimerHand;
	/*2e74*/ ULONG LastTick;
	/*2e78*/ ULONG ClockInterrupts;
	/*2e7c*/ ULONG ReadyScanTick;
	/*2e80*/ void * InterruptObject[0x100];
	/*3680*/ _KTIMER_TABLE TimerTable;
	/*5880*/ _KGATE DpcGate;
	/*5898*/ void * PrcbPad52;
	/*58a0*/ _KDPC CallDpc;
	/*58e0*/ LONG ClockKeepAlive;
	/*58e4*/ UCHAR PrcbPad60[0x2];
	/*58e6*/ USHORT NmiActive;
	/*58e8*/ LONG DpcWatchdogPeriod;
	/*58ec*/ LONG DpcWatchdogCount;
	/*58f0*/ LONG volatile KeSpinLockOrdering;
	/*58f4*/ ULONG DpcWatchdogProfileCumulativeDpcThreshold;
	/*58f8*/ void * CachedPtes;
	/*5900*/ _LIST_ENTRY WaitListHead;
	/*5910*/ ULONGLONG WaitLock;
	/*5918*/ ULONG ReadySummary;
	/*591c*/ LONG AffinitizedSelectionMask;
	/*5920*/ ULONG QueueIndex;
	/*5924*/ ULONG PrcbPad75[0x3];
	/*5930*/ _KDPC TimerExpirationDpc;
	/*5970*/ _RTL_RB_TREE ScbQueue;
	/*5980*/ _LIST_ENTRY DispatcherReadyListHead[0x20];
	/*5b80*/ ULONG InterruptCount;
	/*5b84*/ ULONG KernelTime;
	/*5b88*/ ULONG UserTime;
	/*5b8c*/ ULONG DpcTime;
	/*5b90*/ ULONG InterruptTime;
	/*5b94*/ ULONG AdjustDpcThreshold;
	/*5b98*/ UCHAR DebuggerSavedIRQL;
	/*5b99*/ UCHAR GroupSchedulingOverQuota;
	/*5b9a*/ UCHAR volatile DeepSleep;
	/*5b9b*/ UCHAR PrcbPad80;
	/*5b9c*/ ULONG DpcTimeCount;
	/*5ba0*/ ULONG DpcTimeLimit;
	/*5ba4*/ ULONG PeriodicCount;
	/*5ba8*/ ULONG PeriodicBias;
	/*5bac*/ ULONG AvailableTime;
	/*5bb0*/ ULONG KeExceptionDispatchCount;
	/*5bb4*/ ULONG ReadyThreadCount;
	/*5bb8*/ ULONGLONG ReadyQueueExpectedRunTime;
	/*5bc0*/ ULONGLONG StartCycles;
	/*5bc8*/ ULONGLONG TaggedCyclesStart;
	/*5bd0*/ ULONGLONG TaggedCycles[0x2];
	/*5be0*/ ULONGLONG GenerationTarget;
	/*5be8*/ ULONGLONG AffinitizedCycles;
	/*5bf0*/ ULONGLONG ImportantCycles;
	/*5bf8*/ ULONGLONG UnimportantCycles;
	/*5c00*/ ULONG DpcWatchdogProfileSingleDpcThreshold;
	/*5c04*/ LONG volatile MmSpinLockOrdering;
	/*5c08*/ void * volatile CachedStack;
	/*5c10*/ ULONG PageColor;
	/*5c14*/ ULONG NodeColor;
	/*5c18*/ ULONG NodeShiftedColor;
	/*5c1c*/ ULONG SecondaryColorMask;
	/*5c20*/ UCHAR PrcbPad81[0x6];
	/*5c26*/ UCHAR ExceptionStackActive;
	/*5c27*/ UCHAR TbFlushListActive;
	/*5c28*/ void * ExceptionStack;
	/*5c30*/ ULONGLONG PrcbPad82[0x1];
	/*5c38*/ ULONGLONG CycleTime;
	/*5c40*/ ULONGLONG Cycles[0x4][0x2];
	/*5c80*/ ULONG CcFastMdlReadNoWait;
	/*5c84*/ ULONG CcFastMdlReadWait;
	/*5c88*/ ULONG CcFastMdlReadNotPossible;
	/*5c8c*/ ULONG CcMapDataNoWait;
	/*5c90*/ ULONG CcMapDataWait;
	/*5c94*/ ULONG CcPinMappedDataCount;
	/*5c98*/ ULONG CcPinReadNoWait;
	/*5c9c*/ ULONG CcPinReadWait;
	/*5ca0*/ ULONG CcMdlReadNoWait;
	/*5ca4*/ ULONG CcMdlReadWait;
	/*5ca8*/ ULONG CcLazyWriteHotSpots;
	/*5cac*/ ULONG CcLazyWriteIos;
	/*5cb0*/ ULONG CcLazyWritePages;
	/*5cb4*/ ULONG CcDataFlushes;
	/*5cb8*/ ULONG CcDataPages;
	/*5cbc*/ ULONG CcLostDelayedWrites;
	/*5cc0*/ ULONG CcFastReadResourceMiss;
	/*5cc4*/ ULONG CcCopyReadWaitMiss;
	/*5cc8*/ ULONG CcFastMdlReadResourceMiss;
	/*5ccc*/ ULONG CcMapDataNoWaitMiss;
	/*5cd0*/ ULONG CcMapDataWaitMiss;
	/*5cd4*/ ULONG CcPinReadNoWaitMiss;
	/*5cd8*/ ULONG CcPinReadWaitMiss;
	/*5cdc*/ ULONG CcMdlReadNoWaitMiss;
	/*5ce0*/ ULONG CcMdlReadWaitMiss;
	/*5ce4*/ ULONG CcReadAheadIos;
	/*5ce8*/ LONG volatile MmCacheTransitionCount;
	/*5cec*/ LONG volatile MmCacheReadCount;
	/*5cf0*/ LONG volatile MmCacheIoCount;
	/*5cf4*/ ULONG PrcbPad91;
	/*5cf8*/ void * MmInternal;
	/*5d00*/ _PROCESSOR_POWER_STATE PowerState;
	/*5f00*/ void * HyperPte;
	/*5f08*/ _LIST_ENTRY ScbList;
	/*5f18*/ _KDPC ForceIdleDpc;
	/*5f58*/ _KDPC DpcWatchdogDpc;
	/*5f98*/ _KTIMER DpcWatchdogTimer;
	/*5fd8*/ _CACHE_DESCRIPTOR Cache[0x5];
	/*6014*/ ULONG CacheCount;
	/*6018*/ ULONG volatile CachedCommit;
	/*601c*/ ULONG volatile CachedResidentAvailable;
	/*6020*/ void * WheaInfo;
	/*6028*/ void * EtwSupport;
	/*6030*/ void * ExSaPageArray;
	/*6038*/ ULONG KeAlignmentFixupCount;
	/*603c*/ ULONG PrcbPad95;
	/*6040*/ _SLIST_HEADER HypercallPageList;
	/*6050*/ ULONGLONG * StatisticsPage;
	/*6058*/ ULONGLONG PrcbPad85[0x5];
	/*6080*/ void * HypercallCachedPages;
	/*6088*/ void * VirtualApicAssist;
	/*6090*/ _KAFFINITY_EX PackageProcessorSet;
	/*6138*/ ULONG PackageId;
	/*613c*/ ULONG PrcbPad86;
	/*6140*/ ULONGLONG SharedReadyQueueMask;
	/*6148*/ _KSHARED_READY_QUEUE * SharedReadyQueue;
	/*6150*/ ULONG SharedQueueScanOwner;
	/*6154*/ ULONG ScanSiblingIndex;
	/*6158*/ ULONGLONG CoreProcessorSet;
	/*6160*/ ULONGLONG ScanSiblingMask;
	/*6168*/ ULONGLONG LLCMask;
	/*6170*/ ULONGLONG CacheProcessorMask[0x5];
	/*6198*/ _PROCESSOR_PROFILE_CONTROL_AREA * ProcessorProfileControlArea;
	/*61a0*/ void * ProfileEventIndexAddress;
	/*61a8*/ void * * DpcWatchdogProfile;
	/*61b0*/ void * * DpcWatchdogProfileCurrentEmptyCapture;
	/*61b8*/ void * SchedulerAssist;
	/*61c0*/ _SYNCH_COUNTERS SynchCounters;
	/*6278*/ ULONGLONG PrcbPad94;
	/*6280*/ _FILESYSTEM_DISK_COUNTERS FsCounters;
	/*6290*/ UCHAR VendorString[0xd];
	/*629d*/ UCHAR PrcbPad100[0x3];
	/*62a0*/ ULONGLONG FeatureBits;
	/*62a8*/ _LARGE_INTEGER UpdateSignature;
	/*62b0*/ ULONGLONG PteBitCache;
	/*62b8*/ ULONG PteBitOffset;
	/*62bc*/ ULONG PrcbPad105;
	/*62c0*/ _CONTEXT * Context;
	/*62c8*/ ULONG ContextFlagsInit;
	/*62cc*/ ULONG PrcbPad115;
	/*62d0*/ _XSAVE_AREA * ExtendedState;
	/*62d8*/ void * IsrStack;
	/*62e0*/ _KENTROPY_TIMING_STATE EntropyTimingState;
	/*6430*/ ULONGLONG PrcbPad110;
	struct {
		/*6438*/ ULONG UpdateCycle;
		/*643c*/ SHORT PairLocal;
		/*643c*/ UCHAR PairLocalLow;
		/*643d*/ UCHAR PairLocalForceStibp : 01; // 0x01;
		/*643d*/ UCHAR Reserved : 04; // 0x1e;
		/*643d*/ UCHAR Frozen : 01; // 0x20;
		/*643d*/ UCHAR ForceUntrusted : 01; // 0x40;
		/*643d*/ UCHAR SynchIpi : 01; // 0x80;
		/*643e*/ SHORT PairRemote;
		/*643e*/ UCHAR PairRemoteLow;
		/*643f*/ UCHAR Reserved2;
		/*6440*/ UCHAR Trace[0x18];
		/*6458*/ ULONGLONG LocalDomain;
		/*6460*/ ULONGLONG RemoteDomain;
		/*6468*/ _KTHREAD * Thread;
		/*6470*/
	} StibpPairingTrace;
	/*6470*/ _SINGLE_LIST_ENTRY AbSelfIoBoostsList;
	/*6478*/ _SINGLE_LIST_ENTRY AbPropagateBoostsList;
	/*6480*/ _KDPC AbDpc;
	/*64c0*/ _IOP_IRP_STACK_PROFILER IoIrpStackProfilerCurrent;
	/*6514*/ _IOP_IRP_STACK_PROFILER IoIrpStackProfilerPrevious;
	/*6568*/ _KSECURE_FAULT_INFORMATION SecureFault;
	/*6578*/ ULONGLONG PrcbPad120;
	/*6580*/ _KSHARED_READY_QUEUE LocalSharedReadyQueue;
	/*67f0*/ ULONGLONG PrcbPad125[0x2];
	/*6800*/ ULONG TimerExpirationTraceCount;
	/*6804*/ ULONG PrcbPad127;
	/*6808*/ _KTIMER_EXPIRATION_TRACE TimerExpirationTrace[0x10];
	/*6908*/ ULONGLONG PrcbPad128[0x7];
	/*6940*/ _REQUEST_MAILBOX * Mailbox;
	/*6948*/ ULONGLONG PrcbPad130[0x7];
	/*6980*/ _MACHINE_CHECK_CONTEXT McheckContext[0x2];
	/*6a20*/ ULONGLONG PrcbPad134[0x4];
	/*6a40*/ _KLOCK_QUEUE_HANDLE SelfmapLockHandle[0x4];
	/*6aa0*/ ULONGLONG PrcbPad134a[0x4];
	/*6ac0*/ UCHAR PrcbPad138[0x380];
	/*6e40*/ UCHAR PrcbPad138a[0x40];
	/*6e80*/ ULONGLONG KernelDirectoryTableBase;
	/*6e88*/ ULONGLONG RspBaseShadow;
	/*6e90*/ ULONGLONG UserRspShadow;
	/*6e98*/ ULONG ShadowFlags;
	/*6e9c*/ ULONG PrcbPad138b;
	/*6ea0*/ ULONGLONG PrcbPad138c;
	/*6ea8*/ USHORT PrcbPad138d;
	/*6eaa*/ USHORT PrcbPad138e;
	/*6eac*/ ULONG DbgMceNestingLevel;
	/*6eb0*/ ULONG DbgMceFlags;
	/*6eb4*/ ULONG PrcbPad139b;
	/*6eb8*/ ULONGLONG PrcbPad140[0x1f9];
	/*7e80*/ ULONGLONG PrcbPad140a[0x8];
	/*7ec0*/ ULONGLONG PrcbPad141[0x1f8];
	/*8e80*/ UCHAR PrcbPad141a[0x40];
	/*8ec0*/ _REQUEST_MAILBOX RequestMailbox[0x1];
	/*8f00*/
};

union _KPRCBFLAG {
	/*0000*/ LONG volatile PrcbFlags;
	/*0000*/ ULONG BamQosLevel : 02; // 0x00000003;
	/*0000*/ ULONG PendingQosUpdate : 02; // 0x0000000c;
	/*0000*/ ULONG CacheIsolationEnabled : 01; // 0x00000010;
	/*0000*/ ULONG PrcbFlagsReserved : 27; // 0xffffffe0;
	/*0004*/
};

struct _KPRIQUEUE {
	/*0000*/ _DISPATCHER_HEADER Header;
	/*0018*/ _LIST_ENTRY EntryListHead[0x20];
	/*0218*/ LONG volatile CurrentCount[0x20];
	/*0298*/ ULONG MaximumCount;
	/*02a0*/ _LIST_ENTRY ThreadListHead;
	/*02b0*/
};

struct _KPROCESS {
	/*0000*/ _DISPATCHER_HEADER Header;
	/*0018*/ _LIST_ENTRY ProfileListHead;
	/*0028*/ ULONGLONG DirectoryTableBase;
	/*0030*/ _LIST_ENTRY ThreadListHead;
	/*0040*/ ULONG ProcessLock;
	/*0044*/ ULONG ProcessTimerDelay;
	/*0048*/ ULONGLONG DeepFreezeStartTime;
	/*0050*/ _KAFFINITY_EX Affinity;
	/*00f8*/ _LIST_ENTRY ReadyListHead;
	/*0108*/ _SINGLE_LIST_ENTRY SwapListEntry;
	/*0110*/ _KAFFINITY_EX volatile ActiveProcessors;
	/*01b8*/ ULONG AutoAlignment : 01; // 0x00000001;
	/*01b8*/ ULONG DisableBoost : 01; // 0x00000002;
	/*01b8*/ ULONG DisableQuantum : 01; // 0x00000004;
	/*01b8*/ ULONG DeepFreeze : 01; // 0x00000008;
	/*01b8*/ ULONG TimerVirtualization : 01; // 0x00000010;
	/*01b8*/ ULONG CheckStackExtents : 01; // 0x00000020;
	/*01b8*/ ULONG CacheIsolationEnabled : 01; // 0x00000040;
	/*01b8*/ ULONG PpmPolicy : 03; // 0x00000380;
	/*01b8*/ ULONG VaSpaceDeleted : 01; // 0x00000400;
	/*01b8*/ ULONG ReservedFlags : 21; // 0xfffff800;
	/*01b8*/ LONG volatile ProcessFlags;
	/*01bc*/ ULONG ActiveGroupsMask;
	/*01c0*/ CHAR BasePriority;
	/*01c1*/ CHAR QuantumReset;
	/*01c2*/ CHAR Visited;
	/*01c3*/ _KEXECUTE_OPTIONS Flags;
	/*01c4*/ USHORT ThreadSeed[0x14];
	/*01ec*/ USHORT IdealProcessor[0x14];
	/*0214*/ USHORT IdealNode[0x14];
	/*023c*/ USHORT IdealGlobalNode;
	/*023e*/ USHORT Spare1;
	/*0240*/ _KSTACK_COUNT volatile StackCount;
	/*0248*/ _LIST_ENTRY ProcessListEntry;
	/*0258*/ ULONGLONG CycleTime;
	/*0260*/ ULONGLONG ContextSwitches;
	/*0268*/ _KSCHEDULING_GROUP * SchedulingGroup;
	/*0270*/ ULONG FreezeCount;
	/*0274*/ ULONG KernelTime;
	/*0278*/ ULONG UserTime;
	/*027c*/ ULONG ReadyTime;
	/*0280*/ ULONGLONG UserDirectoryTableBase;
	/*0288*/ UCHAR AddressPolicy;
	/*0289*/ UCHAR Spare2[0x47];
	/*02d0*/ void * InstrumentationCallback;
	union {
		/*02d8*/ ULONGLONG SecureHandle;
