enum {
	ASSOCF_NONE = 0x0,
	ASSOCF_INIT_NOREMAPCLSID = 0x1,
	ASSOCF_INIT_BYEXENAME = 0x2,
	ASSOCF_OPEN_BYEXENAME = 0x2,
	ASSOCF_INIT_DEFAULTTOSTAR = 0x4,
	ASSOCF_INIT_DEFAULTTOFOLDER = 0x8,
	ASSOCF_NOUSERSETTINGS = 0x10,
	ASSOCF_NOTRUNCATE = 0x20,
	ASSOCF_VERIFY = 0x40,
	ASSOCF_REMAPRUNDLL = 0x80,
	ASSOCF_NOFIXUPS = 0x100,
	ASSOCF_IGNOREBASECLASS = 0x200,
	ASSOCF_INIT_IGNOREUNKNOWN = 0x400,
	ASSOCF_INIT_FIXED_PROGID = 0x800,
	ASSOCF_IS_PROTOCOL = 0x1000,
	ASSOCF_INIT_FOR_FILE = 0x2000,
	ASSOCF_IS_FULL_URI = 0x4000,
	ASSOCF_PER_MACHINE_ONLY = 0x8000,
	ASSOCF_APP_TO_APP = 0x10000
};

enum {
	ASSOCMAKEF_VERIFY = 0x40,
	ASSOCMAKEF_USEEXPAND = 0x200,
	ASSOCMAKEF_SUBSTENV = 0x400,
	ASSOCMAKEF_VOLATILE = 0x800,
	ASSOCMAKEF_DELETE = 0x2000
};

enum {
	CTF_COINIT_ASTA = 0x4000,
	CTF_DISABLE_IME = 0x8000
};

enum {
	CTF_INSIST = 0x1,
	CTF_THREAD_REF = 0x2,
	CTF_PROCESS_REF = 0x4,
	CTF_COINIT_STA = 0x8,
	CTF_COINIT = 0x8,
	CTF_FREELIBANDEXIT = 0x10,
	CTF_REF_COUNTED = 0x20,
	CTF_WAIT_ALLOWCOM = 0x40,
	CTF_UNUSED = 0x80,
	CTF_INHERITWOW64 = 0x100,
	CTF_WAIT_NO_REENTRANCY = 0x200,
	CTF_KEYBOARD_LOCALE = 0x400,
	CTF_OLEINITIALIZE = 0x800,
	CTF_COINIT_MTA = 0x1000,
	CTF_NOADDREFLIB = 0x2000
};

enum {
	LdrpNoDevice = 0x0,
	LdrpWebDAV = 0x1,
	LdrpRemote = 0x2,
	LdrpAnyDevice = 0xffffffff,
	LdrpAnyDevice2bit = 0x3
};

enum {
	MidlInterceptionInfoVersionOne = 0x1
};

enum {
	MidlWinrtTypeSerializationInfoVersionOne = 0x1
};

enum {
	NcuStatsColumnInterfaceLuid = 0x0,
	NcuStatsColumnL2ProfileId = 0x1,
	NcuStatsColumnConnectedTime = 0x2,
	NcuStatsColumConnectStartTime = 0x3,
	NcuStatsColumnL2ProfileFlags = 0x4,
	NcuStatsColumnMax = 0x5
};

enum {
	NduStatsColumnInterfaceLuid = 0x0,
	NduStatsColumnL2ProfileId = 0x1,
	NduStatsColumnL2ProfileFlags = 0x2,
	NduStatsColumnBytesSent = 0x3,
	NduStatsColumnBytesRecvd = 0x4,
	NduStatsColumnProcessId = 0x5,
	NduStatsColumnOuterProcessId = 0x6,
	NduStatsColumnDataSourceType = 0x7,
	NduStatsColumnUserName = 0x8,
	NduStatsColumnMax = 0x9,
	NduStatsColumnMaxPersisted = 0x5
};

enum {
	OBJCOMPATF_OTNEEDSSFCACHE = 0x1,
	OBJCOMPATF_NO_WEBVIEW = 0x2,
	OBJCOMPATF_UNBINDABLE = 0x4,
	OBJCOMPATF_PINDLL = 0x8,
	OBJCOMPATF_NEEDSFILESYSANCESTOR = 0x10,
	OBJCOMPATF_NOTAFILESYSTEM = 0x20,
	OBJCOMPATF_CTXMENU_NOVERBS = 0x40,
	OBJCOMPATF_CTXMENU_LIMITEDQI = 0x80,
	OBJCOMPATF_COCREATESHELLFOLDERONLY = 0x100,
	OBJCOMPATF_NEEDSSTORAGEANCESTOR = 0x200,
	OBJCOMPATF_NOLEGACYWEBVIEW = 0x400,
	OBJCOMPATF_BLOCKSHELLSERVICEOBJECT = 0x800,
	OBJCOMPATF_CTXMENU_XPQCMFLAGS = 0x1000,
	OBJCOMPATF_NOIPROPERTYSTORE = 0x2000
};

enum {
	STREAM_COLUMN_SHOWTIME = 0x0,
	STREAM_COLUMN_APPID = 0x1,
	STREAM_COLUMN_EVENTID = 0x2,
	STREAM_COLUMN_NOTIFICATION_TYPE = 0x3
};

enum {
	WPP_TRACE_OPTIONS = 0x2b
};

enum {
	WPP_VER_WIN2K_CB_FORWARD_PTR = 0x1,
	WPP_VER_WHISTLER_CB_FORWARD_PTR = 0x2,
	WPP_VER_LH_CB_FORWARD_PTR = 0x3
};

enum {
	__crt_maximum_pointer_shift = 0x40
};

struct {
	/*0001*/
};

struct {
	/*0000*/ void * pad[0x2];
	/*0010*/ void * userContext;
	/*0018*/
};

struct {
	/*0001*/
};

struct {
	/*0000*/ _tlgProviderMetadata_t _tlgProv;
	/*0013*/ CHAR _tlgName[0x27];
	/*003a*/ USHORT _tlgOptionSize1;
	/*003c*/ UCHAR _tlgOptionEnum1;
	/*003d*/ _GUID _tlgOptionVal1;
	/*004d*/
};

struct {
	/*0000*/ _tlgProviderMetadata_t _tlgProv;
	/*0013*/ CHAR _tlgName[0x25];
	/*0038*/ USHORT _tlgOptionSize1;
	/*003a*/ UCHAR _tlgOptionEnum1;
	/*003b*/ _GUID _tlgOptionVal1;
	/*004b*/
};

struct {
	/*0000*/ _tlgProviderMetadata_t _tlgProv;
	/*0013*/ CHAR _tlgName[0x19];
	/*002c*/
};

struct {
	/*0000*/ _tlgProviderMetadata_t _tlgProv;
	/*0013*/ CHAR _tlgName[0x10];
	/*0023*/ USHORT _tlgOptionSize1;
	/*0025*/ UCHAR _tlgOptionEnum1;
	/*0026*/ _GUID _tlgOptionVal1;
	/*0036*/
};

struct {
	/*0000*/ WINDOWCOMPOSITIONATTRIB Attrib;
	/*0008*/ ULONGLONG cbData;
	/*0010*/
};

enum ACCESS_TYPE_PREFERENCE {
	ACCESS_TYPE_PREFERENCE_UNSPECIFIED = 0x0,
	ACCESS_TYPE_PREFERENCE_3GPP = 0x1,
	ACCESS_TYPE_PREFERENCE_NON3GPP = 0x2
};

enum ACTCTX_COMPATIBILITY_ELEMENT_TYPE {
	ACTCTX_COMPATIBILITY_ELEMENT_TYPE_UNKNOWN = 0x0,
	ACTCTX_COMPATIBILITY_ELEMENT_TYPE_OS = 0x1,
	ACTCTX_COMPATIBILITY_ELEMENT_TYPE_MITIGATION = 0x2,
	ACTCTX_COMPATIBILITY_ELEMENT_TYPE_MAXVERSIONTESTED = 0x3
};

enum ACTCTX_REQUESTED_RUN_LEVEL {
	ACTCTX_RUN_LEVEL_UNSPECIFIED = 0x0,
	ACTCTX_RUN_LEVEL_AS_INVOKER = 0x1,
	ACTCTX_RUN_LEVEL_HIGHEST_AVAILABLE = 0x2,
	ACTCTX_RUN_LEVEL_REQUIRE_ADMIN = 0x3,
	ACTCTX_RUN_LEVEL_NUMBERS = 0x4
};

enum ACTIVATEOPTIONS {
	AO_NONE = 0x0,
	AO_DESIGNMODE = 0x1,
	AO_NOERRORUI = 0x2,
	AO_NOSPLASHSCREEN = 0x4,
	AO_PRELAUNCH = 0x2000000
};

enum ACTIVATE_ON_HOST_FLAGS {
	ACTIVATE_ON_HOST_FLAGS_NONE = 0x0,
	ACTIVATE_ON_HOST_FLAGS_VAIL = 0x1,
	ACTIVATE_ON_HOST_FLAGS_WDAG = 0x2,
	ACTIVATE_ON_HOST_FLAGS_GAMECORE = 0x4
};

enum ACTIVATION_OBJECT_STATE {
	AOS_NONE = 0x0,
	AOS_ENABLED = 0x1,
	AOS_SUPPRESS_SPATIAL = 0x2,
	AOS_FOREGROUND = 0x4
};

enum ADJACENT_DISPLAY_EDGES {
	ADE_NONE = 0x0,
	ADE_LEFT = 0x1,
	ADE_RIGHT = 0x2
};

enum AHE_TYPE {
	AHE_DESKTOP = 0x0,
	AHE_IMMERSIVE = 0x1
};

enum AHTYPE {
	AHTYPE_UNDEFINED = 0x0,
	AHTYPE_USER_APPLICATION = 0x8,
	AHTYPE_ANY_APPLICATION = 0x10,
	AHTYPE_MACHINEDEFAULT = 0x20,
	AHTYPE_PROGID = 0x40,
	AHTYPE_APPLICATION = 0x80,
	AHTYPE_CLASS_APPLICATION = 0x100,
	AHTYPE_ANY_PROGID = 0x200
};

struct ANON_OBJECT_HEADER {
	/*0000*/ USHORT Sig1;
	/*0002*/ USHORT Sig2;
	/*0004*/ USHORT Version;
	/*0006*/ USHORT Machine;
	/*0008*/ ULONG TimeDateStamp;
	/*000c*/ _GUID ClassID;
	/*001c*/ ULONG SizeOfData;
	/*0020*/
};

struct ANON_OBJECT_HEADER_BIGOBJ {
	/*0000*/ USHORT Sig1;
	/*0002*/ USHORT Sig2;
	/*0004*/ USHORT Version;
	/*0006*/ USHORT Machine;
	/*0008*/ ULONG TimeDateStamp;
	/*000c*/ _GUID ClassID;
	/*001c*/ ULONG SizeOfData;
	/*0020*/ ULONG Flags;
	/*0024*/ ULONG MetaDataSize;
	/*0028*/ ULONG MetaDataOffset;
	/*002c*/ ULONG NumberOfSections;
	/*0030*/ ULONG PointerToSymbolTable;
	/*0034*/ ULONG NumberOfSymbols;
	/*0038*/
};

struct ANON_OBJECT_HEADER_V2 {
	/*0000*/ USHORT Sig1;
	/*0002*/ USHORT Sig2;
	/*0004*/ USHORT Version;
	/*0006*/ USHORT Machine;
	/*0008*/ ULONG TimeDateStamp;
	/*000c*/ _GUID ClassID;
	/*001c*/ ULONG SizeOfData;
	/*0020*/ ULONG Flags;
	/*0024*/ ULONG MetaDataSize;
	/*0028*/ ULONG MetaDataOffset;
	/*002c*/
};

struct APARTMENT_SHUTDOWN_REGISTRATION_COOKIE__ {
	/*0000*/ INT unused;
	/*0004*/
};

enum APPCOMPATMODEID {
	ACMID_NONE = 0x0,
	ACMID_CONTEXTMENU = 0x1,
	ACMID_DOCOBJECT = 0x2,
	ACMID_WIN95DEFVIEW = 0x3,
	ACMID_MYCOMPUTERFIRST = 0x4,
	ACMID_OLDREGITEMGDN = 0x5,
	ACMID_STATICJUMPLISTSIZE = 0x6,
	ACMID_LOADCOLUMNHANDLER = 0x7,
	ACMID_ANSI = 0x8,
	ACMID_STRIPFOLDERBIT = 0x9,
	ACMID_WIN95SHLEXEC = 0xa,
	ACMID_STAROFFICE5PRINTER = 0xb,
	ACMID_NOVALIDATEFSIDS = 0xc,
	ACMID_FORCELIBRARYPARSE = 0xd,
	ACMID_WIN95BINDTOOBJECT = 0xe,
	ACMID_IGNOREENUMRESET = 0xf,
	ACMID_NOTHREADUSECHECKS = 0x10,
	ACMID_ANSIDISPLAYNAMES = 0x11,
	ACMID_FILEOPENBOGUSCTRLID = 0x12,
	ACMID_FORCELFNIDLIST = 0x13,
	ACMID_APPISOFFICE = 0x14,
	ACMID_RETURNALLATTRIBS = 0x15,
	ACMID_NODEFVIEWMSGPUMP = 0x16,
	ACMID_RETURNNONURLSASURLS = 0x17,
	ACMID_IGNOREDEFAULTTOKEN = 0x18,
	ACMID_COINITIALIZE_COMPAREIDS = 0x19,
	ACMID_LAST = 0x1a
};

enum APPDOCLISTTYPE {
	ADLT_RECENT = 0x0,
	ADLT_FREQUENT = 0x1
};

enum APPLICATION_LAYOUT_MODE {
	ALM_NORMAL = 0x0,
	ALM_LOCKSCREEN = 0x1
};

enum APPLICATION_SEARCH_TYPE {
	AST_LOCAL = 0x0,
	AST_GLOBAL = 0x1
};

enum APPLICATION_VIEW_MIN_WIDTH {
	AVMW_DEFAULT = 0x0,
	AVMW_320 = 0x1,
	AVMW_500 = 0x2
};

enum APPLICATION_VIEW_ORIENTATION {
	AVO_LANDSCAPE = 0x0,
	AVO_PORTRAIT = 0x1
};

enum APPLICATION_VIEW_SIZE_PREFERENCE {
	AVSP_DEFAULT = 0x0,
	AVSP_USE_LESS = 0x1,
	AVSP_USE_HALF = 0x2,
	AVSP_USE_MORE = 0x3,
	AVSP_USE_MINIMUM = 0x4,
	AVSP_USE_NONE = 0x5,
	AVSP_CUSTOM = 0x6
};

enum APPLICATION_VIEW_STATE {
	AVS_FULLSCREEN_LANDSCAPE = 0x0,
	AVS_FILLED = 0x1,
	AVS_SNAPPED = 0x2,
	AVS_FULLSCREEN_PORTRAIT = 0x3
};

struct APP_LOCAL_DEVICE_ID {
	/*0000*/ UCHAR value[0x20];
	/*0020*/
};

enum ARM64_FNPDATA_CR {
	PdataCrUnchained = 0x0,
	PdataCrUnchainedSavedLr = 0x1,
	PdataCrChainedWithPac = 0x2,
	PdataCrChained = 0x3
};

enum ARM64_FNPDATA_FLAGS {
	PdataRefToFullXdata = 0x0,
	PdataPackedUnwindFunction = 0x1,
	PdataPackedUnwindFragment = 0x2
};

struct ARRAY_INFO {
	/*0000*/ LONG Dimension;
	/*0008*/ ULONG * BufferConformanceMark;
	/*0010*/ ULONG * BufferVarianceMark;
	/*0018*/ ULONG * MaxCountArray;
	/*0020*/ ULONG * OffsetArray;
	/*0028*/ ULONG * ActualCountArray;
	/*0030*/
};

enum ASSOCDATA {
	ASSOCDATA_MSIDESCRIPTOR = 0x1,
	ASSOCDATA_NOACTIVATEHANDLER = 0x2,
	ASSOCDATA_UNUSED1 = 0x3,
	ASSOCDATA_HASPERUSERASSOC = 0x4,
	ASSOCDATA_EDITFLAGS = 0x5,
	ASSOCDATA_VALUE = 0x6,
	ASSOCDATA_MAX = 0x7
};

enum ASSOCENUM {
	ASSOCENUM_NONE = 0x0
};

enum ASSOCIATIONLEVEL {
	AL_MACHINE = 0x0,
	AL_EFFECTIVE = 0x1,
	AL_USER = 0x2
};

enum ASSOCIATIONTYPE {
	AT_FILEEXTENSION = 0x0,
	AT_URLPROTOCOL = 0x1,
	AT_STARTMENUCLIENT = 0x2,
	AT_MIMETYPE = 0x3
};

enum ASSOCKEY {
	ASSOCKEY_SHELLEXECCLASS = 0x1,
	ASSOCKEY_APP = 0x2,
	ASSOCKEY_CLASS = 0x3,
	ASSOCKEY_BASECLASS = 0x4,
	ASSOCKEY_MAX = 0x5
};

enum ASSOCSTR {
	ASSOCSTR_COMMAND = 0x1,
	ASSOCSTR_EXECUTABLE = 0x2,
	ASSOCSTR_FRIENDLYDOCNAME = 0x3,
	ASSOCSTR_FRIENDLYAPPNAME = 0x4,
	ASSOCSTR_NOOPEN = 0x5,
	ASSOCSTR_SHELLNEWVALUE = 0x6,
	ASSOCSTR_DDECOMMAND = 0x7,
	ASSOCSTR_DDEIFEXEC = 0x8,
	ASSOCSTR_DDEAPPLICATION = 0x9,
	ASSOCSTR_DDETOPIC = 0xa,
	ASSOCSTR_INFOTIP = 0xb,
	ASSOCSTR_QUICKTIP = 0xc,
	ASSOCSTR_TILEINFO = 0xd,
	ASSOCSTR_CONTENTTYPE = 0xe,
	ASSOCSTR_DEFAULTICON = 0xf,
	ASSOCSTR_SHELLEXTENSION = 0x10,
	ASSOCSTR_DROPTARGET = 0x11,
	ASSOCSTR_DELEGATEEXECUTE = 0x12,
	ASSOCSTR_SUPPORTED_URI_PROTOCOLS = 0x13,
	ASSOCSTR_PROGID = 0x14,
	ASSOCSTR_APPID = 0x15,
	ASSOCSTR_APPPUBLISHER = 0x16,
	ASSOCSTR_APPICONREFERENCE = 0x17,
	ASSOCSTR_MAX = 0x18
};

enum ASSOC_FILTER {
	ASSOC_FILTER_NONE = 0x0,
	ASSOC_FILTER_RECOMMENDED = 0x1
};

enum ASTA_TEST_MODE_FLAGS {
	ASTA_TEST_MODE_NONE = 0x0,
	ASTA_TEST_MODE_RO_INIT_SINGLETHREADED_CREATES_ASTAS = 0x1,
	ASTA_TEST_MODE_GIT_LIFETIME_EXTENSION_ENABLED = 0x2,
	ASTA_TEST_MODE_ROINITIALIZEASTA_ALLOWED = 0x4
};

enum ATTACHMENT_ACTION {
	ATTACHMENT_ACTION_CANCEL = 0x0,
	ATTACHMENT_ACTION_SAVE = 0x1,
	ATTACHMENT_ACTION_EXEC = 0x2
};

enum ATTACHMENT_PROMPT {
	ATTACHMENT_PROMPT_NONE = 0x0,
	ATTACHMENT_PROMPT_SAVE = 0x1,
	ATTACHMENT_PROMPT_EXEC = 0x2,
	ATTACHMENT_PROMPT_EXEC_OR_SAVE = 0x3
};

class AgileGitPtr {
public:
	HRESULT Initialize( _GUID const & , IUnknown * );
	HRESULT Initialize( AgileReferenceOptions , _GUID const & , IUnknown * );
	BOOLEAN IsInitialized() const;
	HRESULT CopyLocal( _GUID const & , void * * ) const;
	HRESULT Revoke();
private:
	/*0000*/ AgileRef m_agileRef;
public:
	void AgileGitPtr( AgileGitPtr && );
	void AgileGitPtr( AgileGitPtr const & );
	void AgileGitPtr();
	void ~AgileGitPtr();
	AgileGitPtr & operator=( AgileGitPtr && );
	AgileGitPtr & operator=( AgileGitPtr const & );
	void * __vecDelDtor( UINT );
	/*0008*/
};

enum AgileReferenceOptions {
	AGILEREFERENCE_DEFAULT = 0x0,
	AGILEREFERENCE_DELAYEDMARSHAL = 0x1
};

enum AnnoScope {
	ANNO_THIS = 0x0,
	ANNO_CONTAINER = 0x1
};

enum ApartmentType {
	ApartmentType_STA = 0x0,
	ApartmentType_ASTA = 0x1,
	ApartmentType_MTA = 0x2,
	ApartmentType_NA = 0x3,
	ApartmentType_BSTA = 0x4
};

enum AppPolicyClrCompat {
	AppPolicyClrCompat_Other = 0x0,
	AppPolicyClrCompat_ClassicDesktop = 0x1,
	AppPolicyClrCompat_Universal = 0x2,
	AppPolicyClrCompat_PackagedDesktop = 0x3
};

enum AppPolicyCreateFileAccess {
	AppPolicyCreateFileAccess_Full = 0x0,
	AppPolicyCreateFileAccess_Limited = 0x1
};

enum AppPolicyLifecycleManagement {
	AppPolicyLifecycleManagement_Unmanaged = 0x0,
	AppPolicyLifecycleManagement_Managed = 0x1
};

enum AppPolicyMediaFoundationCodecLoading {
	AppPolicyMediaFoundationCodecLoading_All = 0x0,
	AppPolicyMediaFoundationCodecLoading_InboxOnly = 0x1
};

enum AppPolicyProcessTerminationMethod {
	AppPolicyProcessTerminationMethod_ExitProcess = 0x0,
	AppPolicyProcessTerminationMethod_TerminateProcess = 0x1
};

enum AppPolicyShowDeveloperDiagnostic {
	AppPolicyShowDeveloperDiagnostic_None = 0x0,
	AppPolicyShowDeveloperDiagnostic_ShowUI = 0x1
};

enum AppPolicyThreadInitializationType {
	AppPolicyThreadInitializationType_None = 0x0,
	AppPolicyThreadInitializationType_InitializeWinRT = 0x1
};

enum AppPolicyWindowingModel {
	AppPolicyWindowingModel_None = 0x0,
	AppPolicyWindowingModel_Universal = 0x1,
	AppPolicyWindowingModel_ClassicDesktop = 0x2,
	AppPolicyWindowingModel_ClassicPhone = 0x3
};

struct AsyncIAdviseSink : IUnknown {
	/*0018*/ virtual void Begin_OnDataChange( tagFORMATETC * , tagSTGMEDIUM * ) = 0;
	/*0020*/ virtual void Finish_OnDataChange() = 0;
	/*0028*/ virtual void Begin_OnViewChange( ULONG , LONG ) = 0;
	/*0030*/ virtual void Finish_OnViewChange() = 0;
	/*0038*/ virtual void Begin_OnRename( IMoniker * ) = 0;
	/*0040*/ virtual void Finish_OnRename() = 0;
	/*0048*/ virtual void Begin_OnSave() = 0;
	/*0050*/ virtual void Finish_OnSave() = 0;
	/*0058*/ virtual void Begin_OnClose() = 0;
	/*0060*/ virtual void Finish_OnClose() = 0;
	void AsyncIAdviseSink( AsyncIAdviseSink && );
	void AsyncIAdviseSink( AsyncIAdviseSink const & );
	void AsyncIAdviseSink();
	AsyncIAdviseSink & operator=( AsyncIAdviseSink && );
	AsyncIAdviseSink & operator=( AsyncIAdviseSink const & );
	/*0008*/
};

struct AsyncIAdviseSink2 : AsyncIAdviseSink {
	/*0068*/ virtual void Begin_OnLinkSrcChange( IMoniker * ) = 0;
	/*0070*/ virtual void Finish_OnLinkSrcChange() = 0;
	void AsyncIAdviseSink2( AsyncIAdviseSink2 && );
	void AsyncIAdviseSink2( AsyncIAdviseSink2 const & );
	void AsyncIAdviseSink2();
	AsyncIAdviseSink2 & operator=( AsyncIAdviseSink2 && );
	AsyncIAdviseSink2 & operator=( AsyncIAdviseSink2 const & );
	/*0008*/
};

struct AsyncIMultiQI : IUnknown {
	/*0018*/ virtual HRESULT Begin_QueryMultipleInterfaces( ULONG , tagMULTI_QI * ) = 0;
	/*0020*/ virtual HRESULT Finish_QueryMultipleInterfaces( tagMULTI_QI * ) = 0;
	void AsyncIMultiQI( AsyncIMultiQI && );
	void AsyncIMultiQI( AsyncIMultiQI const & );
	void AsyncIMultiQI();
	AsyncIMultiQI & operator=( AsyncIMultiQI && );
	AsyncIMultiQI & operator=( AsyncIMultiQI const & );
	/*0008*/
};

struct AsyncIPipeByte : IUnknown {
	/*0018*/ virtual HRESULT Begin_Pull( ULONG ) = 0;
	/*0020*/ virtual HRESULT Finish_Pull( UCHAR * , ULONG * ) = 0;
	/*0028*/ virtual HRESULT Begin_Push( UCHAR * , ULONG ) = 0;
	/*0030*/ virtual HRESULT Finish_Push() = 0;
	void AsyncIPipeByte( AsyncIPipeByte && );
	void AsyncIPipeByte( AsyncIPipeByte const & );
	void AsyncIPipeByte();
	AsyncIPipeByte & operator=( AsyncIPipeByte && );
	AsyncIPipeByte & operator=( AsyncIPipeByte const & );
	/*0008*/
};

struct AsyncIPipeDouble : IUnknown {
	/*0018*/ virtual HRESULT Begin_Pull( ULONG ) = 0;
	/*0020*/ virtual HRESULT Finish_Pull( double * , ULONG * ) = 0;
	/*0028*/ virtual HRESULT Begin_Push( double * , ULONG ) = 0;
	/*0030*/ virtual HRESULT Finish_Push() = 0;
	void AsyncIPipeDouble( AsyncIPipeDouble && );
	void AsyncIPipeDouble( AsyncIPipeDouble const & );
	void AsyncIPipeDouble();
	AsyncIPipeDouble & operator=( AsyncIPipeDouble && );
	AsyncIPipeDouble & operator=( AsyncIPipeDouble const & );
	/*0008*/
};

struct AsyncIPipeLong : IUnknown {
	/*0018*/ virtual HRESULT Begin_Pull( ULONG ) = 0;
	/*0020*/ virtual HRESULT Finish_Pull( LONG * , ULONG * ) = 0;
	/*0028*/ virtual HRESULT Begin_Push( LONG * , ULONG ) = 0;
	/*0030*/ virtual HRESULT Finish_Push() = 0;
	void AsyncIPipeLong( AsyncIPipeLong && );
	void AsyncIPipeLong( AsyncIPipeLong const & );
	void AsyncIPipeLong();
	AsyncIPipeLong & operator=( AsyncIPipeLong && );
	AsyncIPipeLong & operator=( AsyncIPipeLong const & );
	/*0008*/
};

struct AsyncIUnknown : IUnknown {
	/*0018*/ virtual HRESULT Begin_QueryInterface( _GUID const & ) = 0;
	/*0020*/ virtual HRESULT Finish_QueryInterface( void * * ) = 0;
	/*0028*/ virtual HRESULT Begin_AddRef() = 0;
	/*0030*/ virtual ULONG Finish_AddRef() = 0;
	/*0038*/ virtual HRESULT Begin_Release() = 0;
	/*0040*/ virtual ULONG Finish_Release() = 0;
	void AsyncIUnknown( AsyncIUnknown && );
	void AsyncIUnknown( AsyncIUnknown const & );
	void AsyncIUnknown();
	AsyncIUnknown & operator=( AsyncIUnknown && );
	AsyncIUnknown & operator=( AsyncIUnknown const & );
	/*0008*/
};

class AsyncOperationEventTracing {
public:
	static void AsyncOperationStarted( UINT , IAsyncInfo * );
	static void AsyncOperationStartFailure( UINT , IAsyncInfo * , HRESULT );
	static void AsyncOperationCompleted( UINT , IAsyncInfo * );
	static void AsyncOperationFailure( UINT , IAsyncInfo * , HRESULT );
	static void AsyncOperationCancelled( UINT , IAsyncInfo * );
	static void AsyncOperationClosed( UINT , IAsyncInfo * );
	static void FireCompletion( UINT , IAsyncInfo * , void * );
	static void FireProgress( UINT , IAsyncInfo * , void * );
	static void RevokeHandlerFailure( UINT , IAsyncInfo * , HRESULT );
	static void RegisterHandlerFailure( UINT , IAsyncInfo * , HRESULT );
	static void RetrieveHandlerFailure( UINT , IAsyncInfo * , HRESULT );
	static void SetEventProvider( IAsyncOperationEventProvider * );
private:
	static IAsyncOperationEventProvider * GetEventProvider();
	static IAsyncOperationEventProvider * traceEventProvider;
	/*0001*/
};

enum AsyncStatus {
	Started = 0x0,
	Completed = 0x1,
	Canceled = 0x2,
	Error = 0x3
};

class AutoArray<unsigned short *> : public AutoPtr<unsigned short *,&DeleteArray<unsigned short *>,0> {
public:
	void AutoArray<unsigned short *>( WCHAR * );
	void AutoArray<unsigned short *>();
	void ~AutoArray<unsigned short *>();
	void * __vecDelDtor( UINT );
	/*0008*/
};

class AutoBSTR : public AutoPtr<unsigned short *,&DeleteBSTR,0> {
public:
	void AutoBSTR( WCHAR * );
	void AutoBSTR();
	UINT Length();
	void ~AutoBSTR();
	void * __vecDelDtor( UINT );
	/*0008*/
};

class AutoComInitializer {
public:
	void AutoComInitializer( RO_INIT_TYPE );
	void ~AutoComInitializer();
private:
	/*0000*/ HRESULT hr;
public:
	void * __vecDelDtor( UINT );
	/*0004*/
};

class AutoLock {
	void AutoLock( AutoLock const & );
public:
	void AutoLock( Lock * );
	void ~AutoLock();
	void Enter();
	void Leave();
private:
	AutoLock & operator=( AutoLock const & );
	/*0000*/ Lock * lock;
public:
	void * __vecDelDtor( UINT );
	/*0008*/
};

class AutoPtr<unsigned short *,&DeleteArray<unsigned short *>,0> {
protected:
	/*0000*/ WCHAR * obj;
public:
	void AutoPtr<unsigned short *,&DeleteArray<unsigned short *>,0>( WCHAR * );
	void AutoPtr<unsigned short *,&DeleteArray<unsigned short *>,0>();
private:
	void AutoPtr<unsigned short *,&DeleteArray<unsigned short *>,0>( AutoPtr<unsigned short *,&DeleteArray<unsigned short *>,0> const & );
	WCHAR * operator=( WCHAR * );
	AutoPtr<unsigned short *,&DeleteArray<unsigned short *>,0> & operator=( AutoPtr<unsigned short *,&DeleteArray<unsigned short *>,0> const & );
public:
	void ~AutoPtr<unsigned short *,&DeleteArray<unsigned short *>,0>();
	WCHAR * operator unsigned short *() const;
	WCHAR * operator->() const;
	WCHAR * * operator&();
	WCHAR * * AddressOf();
	BOOLEAN IsNull();
	void Attach( WCHAR * );
	WCHAR * Detach();
	void Clear();
	void * __vecDelDtor( UINT );
	/*0008*/
};

class AutoPtr<unsigned short *,&DeleteBSTR,0> {
protected:
	/*0000*/ WCHAR * obj;
public:
	void AutoPtr<unsigned short *,&DeleteBSTR,0>( WCHAR * );
	void AutoPtr<unsigned short *,&DeleteBSTR,0>();
private:
	void AutoPtr<unsigned short *,&DeleteBSTR,0>( AutoPtr<unsigned short *,&DeleteBSTR,0> const & );
	WCHAR * operator=( WCHAR * );
	AutoPtr<unsigned short *,&DeleteBSTR,0> & operator=( AutoPtr<unsigned short *,&DeleteBSTR,0> const & );
public:
	void ~AutoPtr<unsigned short *,&DeleteBSTR,0>();
	WCHAR * operator unsigned short *() const;
	WCHAR * operator->() const;
	WCHAR * * operator&();
	WCHAR * * AddressOf();
	BOOLEAN IsNull();
	void Attach( WCHAR * );
	WCHAR * Detach();
	void Clear();
	void * __vecDelDtor( UINT );
	/*0008*/
};

class AutoPtr<unsigned short *,&DeleteSecureString,0>;

class AutoPtr<void *,&DeleteHandle,0>;

class AutoPtr<void *,&DeleteInvalidHandle,-1>;

class AutoStubBias<IUnknown,Windows::Internal::INilDelegate> {
public:
	void AutoStubBias<IUnknown,Windows::Internal::INilDelegate>( AutoStubBias<IUnknown,Windows::Internal::INilDelegate> const & );
	void AutoStubBias<IUnknown,Windows::Internal::INilDelegate>( IRpcOptions * , IUnknown * , INilDelegate * );
	void ~AutoStubBias<IUnknown,Windows::Internal::INilDelegate>();
private:
	/*0000*/ ComPtr<IStream> spStream_;
	/*0008*/ HRESULT hr_;
public:
	AutoStubBias<IUnknown,Windows::Internal::INilDelegate> & operator=( AutoStubBias<IUnknown,Windows::Internal::INilDelegate> const & );
	void * __vecDelDtor( UINT );
	/*0010*/
};

class AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::AttributedNetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::AttributedNetworkUsage *> *> > {
public:
	void AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::AttributedNetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorVi( AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::AttributedNetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::AttributedNetworkUsage *> *> > const & );
	void AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::AttributedNetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorVi( IRpcOptions * , IAsyncOperation<Collections::IVectorView<Networking::Connectivity::AttributedNetworkUsage *> *> * , IAsyncOperationCompletedHandler<Collections::IVectorView<Networking::Connectivity::AttributedNetworkUsage *> *> * );
	void ~AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::AttributedNetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorV();
private:
	/*0000*/ ComPtr<IStream> spStream_;
	/*0008*/ HRESULT hr_;
public:
	AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::AttributedNetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::AttributedNetworkUsage *> *> > & operator=( AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::AttributedNetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::AttributedNetworkUsage *> *> > const & );
	void * __vecDelDtor( UINT );
	/*0010*/
};

class AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectionProfile *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectionProfile *> *> > {
public:
	void AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectionProfile *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Wi( AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectionProfile *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectionProfile *> *> > const & );
	void AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectionProfile *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Wi( IRpcOptions * , IAsyncOperation<Collections::IVectorView<Networking::Connectivity::ConnectionProfile *> *> * , IAsyncOperationCompletedHandler<Collections::IVectorView<Networking::Connectivity::ConnectionProfile *> *> * );
	void ~AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectionProfile *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<W();
private:
	/*0000*/ ComPtr<IStream> spStream_;
	/*0008*/ HRESULT hr_;
public:
	AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectionProfile *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectionProfile *> *> > & operator=( AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectionProfile *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectionProfile *> *> > const & );
	void * __vecDelDtor( UINT );
	/*0010*/
};

class AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectivityInterval *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectivityInterval *> *> > {
public:
	void AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectivityInterval *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView( AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectivityInterval *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectivityInterval *> *> > const & );
	void AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectivityInterval *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView( IRpcOptions * , IAsyncOperation<Collections::IVectorView<Networking::Connectivity::ConnectivityInterval *> *> * , IAsyncOperationCompletedHandler<Collections::IVectorView<Networking::Connectivity::ConnectivityInterval *> *> * );
	void ~AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectivityInterval *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorVie();
private:
	/*0000*/ ComPtr<IStream> spStream_;
	/*0008*/ HRESULT hr_;
public:
	AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectivityInterval *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectivityInterval *> *> > & operator=( AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectivityInterval *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectivityInterval *> *> > const & );
	void * __vecDelDtor( UINT );
	/*0010*/
};

class AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::NetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::NetworkUsage *> *> > {
public:
	void AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::NetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows( AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::NetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::NetworkUsage *> *> > const & );
	void AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::NetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows( IRpcOptions * , IAsyncOperation<Collections::IVectorView<Networking::Connectivity::NetworkUsage *> *> * , IAsyncOperationCompletedHandler<Collections::IVectorView<Networking::Connectivity::NetworkUsage *> *> * );
	void ~AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::NetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Window();
private:
	/*0000*/ ComPtr<IStream> spStream_;
	/*0008*/ HRESULT hr_;
public:
	AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::NetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::NetworkUsage *> *> > & operator=( AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::NetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::NetworkUsage *> *> > const & );
	void * __vecDelDtor( UINT );
	/*0010*/
};

class AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ProviderNetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ProviderNetworkUsage *> *> > {
public:
	void AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ProviderNetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView( AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ProviderNetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ProviderNetworkUsage *> *> > const & );
	void AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ProviderNetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView( IRpcOptions * , IAsyncOperation<Collections::IVectorView<Networking::Connectivity::ProviderNetworkUsage *> *> * , IAsyncOperationCompletedHandler<Collections::IVectorView<Networking::Connectivity::ProviderNetworkUsage *> *> * );
	void ~AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ProviderNetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorVie();
private:
	/*0000*/ ComPtr<IStream> spStream_;
	/*0008*/ HRESULT hr_;
public:
	AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ProviderNetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ProviderNetworkUsage *> *> > & operator=( AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ProviderNetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ProviderNetworkUsage *> *> > const & );
	void * __vecDelDtor( UINT );
	/*0010*/
};

class AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ConnectionProfile *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ConnectionProfile *> > {
public:
	void AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ConnectionProfile *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ConnectionProfile *> >( AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ConnectionProfile *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ConnectionProfile *> > const & );
	void AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ConnectionProfile *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ConnectionProfile *> >( IRpcOptions * , IAsyncOperation<Networking::Connectivity::ConnectionProfile *> * , IAsyncOperationCompletedHandler<Networking::Connectivity::ConnectionProfile *> * );
	void ~AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ConnectionProfile *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ConnectionProfile *> >();
private:
	/*0000*/ ComPtr<IStream> spStream_;
	/*0008*/ HRESULT hr_;
public:
	AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ConnectionProfile *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ConnectionProfile *> > & operator=( AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ConnectionProfile *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ConnectionProfile *> > const & );
	void * __vecDelDtor( UINT );
	/*0010*/
};

class AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ConnectionSession *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ConnectionSession *> > {
public:
	void AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ConnectionSession *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ConnectionSession *> >( AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ConnectionSession *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ConnectionSession *> > const & );
	void AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ConnectionSession *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ConnectionSession *> >( IRpcOptions * , IAsyncOperation<Networking::Connectivity::ConnectionSession *> * , IAsyncOperationCompletedHandler<Networking::Connectivity::ConnectionSession *> * );
	void ~AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ConnectionSession *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ConnectionSession *> >();
private:
	/*0000*/ ComPtr<IStream> spStream_;
	/*0008*/ HRESULT hr_;
public:
	AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ConnectionSession *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ConnectionSession *> > & operator=( AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ConnectionSession *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ConnectionSession *> > const & );
	void * __vecDelDtor( UINT );
	/*0010*/
};

class AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ProxyConfiguration *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ProxyConfiguration *> > {
public:
	void AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ProxyConfiguration *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ProxyConfiguration *> >( AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ProxyConfiguration *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ProxyConfiguration *> > const & );
	void AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ProxyConfiguration *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ProxyConfiguration *> >( IRpcOptions * , IAsyncOperation<Networking::Connectivity::ProxyConfiguration *> * , IAsyncOperationCompletedHandler<Networking::Connectivity::ProxyConfiguration *> * );
	void ~AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ProxyConfiguration *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ProxyConfiguration *> >();
private:
	/*0000*/ ComPtr<IStream> spStream_;
	/*0008*/ HRESULT hr_;
public:
	AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ProxyConfiguration *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ProxyConfiguration *> > & operator=( AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ProxyConfiguration *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ProxyConfiguration *> > const & );
	void * __vecDelDtor( UINT );
	/*0010*/
};

class AutoStubBias<Windows::Foundation::IAsyncOperation<enum Windows::Networking::Connectivity::ConnectionProfileDeleteStatus>,Windows::Foundation::IAsyncOperationCompletedHandler<enum Windows::Networking::Connectivity::ConnectionProfileDeleteStatus> > {
public:
	void AutoStubBias<Windows::Foundation::IAsyncOperation<enum Windows::Networking::Connectivity::ConnectionProfileDeleteStatus>,Windows::Foundation::IAsyncOperationCompletedHandler<enum Windows::Networking::Connectivity::ConnectionProfileDeleteStatus> >( AutoStubBias<Windows::Foundation::IAsyncOperation<enum Windows::Networking::Connectivity::ConnectionProfileDeleteStatus>,Windows::Foundation::IAsyncOperationCompletedHandler<enum Windows::Networking::Connectivity::ConnectionProfileDeleteStatus> > const & );
	void AutoStubBias<Windows::Foundation::IAsyncOperation<enum Windows::Networking::Connectivity::ConnectionProfileDeleteStatus>,Windows::Foundation::IAsyncOperationCompletedHandler<enum Windows::Networking::Connectivity::ConnectionProfileDeleteStatus> >( IRpcOptions * , IAsyncOperation<enum Networking::Connectivity::ConnectionProfileDeleteStatus> * , IAsyncOperationCompletedHandler<enum Networking::Connectivity::ConnectionProfileDeleteStatus> * );
	void ~AutoStubBias<Windows::Foundation::IAsyncOperation<enum Windows::Networking::Connectivity::ConnectionProfileDeleteStatus>,Windows::Foundation::IAsyncOperationCompletedHandler<enum Windows::Networking::Connectivity::ConnectionProfileDeleteStatus> >();
private:
	/*0000*/ ComPtr<IStream> spStream_;
	/*0008*/ HRESULT hr_;
public:
	AutoStubBias<Windows::Foundation::IAsyncOperation<enum Windows::Networking::Connectivity::ConnectionProfileDeleteStatus>,Windows::Foundation::IAsyncOperationCompletedHandler<enum Windows::Networking::Connectivity::ConnectionProfileDeleteStatus> > & operator=( AutoStubBias<Windows::Foundation::IAsyncOperation<enum Windows::Networking::Connectivity::ConnectionProfileDeleteStatus>,Windows::Foundation::IAsyncOperationCompletedHandler<enum Windows::Networking::Connectivity::ConnectionProfileDeleteStatus> > const & );
	void * __vecDelDtor( UINT );
	/*0010*/
};

struct BANNER_NOTIFICATION {
	/*0000*/ BANNER_NOTIFICATION_EVENT event;
	/*0008*/ WCHAR const * providerIdentity;
	/*0010*/ WCHAR const * contentId;
	/*0018*/
};

enum BANNER_NOTIFICATION_EVENT {
	BNE_Rendered = 0x0,
	BNE_Hovered = 0x1,
	BNE_Closed = 0x2,
	BNE_Dismissed = 0x3,
	BNE_Button1Clicked = 0x4,
	BNE_Button2Clicked = 0x5
};

struct BATTERY_REPORTING_SCALE {
	/*0000*/ ULONG Granularity;
	/*0004*/ ULONG Capacity;
	/*0008*/
};

struct BITMAPV4HEADER {
	/*0000*/ ULONG bV4Size;
	/*0004*/ LONG bV4Width;
	/*0008*/ LONG bV4Height;
	/*000c*/ USHORT bV4Planes;
	/*000e*/ USHORT bV4BitCount;
	/*0010*/ ULONG bV4V4Compression;
	/*0014*/ ULONG bV4SizeImage;
	/*0018*/ LONG bV4XPelsPerMeter;
	/*001c*/ LONG bV4YPelsPerMeter;
	/*0020*/ ULONG bV4ClrUsed;
	/*0024*/ ULONG bV4ClrImportant;
	/*0028*/ ULONG bV4RedMask;
	/*002c*/ ULONG bV4GreenMask;
	/*0030*/ ULONG bV4BlueMask;
	/*0034*/ ULONG bV4AlphaMask;
	/*0038*/ ULONG bV4CSType;
	/*003c*/ tagICEXYZTRIPLE bV4Endpoints;
	/*0060*/ ULONG bV4GammaRed;
	/*0064*/ ULONG bV4GammaGreen;
	/*0068*/ ULONG bV4GammaBlue;
	/*006c*/
};

struct BITMAPV5HEADER {
	/*0000*/ ULONG bV5Size;
	/*0004*/ LONG bV5Width;
	/*0008*/ LONG bV5Height;
	/*000c*/ USHORT bV5Planes;
	/*000e*/ USHORT bV5BitCount;
	/*0010*/ ULONG bV5Compression;
	/*0014*/ ULONG bV5SizeImage;
	/*0018*/ LONG bV5XPelsPerMeter;
	/*001c*/ LONG bV5YPelsPerMeter;
	/*0020*/ ULONG bV5ClrUsed;
	/*0024*/ ULONG bV5ClrImportant;
	/*0028*/ ULONG bV5RedMask;
	/*002c*/ ULONG bV5GreenMask;
	/*0030*/ ULONG bV5BlueMask;
	/*0034*/ ULONG bV5AlphaMask;
	/*0038*/ ULONG bV5CSType;
	/*003c*/ tagICEXYZTRIPLE bV5Endpoints;
	/*0060*/ ULONG bV5GammaRed;
	/*0064*/ ULONG bV5GammaGreen;
	/*0068*/ ULONG bV5GammaBlue;
	/*006c*/ ULONG bV5Intent;
	/*0070*/ ULONG bV5ProfileData;
	/*0074*/ ULONG bV5ProfileSize;
	/*0078*/ ULONG bV5Reserved;
	/*007c*/
};

struct BREAK_ON_STATUS_BUFFER {
	/*0000*/ LONG NtStatus;
	/*0004*/ ULONG Win32Error;
	/*0008*/ ULONG ThreadId;
	/*000c*/ ULONG ProcessId;
	/*0010*/ CHAR ImageFileName[0x10];
	/*0020*/
};

struct BSMINFO {
	/*0000*/ UINT cbSize;
	/*0008*/ HDESK__ * hdesk;
	/*0010*/ HWND__ * hwnd;
	/*0018*/ _LUID luid;
	/*0020*/
};

struct BULK_SECURITY_TEST_DATA {
	/*0000*/ ULONG DesiredAccess;
	/*0004*/ ULONG SecurityIds[0x1];
	/*0008*/
};

struct BUTTON_IMAGELIST {
	/*0000*/ _IMAGELIST * himl;
	/*0008*/ tagRECT margin;
	/*0018*/ UINT uAlign;
	/*0020*/
};

enum BackgroundTaskThrottleCounterRemote {
	All = 0x0,
	Cpu = 0x1,
	Networking = 0x2
};

struct BiasHelper<IUnknown,Windows::Internal::INilDelegate,1> {
	static AutoStubBias<IUnknown,Windows::Internal::INilDelegate> CreateBias( IRpcOptions * , IUnknown * , INilDelegate * );
	/*0001*/
};

struct BiasHelper<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::AttributedNetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::AttributedNetworkUsage *> *>,1> {
	static AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::AttributedNetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::AttributedNetworkUsage *> *> > CreateBias( IRpcOptions * , IAsyncOperation<Collections::IVectorView<Networking::Connectivity::AttributedNetworkUsage *> *> * , IAsyncOperationCompletedHandler<Collections::IVectorView<Networking::Connectivity::AttributedNetworkUsage *> *> * );
	/*0001*/
};

struct BiasHelper<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectionProfile *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectionProfile *> *>,1> {
	static AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectionProfile *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectionProfile *> *> > CreateBias( IRpcOptions * , IAsyncOperation<Collections::IVectorView<Networking::Connectivity::ConnectionProfile *> *> * , IAsyncOperationCompletedHandler<Collections::IVectorView<Networking::Connectivity::ConnectionProfile *> *> * );
	/*0001*/
};

struct BiasHelper<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectivityInterval *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectivityInterval *> *>,1> {
	static AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectivityInterval *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ConnectivityInterval *> *> > CreateBias( IRpcOptions * , IAsyncOperation<Collections::IVectorView<Networking::Connectivity::ConnectivityInterval *> *> * , IAsyncOperationCompletedHandler<Collections::IVectorView<Networking::Connectivity::ConnectivityInterval *> *> * );
	/*0001*/
};

struct BiasHelper<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::NetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::NetworkUsage *> *>,1> {
	static AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::NetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::NetworkUsage *> *> > CreateBias( IRpcOptions * , IAsyncOperation<Collections::IVectorView<Networking::Connectivity::NetworkUsage *> *> * , IAsyncOperationCompletedHandler<Collections::IVectorView<Networking::Connectivity::NetworkUsage *> *> * );
	/*0001*/
};

struct BiasHelper<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ProviderNetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ProviderNetworkUsage *> *>,1> {
	static AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ProviderNetworkUsage *> *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Foundation::Collections::IVectorView<Windows::Networking::Connectivity::ProviderNetworkUsage *> *> > CreateBias( IRpcOptions * , IAsyncOperation<Collections::IVectorView<Networking::Connectivity::ProviderNetworkUsage *> *> * , IAsyncOperationCompletedHandler<Collections::IVectorView<Networking::Connectivity::ProviderNetworkUsage *> *> * );
	/*0001*/
};

struct BiasHelper<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ConnectionProfile *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ConnectionProfile *>,1> {
	static AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ConnectionProfile *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ConnectionProfile *> > CreateBias( IRpcOptions * , IAsyncOperation<Networking::Connectivity::ConnectionProfile *> * , IAsyncOperationCompletedHandler<Networking::Connectivity::ConnectionProfile *> * );
	/*0001*/
};

struct BiasHelper<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ConnectionSession *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ConnectionSession *>,1> {
	static AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ConnectionSession *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ConnectionSession *> > CreateBias( IRpcOptions * , IAsyncOperation<Networking::Connectivity::ConnectionSession *> * , IAsyncOperationCompletedHandler<Networking::Connectivity::ConnectionSession *> * );
	/*0001*/
};

struct BiasHelper<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ProxyConfiguration *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ProxyConfiguration *>,1> {
	static AutoStubBias<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ProxyConfiguration *>,Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ProxyConfiguration *> > CreateBias( IRpcOptions * , IAsyncOperation<Networking::Connectivity::ProxyConfiguration *> * , IAsyncOperationCompletedHandler<Networking::Connectivity::ProxyConfiguration *> * );
	/*0001*/
};

struct BiasHelper<Windows::Foundation::IAsyncOperation<enum Windows::Networking::Connectivity::ConnectionProfileDeleteStatus>,Windows::Foundation::IAsyncOperationCompletedHandler<enum Windows::Networking::Connectivity::ConnectionProfileDeleteStatus>,1> {
	static AutoStubBias<Windows::Foundation::IAsyncOperation<enum Windows::Networking::Connectivity::ConnectionProfileDeleteStatus>,Windows::Foundation::IAsyncOperationCompletedHandler<enum Windows::Networking::Connectivity::ConnectionProfileDeleteStatus> > CreateBias( IRpcOptions * , IAsyncOperation<enum Networking::Connectivity::ConnectionProfileDeleteStatus> * , IAsyncOperationCompletedHandler<enum Networking::Connectivity::ConnectionProfileDeleteStatus> * );
	/*0001*/
};

enum CATEGORYINFO_FLAGS {
	CATINFO_NORMAL = 0x0,
	CATINFO_COLLAPSED = 0x1,
	CATINFO_HIDDEN = 0x2,
	CATINFO_EXPANDED = 0x4,
	CATINFO_NOHEADER = 0x8,
	CATINFO_NOTCOLLAPSIBLE = 0x10,
	CATINFO_NOHEADERCOUNT = 0x20,
	CATINFO_SUBSETTED = 0x40,
	CATINFO_SEPARATE_IMAGES = 0x80,
	CATINFO_SHOWEMPTY = 0x100
};

struct CATEGORY_INFO {
	/*0000*/ CATEGORYINFO_FLAGS cif;
	/*0004*/ WCHAR wszName[0x104];
	/*020c*/
};

enum CATSORT_FLAGS {
	CATSORT_DEFAULT = 0x0,
	CATSORT_NAME = 0x1
};

class CAutoHandle<void *> : public CTSmartObj<void *,CAutoHandle_Policy<void *> > {
public:
	void CAutoHandle<void *>( CAutoHandle<void *> && );
	void CAutoHandle<void *>( void * );
	void CAutoHandle<void *>();
	CAutoHandle<void *> && Move();
	CAutoHandle<void *> & operator=( CAutoHandle<void *> && );
	void * const & operator void *const &() const;
	void ~CAutoHandle<void *>();
	void * __vecDelDtor( UINT );
	/*0008*/
};

class CAutoHandle_HGLOBALPolicy {
public:
	static void Destroy( void * );
	static void Clear( void * * );
	static BOOLEAN IsEmpty( void * );
	/*0001*/
};

class CAutoHandle_Policy<HACCEL__ *> {
public:
	static INT DestroyHandle( HACCEL__ * );
	static void Destroy( HACCEL__ * );
	static void Clear( HACCEL__ * * );
	static BOOLEAN IsEmpty( HACCEL__ * );
	/*0001*/
};

class CAutoHandle_Policy<HBITMAP__ *> {
public:
	static INT DestroyHandle( HBITMAP__ * );
	static void Destroy( HBITMAP__ * );
	static void Clear( HBITMAP__ * * );
	static BOOLEAN IsEmpty( HBITMAP__ * );
	/*0001*/
};

class CAutoHandle_Policy<HBRUSH__ *> {
public:
	static INT DestroyHandle( HBRUSH__ * );
	static void Destroy( HBRUSH__ * );
	static void Clear( HBRUSH__ * * );
	static BOOLEAN IsEmpty( HBRUSH__ * );
	/*0001*/
};

class CAutoHandle_Policy<HDC__ *> {
public:
	static INT DestroyHandle( HDC__ * );
	static void Destroy( HDC__ * );
	static void Clear( HDC__ * * );
	static BOOLEAN IsEmpty( HDC__ * );
	/*0001*/
};

class CAutoHandle_Policy<HDESK__ *> {
public:
	static INT DestroyHandle( HDESK__ * );
	static void Destroy( HDESK__ * );
	static void Clear( HDESK__ * * );
	static BOOLEAN IsEmpty( HDESK__ * );
	/*0001*/
};

class CAutoHandle_Policy<HFONT__ *> {
public:
	static INT DestroyHandle( HFONT__ * );
	static void Destroy( HFONT__ * );
	static void Clear( HFONT__ * * );
	static BOOLEAN IsEmpty( HFONT__ * );
	/*0001*/
};

class CAutoHandle_Policy<HICON__ *> {
public:
	static INT DestroyHandle( HICON__ * );
	static void Destroy( HICON__ * );
	static void Clear( HICON__ * * );
	static BOOLEAN IsEmpty( HICON__ * );
	/*0001*/
};

class CAutoHandle_Policy<HINSTANCE__ *> {
public:
	static INT DestroyHandle( HINSTANCE__ * );
	static void Destroy( HINSTANCE__ * );
	static void Clear( HINSTANCE__ * * );
	static BOOLEAN IsEmpty( HINSTANCE__ * );
	/*0001*/
};

class CAutoHandle_Policy<HKEY__ *> {
public:
	static INT DestroyHandle( HKEY__ * );
	static void Destroy( HKEY__ * );
	static void Clear( HKEY__ * * );
	static BOOLEAN IsEmpty( HKEY__ * );
	/*0001*/
};

class CAutoHandle_Policy<HMENU__ *> {
public:
	static INT DestroyHandle( HMENU__ * );
	static void Destroy( HMENU__ * );
	static void Clear( HMENU__ * * );
	static BOOLEAN IsEmpty( HMENU__ * );
	/*0001*/
};

class CAutoHandle_Policy<HPALETTE__ *> {
public:
	static INT DestroyHandle( HPALETTE__ * );
	static void Destroy( HPALETTE__ * );
	static void Clear( HPALETTE__ * * );
	static BOOLEAN IsEmpty( HPALETTE__ * );
	/*0001*/
};

class CAutoHandle_Policy<HPEN__ *> {
public:
	static INT DestroyHandle( HPEN__ * );
	static void Destroy( HPEN__ * );
	static void Clear( HPEN__ * * );
	static BOOLEAN IsEmpty( HPEN__ * );
	/*0001*/
};

class CAutoHandle_Policy<HRGN__ *> {
public:
	static INT DestroyHandle( HRGN__ * );
	static void Destroy( HRGN__ * );
	static void Clear( HRGN__ * * );
	static BOOLEAN IsEmpty( HRGN__ * );
	/*0001*/
};

class CAutoHandle_Policy<HWINSTA__ *> {
public:
	static INT DestroyHandle( HWINSTA__ * );
	static void Destroy( HWINSTA__ * );
	static void Clear( HWINSTA__ * * );
	static BOOLEAN IsEmpty( HWINSTA__ * );
	/*0001*/
};

class CAutoHandle_Policy<HWND__ *> {
public:
	static INT DestroyHandle( HWND__ * );
	static void Destroy( HWND__ * );
	static void Clear( HWND__ * * );
	static BOOLEAN IsEmpty( HWND__ * );
	/*0001*/
};

class CAutoHandle_Policy<_IMAGELIST *> {
public:
	static INT DestroyHandle( _IMAGELIST * );
	static void Destroy( _IMAGELIST * );
	static void Clear( _IMAGELIST * * );
	static BOOLEAN IsEmpty( _IMAGELIST * );
	/*0001*/
};

class CAutoHandle_Policy<void *> {
public:
	static INT DestroyHandle( void * );
	static void Destroy( void * );
	static void Clear( void * * );
	static BOOLEAN IsEmpty( void * );
	/*0001*/
};

class CBaseRPCTimeout {
public:
	void Arm( ULONG );
	void Disarm();
	BOOLEAN TimedOut() const;
protected:
	void CBaseRPCTimeout();
	void ~CBaseRPCTimeout();
private:
	static void s_Callback( void * , UCHAR );
	static ULONG const s_dwDefaultRPCTimeOut;
	static ULONG const s_dwRepeatRPCTimeOut;
	/*0000*/ ULONG _dwThreadId;
	/*0004*/ BOOLEAN _fTimedOut;
	/*0008*/ HRESULT _hrCancelEnabled;
	/*0010*/ void * _hTimer;
protected:
	void * __vecDelDtor( UINT );
	/*0018*/
};

class CBreakOnFailureT<CEmptyType> {
public:
	static void CheckToBreakOnFailure( HRESULT );
private:
	static HRESULT g_hResultToBreakOn;
	/*0001*/
};

struct CBuffer {
	/*0000*/ UCHAR * Cursor;
	/*0008*/ ULONGLONG BytesRemaining;
	/*0010*/
};

class CCoTaskMemPtr<unsigned char> : public CTSmartPtr<unsigned char,CTContainer_PolicyCoTaskMem> {
public:
	void CCoTaskMemPtr<unsigned char>( CCoTaskMemPtr<unsigned char> && );
	void CCoTaskMemPtr<unsigned char>( UCHAR * );
	void CCoTaskMemPtr<unsigned char>();
	CCoTaskMemPtr<unsigned char> && Move();
	CCoTaskMemPtr<unsigned char> & operator=( CCoTaskMemPtr<unsigned char> && );
	void ~CCoTaskMemPtr<unsigned char>();
	void * __vecDelDtor( UINT );
	/*0008*/
};

class CCoTaskMemPtr<unsigned short *> : public CTSmartPtr<unsigned short *,CTContainer_PolicyCoTaskMem> {
public:
	void CCoTaskMemPtr<unsigned short *>( CCoTaskMemPtr<unsigned short *> && );
	void CCoTaskMemPtr<unsigned short *>( WCHAR * * );
	void CCoTaskMemPtr<unsigned short *>();
	CCoTaskMemPtr<unsigned short *> && Move();
	CCoTaskMemPtr<unsigned short *> & operator=( CCoTaskMemPtr<unsigned short *> && );
	void ~CCoTaskMemPtr<unsigned short *>();
	void * __vecDelDtor( UINT );
	/*0008*/
};

class CCoTaskMemPtr<unsigned short> : public CTSmartPtr<unsigned short,CTContainer_PolicyCoTaskMem> {
public:
	void CCoTaskMemPtr<unsigned short>( CCoTaskMemPtr<unsigned short> && );
	void CCoTaskMemPtr<unsigned short>( WCHAR * );
	void CCoTaskMemPtr<unsigned short>();
	CCoTaskMemPtr<unsigned short> && Move();
	CCoTaskMemPtr<unsigned short> & operator=( CCoTaskMemPtr<unsigned short> && );
	void ~CCoTaskMemPtr<unsigned short>();
	void * __vecDelDtor( UINT );
	/*0008*/
};

class CContainer_PolicySysFree {
public:
	static void Destroy( WCHAR * );
	/*0001*/
};

enum CDCONTROLSTATEF {
	CDCS_INACTIVE = 0x0,
	CDCS_ENABLED = 0x1,
	CDCS_VISIBLE = 0x2,
	CDCS_ENABLEDVISIBLE = 0x3
};

enum CI_WINDOWS_LOCKDOWN_RESTRICTION {
	CI_WINDOWS_LOCKDOWN_RESTRICTION_NONE = 0x0,
	CI_WINDOWS_LOCKDOWN_RESTRICTION_NOUNLOCK = 0x1,
	CI_WINDOWS_LOCKDOWN_RESTRICTION_NOUNLOCK_PERMANENT = 0x2,
	CI_WINDOWS_LOCKDOWN_RESTRICTION_MAX = 0x3
};

class CLocalMemPtr<unsigned short> : public CTSmartPtr<unsigned short,CTContainer_PolicyLocalMem> {
public:
	void CLocalMemPtr<unsigned short>( CLocalMemPtr<unsigned short> && );
	void CLocalMemPtr<unsigned short>( WCHAR * );
	void CLocalMemPtr<unsigned short>();
	void ~CLocalMemPtr<unsigned short>();
	CLocalMemPtr<unsigned short> & operator=( CLocalMemPtr<unsigned short> && );
	void * __vecDelDtor( UINT );
	/*0008*/
};

struct CM_COLUMNINFO {
	/*0000*/ ULONG cbSize;
	/*0004*/ ULONG dwMask;
	/*0008*/ ULONG dwState;
	/*000c*/ UINT uWidth;
	/*0010*/ UINT uDefaultWidth;
	/*0014*/ UINT uIdealWidth;
	/*0018*/ WCHAR wszName[0x50];
	/*00b8*/
};

enum CM_ENUM_FLAGS {
	CM_ENUM_ALL = 0x1,
	CM_ENUM_VISIBLE = 0x2
};

struct CM_EXTENDED_PARAMETER {
	/*0000*/ ULONGLONG Type : 08; // 0x00000000000000ff;
	/*0000*/ ULONGLONG Reserved : 56; // 0xffffffffffffff00;
	/*0008*/ ULONGLONG ULong64;
	/*0008*/ void * Pointer;
	/*0008*/ ULONGLONG Size;
	/*0008*/ void * Handle;
	/*0008*/ ULONG ULong;
	/*0008*/ ULONG AccessMask;
	/*0010*/
};

enum CM_EXTENDED_PARAMETER_TYPE {
	CmExtendedParameterInvalidType = 0x0,
	CmExtendedParameterTrustClassKey = 0x1,
	CmExtendedParameterEvent = 0x2,
	CmExtendedParameterFileAccessToken = 0x3,
	CmExtendedParameterMax = 0x4
};

enum CM_MASK {
	CM_MASK_WIDTH = 0x1,
	CM_MASK_DEFAULTWIDTH = 0x2,
	CM_MASK_IDEALWIDTH = 0x4,
	CM_MASK_NAME = 0x8,
	CM_MASK_STATE = 0x10
};

struct CM_Power_Data_s {
	/*0000*/ ULONG PD_Size;
	/*0004*/ _DEVICE_POWER_STATE PD_MostRecentPowerState;
	/*0008*/ ULONG PD_Capabilities;
	/*000c*/ ULONG PD_D1Latency;
	/*0010*/ ULONG PD_D2Latency;
	/*0014*/ ULONG PD_D3Latency;
	/*0018*/ _DEVICE_POWER_STATE PD_PowerStateMapping[0x7];
	/*0034*/ _SYSTEM_POWER_STATE PD_DeepestSystemWake;
	/*0038*/
};

enum CM_SET_WIDTH_VALUE {
	CM_WIDTH_USEDEFAULT = 0xffffffff,
	CM_WIDTH_AUTOSIZE = 0xfffffffe
};

enum CM_STATE {
	CM_STATE_NONE = 0x0,
	CM_STATE_VISIBLE = 0x1,
	CM_STATE_FIXEDWIDTH = 0x2,
	CM_STATE_NOSORTBYFOLDERNESS = 0x4,
	CM_STATE_ALWAYSVISIBLE = 0x8
};

class CMarshaledInterface {

	struct BoolStruct {
		/*0000*/ INT Member;
		/*0004*/
	};


	class CMarshalStream : public RuntimeClass<RuntimeClassFlags<2>,IUnknown> {
	public:
		HRESULT RuntimeClassInitialize( IStream * );
		HRESULT RuntimeClassInitialize( _GUID const & , IUnknown * , MARSHAL_KIND );
		/*    */ virtual void ~CMarshalStream();
		BOOLEAN CanUnmarshalMultipleTimes() const;
		HRESULT Unmarshal( _GUID const & , void * * );
	private:
		/*0010*/ ComPtr<IStream> m_stream;
		/*0018*/ MARSHAL_KIND m_marshalingKind;
		/*0020*/ AgileGitPtr m_agileRef;
		/*0028*/ ULONG m_marshalThreadId;
	public:
		void CMarshalStream();
		void __local_vftable_ctor_closure();
		/*0018*/ virtual void * __vecDelDtor( UINT );
		/*0030*/
	};

public:
	void CMarshaledInterface( CMarshaledInterface && );
	void CMarshaledInterface( CMarshaledInterface const & );
	void CMarshaledInterface();
	CMarshaledInterface & operator=( CMarshaledInterface && );
	CMarshaledInterface & operator=( CMarshaledInterface const & );
	HRESULT Marshal( _GUID const & , IUnknown * , MARSHAL_KIND );
	HRESULT Unmarshal( _GUID const & , void * * );
	HRESULT UnmarshalAndRelease( _GUID const & , void * * );
	void Release();
	BOOLEAN HasStream() const;
	HRESULT AttachStream( IStream * , tagMSHLFLAGS );
	INT BoolStruct::* operator int CMarshaledInterface::BoolStruct::*() const;
private:
	HRESULT _Unmarshal( _GUID const & , void * * , BOOLEAN );
	/*0000*/ ComPtr<CMarshaledInterface::CMarshalStream> m_marshal;
public:
	void ~CMarshaledInterface();
	void * __vecDelDtor( UINT );
	/*0008*/
};

class CMemString<CMemString_PolicyCoTaskMem> {
	void CMemString<CMemString_PolicyCoTaskMem>( CMemString<CMemString_PolicyCoTaskMem> const & );
public:
	void CMemString<CMemString_PolicyCoTaskMem>( CMemString<CMemString_PolicyCoTaskMem> && );
	void CMemString<CMemString_PolicyCoTaskMem>();
	void ~CMemString<CMemString_PolicyCoTaskMem>();
	WCHAR * * operator&();
	WCHAR * operator unsigned short *();
	WCHAR const * operator const unsigned short *() const;
	CMemString<CMemString_PolicyCoTaskMem> && Move();
private:
	CMemString<CMemString_PolicyCoTaskMem> & operator=( CMemString<CMemString_PolicyCoTaskMem> const & );
public:
	CMemString<CMemString_PolicyCoTaskMem> & operator=( CMemString<CMemString_PolicyCoTaskMem> && );
	WCHAR const * Get() const;
	void Attach( WCHAR * );
	WCHAR * Detach();
	void Release();
	BOOLEAN IsEmpty() const;
private:
	/*0000*/ WCHAR * _psz;
public:
	void * __vecDelDtor( UINT );
	/*0008*/
};

struct CMemString_PolicyAutoMem {
	static void Free( WCHAR * );
	/*0001*/
};

struct CMemString_PolicyCoTaskMem {
	static void Free( WCHAR * );
	/*0001*/
};

struct CMemString_PolicyLocalMem {
	static void Free( WCHAR * );
	/*0001*/
};

union COLORREF_COMPONENTS {
	
	/*0000*/ <unnamed-type-component> component;
	/*0000*/ ULONG _cr;
	void COLORREF_COMPONENTS( ULONG );
	/*0004*/
};

enum COMMAND_SET {
	CS_FIRST = 0x0,
	CS_SORTORDER = 0x0,
	CS_NAVPANE = 0x1,
	CS_PREVIEWPANE = 0x2,
	CS_SHOWHIDE = 0x3,
	CS_CLIPBOARD = 0x4,
	CS_VOLUMEADDREMOVE = 0x5,
	CS_LIBRARYADD = 0x6,
	CS_LEGACYBARSCHANGED = 0x7,
	CS_WORKOFFLINE = 0x8,
	CS_LAST = 0x9
};

enum COMPARTMENT_ID {
	UNSPECIFIED_COMPARTMENT_ID = 0x0,
	DEFAULT_COMPARTMENT_ID = 0x1
};

enum COM_CALL_LOCALITY {
	COM_CALL_LOCALITY_SAME_PROCESS = 0x0,
	COM_CALL_LOCALITY_CROSS_PROCESS = 0x1,
	COM_CALL_LOCALITY_CROSS_CONTAINER = 0x2,
	COM_CALL_LOCALITY_CROSS_MACHINE = 0x3
};

enum CONFIRMATIONRESPONSE {
	CONFRES_CONTINUE = 0x0,
	CONFRES_SKIP = 0x1,
	CONFRES_RETRY = 0x2,
	CONFRES_RENAME = 0x3,
	CONFRES_CANCEL = 0x4,
	CONFRES_UNDO = 0x5,
	CONFRES_RENAME_LEFT = 0x3,
	CONFRES_RENAME_RIGHT = 0x6,
	CONFRES_ELEVATE = 0x7,
	CONFRES_CLOSE = 0x8
};

struct CONFIRMSAFETY {
	/*0000*/ _GUID clsid;
	/*0010*/ IUnknown * pUnk;
	/*0018*/ ULONG dwFlags;
	/*0020*/
};

struct CONFIRM_CONFLICT_ITEM {
	/*0000*/ IShellItem2 * pShellItem;
	/*0008*/ WCHAR * pszOriginalName;
	/*0010*/ WCHAR * pszAlternateName;
	/*0018*/ WCHAR * pszLocationShort;
	/*0020*/ WCHAR * pszLocationFull;
	/*0028*/ SYNCMGR_CONFLICT_ITEM_TYPE nType;
	/*0030*/
};

struct CONFLICT_ITEM_METADATA {
	/*0000*/ _FILETIME ftDateModified;
	/*0008*/ ULONGLONG ullSize;
	/*0010*/ WCHAR * pszItemName;
	/*0018*/ WCHAR * pszItemPath;
	/*0020*/ INT fHasConnectedElement;
	/*0028*/
};

struct COPYFILE2_EXTENDED_PARAMETERS {
	/*0000*/ ULONG dwSize;
	/*0004*/ ULONG dwCopyFlags;
	/*0008*/ INT * pfCancel;
	/*0010*/ _COPYFILE2_MESSAGE_ACTION (* pProgressRoutine)( COPYFILE2_MESSAGE const * , void * );
	/*0018*/ void * pvCallbackContext;
	/*0020*/
};

struct COPYFILE2_MESSAGE {
	
	/*0000*/ _COPYFILE2_MESSAGE_TYPE Type;
	/*0004*/ ULONG dwPadding;
	/*0008*/ <unnamed-type-Info> Info;
	/*0050*/
};

struct CORRELATION_VECTOR {
	/*0000*/ CHAR Version;
	/*0001*/ CHAR Vector[0x81];
	/*0082*/
};

enum COST_SET_MEDIA {
	COST_SET_MEDIA_UNKNOWN = 0x0,
	COST_SET_MEDIA_WLAN = 0x1,
	COST_SET_MEDIA_3G = 0x2,
	COST_SET_MEDIA_4G = 0x3
};

enum COST_SET_SOURCE {
	COST_SET_SOURCE_UNKNOWN = 0x0,
	COST_SET_SOURCE_GP = 0x1,
	COST_SET_SOURCE_USER = 0x2,
	COST_SET_SOURCE_PUBLIC = 0x3,
	COST_SET_SOURCE_OPERATOR = 0x4
};

struct CO_DEVICE_CATALOG_COOKIE__ {
	/*0000*/ INT unused;
	/*0004*/
};

enum CO_MARSHALING_CONTEXT_ATTRIBUTES {
	CO_MARSHALING_SOURCE_IS_APP_CONTAINER = 0x0,
	CO_MARSHALING_CONTEXT_ATTRIBUTE_RESERVED_1 = 0x80000000,
	CO_MARSHALING_CONTEXT_ATTRIBUTE_RESERVED_2 = 0x80000001,
	CO_MARSHALING_CONTEXT_ATTRIBUTE_RESERVED_3 = 0x80000002,
	CO_MARSHALING_CONTEXT_ATTRIBUTE_RESERVED_4 = 0x80000003,
	CO_MARSHALING_CONTEXT_ATTRIBUTE_RESERVED_5 = 0x80000004,
	CO_MARSHALING_CONTEXT_ATTRIBUTE_RESERVED_6 = 0x80000005,
	CO_MARSHALING_CONTEXT_ATTRIBUTE_RESERVED_7 = 0x80000006,
	CO_MARSHALING_CONTEXT_ATTRIBUTE_RESERVED_8 = 0x80000007,
	CO_MARSHALING_CONTEXT_ATTRIBUTE_RESERVED_9 = 0x80000008,
	CO_MARSHALING_CONTEXT_ATTRIBUTE_RESERVED_10 = 0x80000009,
	CO_MARSHALING_CONTEXT_ATTRIBUTE_RESERVED_11 = 0x8000000a,
	CO_MARSHALING_CONTEXT_ATTRIBUTE_RESERVED_12 = 0x8000000b,
	CO_MARSHALING_CONTEXT_ATTRIBUTE_RESERVED_13 = 0x8000000c,
	CO_MARSHALING_CONTEXT_ATTRIBUTE_RESERVED_14 = 0x8000000d,
	CO_MARSHALING_CONTEXT_ATTRIBUTE_RESERVED_15 = 0x8000000e,
	CO_MARSHALING_CONTEXT_ATTRIBUTE_RESERVED_16 = 0x8000000f,
	CO_MARSHALING_CONTEXT_ATTRIBUTE_RESERVED_17 = 0x80000010,
	CO_MARSHALING_CONTEXT_ATTRIBUTE_RESERVED_18 = 0x80000011
};

struct CO_MTA_USAGE_COOKIE__ {
	/*0000*/ INT unused;
	/*0004*/
};

enum CPVIEW {
	CPVIEW_CLASSIC = 0x0,
	CPVIEW_ALLITEMS = 0x0,
	CPVIEW_CATEGORY = 0x1,
	CPVIEW_HOME = 0x1
};

struct CREATE_USN_JOURNAL_DATA {
	/*0000*/ ULONGLONG MaximumSize;
	/*0008*/ ULONGLONG AllocationDelta;
	/*0010*/
};

enum CREDENTIAL_PROVIDER_ACCOUNT_OPTIONS {
	CPAO_NONE = 0x0,
	CPAO_EMPTY_LOCAL = 0x1,
	CPAO_EMPTY_CONNECTED = 0x2
};

enum CREDENTIAL_PROVIDER_CREDENTIAL_FIELD_OPTIONS {
	CPCFO_NONE = 0x0,
	CPCFO_ENABLE_PASSWORD_REVEAL = 0x1,
	CPCFO_IS_EMAIL_ADDRESS = 0x2,
	CPCFO_ENABLE_TOUCH_KEYBOARD_AUTO_INVOKE = 0x4,
	CPCFO_NUMBERS_ONLY = 0x8,
	CPCFO_SHOW_ENGLISH_KEYBOARD = 0x10
};

class CRPCTimeout : public CBaseRPCTimeout {
public:
	void CRPCTimeout( ULONG );
private:
	static void * operator new( ULONGLONG );
	static void * operator new[]( ULONGLONG );
public:
	void ~CRPCTimeout();
	void __dflt_ctor_closure();
	void * __vecDelDtor( UINT );
	/*0018*/
};

class CSTARequiringThreadRefTaker : public CThreadRefTaker {
public:
	void CSTARequiringThreadRefTaker( CSTARequiringThreadRefTaker && );
	void CSTARequiringThreadRefTaker( CSTARequiringThreadRefTaker const & );
	void CSTARequiringThreadRefTaker();
	/*    */ virtual void ~CSTARequiringThreadRefTaker();
	CSTARequiringThreadRefTaker & operator=( CSTARequiringThreadRefTaker && );
	CSTARequiringThreadRefTaker & operator=( CSTARequiringThreadRefTaker const & );
	void __local_vftable_ctor_closure();
	/*0000*/ virtual void * __vecDelDtor( UINT );
	/*0010*/
};

enum CSTN_FILE_EXTENSION_OPTION {
	CTSN_IGNORE_FILE_EXTENSION = 0x0,
	CTSN_UNIQUE_NAME_WITH_EXTENSION = 0x1
};

class CTCoAllocPolicy {
	static ULONGLONG _CoTaskMemSize( void * );
public:
	static HRESULT Alloc( void * , ULONG , ULONGLONG , void * * );
	static HRESULT Realloc( void * , ULONG , void * , ULONGLONG , void * * );
	/*0001*/
};

class CTContainer_PolicyCoTaskMem {
public:
	static void Destroy( void * );
	/*0001*/
};

class CTContainer_PolicyHeapMem {
public:
	static INT DestroyMem( void * );
	/*0001*/
};

class CTContainer_PolicyLocalMem {
public:
	static INT DestroyMem( void * );
	/*0001*/
};

class CTGlobalAllocPolicy {
public:
	static HRESULT Alloc( void * , ULONG , ULONGLONG , void * * );
	static HRESULT Realloc( void * , ULONG , void * , ULONGLONG , void * * );
	/*0001*/
};

class CTHeapAllocPolicy {
public:
	static HRESULT Alloc( void * , ULONG , ULONGLONG , void * * );
	static HRESULT Realloc( void * , ULONG , void * , ULONGLONG , void * * );
	/*0001*/
};

class CTLocalAllocPolicy {
public:
	static HRESULT Alloc( void * , ULONG , ULONGLONG , void * * );
	static HRESULT Realloc( void * , ULONG , void * , ULONGLONG , void * * );
	/*0001*/
};

class CTSmartObj<unsigned char *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > {
	void CTSmartObj<unsigned char *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> >( CTSmartObj<unsigned char *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > const & );
public:
	void CTSmartObj<unsigned char *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> >( CTSmartObj<unsigned char *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > && );
	void CTSmartObj<unsigned char *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> >( UCHAR * const & );
	void CTSmartObj<unsigned char *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> >();
	void ~CTSmartObj<unsigned char *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> >();
private:
	void Attach( CTSmartObj<unsigned char *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > const & );
public:
	void Attach( UCHAR * const & );
	UCHAR * Detach();
	UCHAR * const & Get() const;
	UCHAR * * operator&();
	UCHAR * * GetAddress();
	void Release();
	BOOLEAN IsEmpty() const;
	CTSmartObj<unsigned char *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > && Move();
private:
	CTSmartObj<unsigned char *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > & operator=( UCHAR * const & );
	CTSmartObj<unsigned char *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > & operator=( CTSmartObj<unsigned char *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > const & );
public:
	CTSmartObj<unsigned char *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > & operator=( CTSmartObj<unsigned char *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > && );
protected:
	/*0000*/ UCHAR * _obj;
	void Clear();
public:
	void * __vecDelDtor( UINT );
	/*0008*/
};

class CTSmartObj<unsigned short * *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > {
	void CTSmartObj<unsigned short * *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> >( CTSmartObj<unsigned short * *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > const & );
public:
	void CTSmartObj<unsigned short * *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> >( CTSmartObj<unsigned short * *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > && );
	void CTSmartObj<unsigned short * *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> >( WCHAR * * const & );
	void CTSmartObj<unsigned short * *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> >();
	void ~CTSmartObj<unsigned short * *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> >();
private:
	void Attach( CTSmartObj<unsigned short * *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > const & );
public:
	void Attach( WCHAR * * const & );
	WCHAR * * Detach();
	WCHAR * * const & Get() const;
	WCHAR * * * operator&();
	WCHAR * * * GetAddress();
	void Release();
	BOOLEAN IsEmpty() const;
	CTSmartObj<unsigned short * *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > && Move();
private:
	CTSmartObj<unsigned short * *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > & operator=( WCHAR * * const & );
	CTSmartObj<unsigned short * *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > & operator=( CTSmartObj<unsigned short * *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > const & );
public:
	CTSmartObj<unsigned short * *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > & operator=( CTSmartObj<unsigned short * *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > && );
protected:
	/*0000*/ WCHAR * * _obj;
	void Clear();
public:
	void * __vecDelDtor( UINT );
	/*0008*/
};

class CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > {
	void CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> >( CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > const & );
public:
	void CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> >( CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > && );
	void CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> >( WCHAR * const & );
	void CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> >();
	void ~CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> >();
private:
	void Attach( CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > const & );
public:
	void Attach( WCHAR * const & );
	WCHAR * Detach();
	WCHAR * const & Get() const;
	WCHAR * * operator&();
	WCHAR * * GetAddress();
	void Release();
	BOOLEAN IsEmpty() const;
	CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > && Move();
private:
	CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > & operator=( WCHAR * const & );
	CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > & operator=( CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > const & );
public:
	CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > & operator=( CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > && );
protected:
	/*0000*/ WCHAR * _obj;
	void Clear();
public:
	void * __vecDelDtor( UINT );
	/*0008*/
};

class CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem> > {
	void CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem> >( CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem> > const & );
public:
	void CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem> >( CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem> > && );
	void CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem> >( WCHAR * const & );
	void CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem> >();
	void ~CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem> >();
private:
	void Attach( CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem> > const & );
public:
	void Attach( WCHAR * const & );
	WCHAR * Detach();
	WCHAR * const & Get() const;
	WCHAR * * operator&();
	WCHAR * * GetAddress();
	void Release();
	BOOLEAN IsEmpty() const;
	CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem> > && Move();
private:
	CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem> > & operator=( WCHAR * const & );
	CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem> > & operator=( CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem> > const & );
public:
	CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem> > & operator=( CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem> > && );
protected:
	/*0000*/ WCHAR * _obj;
	void Clear();
public:
	void * __vecDelDtor( UINT );
	/*0008*/
};

class CTSmartObj<void *,CAutoHandle_Policy<void *> > {
	void CTSmartObj<void *,CAutoHandle_Policy<void *> >( CTSmartObj<void *,CAutoHandle_Policy<void *> > const & );
public:
	void CTSmartObj<void *,CAutoHandle_Policy<void *> >( CTSmartObj<void *,CAutoHandle_Policy<void *> > && );
	void CTSmartObj<void *,CAutoHandle_Policy<void *> >( void * const & );
	void CTSmartObj<void *,CAutoHandle_Policy<void *> >();
	void ~CTSmartObj<void *,CAutoHandle_Policy<void *> >();
private:
	void Attach( CTSmartObj<void *,CAutoHandle_Policy<void *> > const & );
public:
	void Attach( void * const & );
	void * Detach();
	void * const & Get() const;
	void * * operator&();
	void * * GetAddress();
	void Release();
	BOOLEAN IsEmpty() const;
	CTSmartObj<void *,CAutoHandle_Policy<void *> > && Move();
private:
	CTSmartObj<void *,CAutoHandle_Policy<void *> > & operator=( void * const & );
	CTSmartObj<void *,CAutoHandle_Policy<void *> > & operator=( CTSmartObj<void *,CAutoHandle_Policy<void *> > const & );
public:
	CTSmartObj<void *,CAutoHandle_Policy<void *> > & operator=( CTSmartObj<void *,CAutoHandle_Policy<void *> > && );
protected:
	/*0000*/ void * _obj;
	void Clear();
public:
	void * __vecDelDtor( UINT );
	/*0008*/
};

class CTSmartPtr<unsigned char,CTContainer_PolicyCoTaskMem> : public CTSmartObj<unsigned char *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > {
public:
	void CTSmartPtr<unsigned char,CTContainer_PolicyCoTaskMem>( CTSmartPtr<unsigned char,CTContainer_PolicyCoTaskMem> && );
	void CTSmartPtr<unsigned char,CTContainer_PolicyCoTaskMem>( UCHAR * );
	void CTSmartPtr<unsigned char,CTContainer_PolicyCoTaskMem>();
	UCHAR * const & operator unsigned char *const &() const;
	UCHAR * const & operator->() const;
	CTSmartPtr<unsigned char,CTContainer_PolicyCoTaskMem> && Move();
	CTSmartPtr<unsigned char,CTContainer_PolicyCoTaskMem> & operator=( CTSmartPtr<unsigned char,CTContainer_PolicyCoTaskMem> && );
	void ~CTSmartPtr<unsigned char,CTContainer_PolicyCoTaskMem>();
	void * __vecDelDtor( UINT );
	/*0008*/
};

class CTSmartPtr<unsigned short *,CTContainer_PolicyCoTaskMem> : public CTSmartObj<unsigned short * *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > {
public:
	void CTSmartPtr<unsigned short *,CTContainer_PolicyCoTaskMem>( CTSmartPtr<unsigned short *,CTContainer_PolicyCoTaskMem> && );
	void CTSmartPtr<unsigned short *,CTContainer_PolicyCoTaskMem>( WCHAR * * );
	void CTSmartPtr<unsigned short *,CTContainer_PolicyCoTaskMem>();
	WCHAR * * const & operator unsigned short **const &() const;
	WCHAR * * const & operator->() const;
	CTSmartPtr<unsigned short *,CTContainer_PolicyCoTaskMem> && Move();
	CTSmartPtr<unsigned short *,CTContainer_PolicyCoTaskMem> & operator=( CTSmartPtr<unsigned short *,CTContainer_PolicyCoTaskMem> && );
	void ~CTSmartPtr<unsigned short *,CTContainer_PolicyCoTaskMem>();
	void * __vecDelDtor( UINT );
	/*0008*/
};

class CTSmartPtr<unsigned short,CTContainer_PolicyCoTaskMem> : public CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> > {
public:
	void CTSmartPtr<unsigned short,CTContainer_PolicyCoTaskMem>( CTSmartPtr<unsigned short,CTContainer_PolicyCoTaskMem> && );
	void CTSmartPtr<unsigned short,CTContainer_PolicyCoTaskMem>( WCHAR * );
	void CTSmartPtr<unsigned short,CTContainer_PolicyCoTaskMem>();
	WCHAR * const & operator unsigned short *const &() const;
	WCHAR * const & operator->() const;
	CTSmartPtr<unsigned short,CTContainer_PolicyCoTaskMem> && Move();
	CTSmartPtr<unsigned short,CTContainer_PolicyCoTaskMem> & operator=( CTSmartPtr<unsigned short,CTContainer_PolicyCoTaskMem> && );
	void ~CTSmartPtr<unsigned short,CTContainer_PolicyCoTaskMem>();
	void * __vecDelDtor( UINT );
	/*0008*/
};

class CTSmartPtr<unsigned short,CTContainer_PolicyLocalMem> : public CTSmartObj<unsigned short *,CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem> > {
public:
	void CTSmartPtr<unsigned short,CTContainer_PolicyLocalMem>( CTSmartPtr<unsigned short,CTContainer_PolicyLocalMem> && );
	void CTSmartPtr<unsigned short,CTContainer_PolicyLocalMem>( WCHAR * );
	void CTSmartPtr<unsigned short,CTContainer_PolicyLocalMem>();
	WCHAR * const & operator unsigned short *const &() const;
	WCHAR * const & operator->() const;
	CTSmartPtr<unsigned short,CTContainer_PolicyLocalMem> && Move();
	CTSmartPtr<unsigned short,CTContainer_PolicyLocalMem> & operator=( CTSmartPtr<unsigned short,CTContainer_PolicyLocalMem> && );
	void ~CTSmartPtr<unsigned short,CTContainer_PolicyLocalMem>();
	void * __vecDelDtor( UINT );
	/*0008*/
};

class CTSmartPtr_PolicyComplete<CTContainer_PolicyCoTaskMem> : public CTContainer_PolicyCoTaskMem {
	/*0001*/
};

class CTSmartPtr_PolicyComplete<CTContainer_PolicyLocalMem> : public CTContainer_PolicyLocalMem {
	/*0001*/
};

class CThreadRefTaker {
public:
	void CThreadRefTaker( CThreadRefTaker const & );
	void CThreadRefTaker();
	/*0000*/ virtual void ~CThreadRefTaker();
protected:
	/*0008*/ IUnknown * _punkThreadRef;
public:
	CThreadRefTaker & operator=( CThreadRefTaker const & );
	void __local_vftable_ctor_closure();
	/*0000*/ virtual void * __vecDelDtor( UINT );
	/*0010*/
};

class CUIInfoT<CEmptyType> {
public:
	static HRESULT CanRunUI( INT * );
private:
	static HRESULT GetUserObjectName( void * , WCHAR * * );
	/*0001*/
};

class CUXDisplayUtilT<CEmptyType> {

	class ARGB : public ARGBBASE {
	public:
		void ARGB( ULONG const );
		void ARGB( UCHAR const , UCHAR const , UCHAR const , UCHAR const );
		void ARGB();
		ULONG operator unsigned long() const;
		/*0004*/
	};


	class ARGBBASE {
	public:
		/*0000*/ UCHAR Blue;
		/*0001*/ UCHAR Green;
		/*0002*/ UCHAR Red;
		/*0003*/ UCHAR Alpha;
		void ARGBBASE( ULONG const );
		void ARGBBASE( UCHAR const , UCHAR const , UCHAR const , UCHAR const );
		void ARGBBASE();
		ULONG operator unsigned long() const;
		/*0004*/
	};

public:
	static INT GetPrimaryMonitorPhysicalWorkArea( tagRECT * );
	static HRESULT DrawTextInternal( HDC__ * , WCHAR const * , HFONT__ * , ULONG , tagRECT * );
	static HRESULT CreateFontInternal( LONG , WCHAR const * , LONG , INT , HFONT__ * * );
	static HRESULT GetInitialBitmapSize( _BITMAP_TYPE , tagRECT * , INT * , INT * );
	static HRESULT CalculateBorders( _BITMAP_TYPE , INT * , INT * , INT * , INT * );
	static HRESULT GetFontSizes( _BITMAP_TYPE , LONG * , LONG * );
	static HRESULT CreateBitmap( HDC__ * , INT , INT , HBITMAP__ * * , tagBITMAPINFO * );
	static HRESULT IsHighContrastModeOn( INT * );
	static void UpdateRectForDPI( INT , tagRECT * );
	static HRESULT CalculateBitMapPosition( _BITMAP_TYPE , INT , INT , INT , tagPOINT * );
	static HRESULT IsValidDibSection( HDC__ * , INT * );
	static HRESULT GetDPISetting( INT * , tagRECT * );
	static HRESULT DrawThemeText( HDC__ * , WCHAR const * , HFONT__ * , ULONG , _BITMAP_TYPE , INT , tagRECT * );
private:
	static void DrawTextOverARGB( tagRGBQUAD * , INT , INT , INT , INT , tagRGBQUAD * , INT , INT , INT , ULONG );
	/*0001*/
};

class CUxDisplayStringsT<CEmptyType> {
public:
	static HRESULT GetAllPreferredStrings( WCHAR * , UINT , WCHAR * * * , INT * , _LANG_FONT_NAMES * );
private:
	static HRESULT GetPreferredLanguagesArray( ULONG * * , ULONG * );
	static HRESULT CheckBiDirectionalLanguage( ULONG , INT * );
	static HRESULT GetFontsForLCIDIndex( UINT , _LANG_FONT_NAMES * );
	/*0001*/
};

enum CWMO_FLAGS {
	CWMO_DEFAULT = 0x0,
	CWMO_DISPATCH_CALLS = 0x1,
	CWMO_DISPATCH_WINDOW_MESSAGES = 0x2
};

class ConditionVariable : public Lock {
	void ConditionVariable( ConditionVariable const & );
public:
	void ConditionVariable();
	HRESULT Sleep();
	void Wake();
private:
	ConditionVariable & operator=( ConditionVariable const & );
	/*0028*/ _RTL_CONDITION_VARIABLE conditionVariable;
public:
	void ~ConditionVariable();
	void * __vecDelDtor( UINT );
	/*0030*/
};

struct CsFrame {
	/*0000*/ unsigned __int8 SavedR10;
	/*0008*/ unsigned __int8 SavedR11;
	/*0010*/
};

enum DATAOBJ_GET_ITEM_FLAGS {
	DOGIF_DEFAULT = 0x0,
	DOGIF_TRAVERSE_LINK = 0x1,
	DOGIF_NO_HDROP = 0x2,
	DOGIF_NO_URL = 0x4,
	DOGIF_ONLY_IF_ONE = 0x8
};

enum DEFAULTSAVEFOLDERTYPE {
	DSFT_DETECT = 0x1,
	DSFT_PRIVATE = 0x2,
	DSFT_PUBLIC = 0x3
};

enum DEFAULT_FOLDER_MENU_RESTRICTIONS {
	DFMR_DEFAULT = 0x0,
	DFMR_NO_STATIC_VERBS = 0x8,
	DFMR_STATIC_VERBS_ONLY = 0x10,
	DFMR_NO_RESOURCE_VERBS = 0x20,
	DFMR_OPTIN_HANDLERS_ONLY = 0x40,
	DFMR_RESOURCE_AND_FOLDER_VERBS_ONLY = 0x80,
	DFMR_USE_SPECIFIED_HANDLERS = 0x100,
	DFMR_USE_SPECIFIED_VERBS = 0x200,
	DFMR_NO_ASYNC_VERBS = 0x400,
	DFMR_NO_NATIVECPU_VERBS = 0x800
};

enum DEF_SHARE_ID {
	DEFSHAREID_USERS = 0x1,
	DEFSHAREID_PUBLIC = 0x2
};

enum DELAYED_RETRIEVAL_TYPE {
	DRT_FILEITEM = 0x0,
	DRT_PREFETCHEDTHUMBNAIL = 0x1,
	DRT_PREFETCHEDPROPERTIES = 0x2,
	DRT_PROPERTIES = 0x3,
	DRT_MUSICPROPERTIES = 0x4,
	DRT_IMAGEPROPERTIES = 0x5,
	DRT_VIDEOPROPERTIES = 0x6,
	DRT_DOCUMENTPROPERTIES = 0x7,
	DRT_BASICPROPERTIES = 0x8,
	DRT_REMOTEFILEITEM = 0x9
};

struct DELEGATEITEMID {
	/*0000*/ USHORT cbSize;
	/*0002*/ USHORT wOuter;
	/*0004*/ USHORT cbInner;
	/*0006*/ UCHAR rgb[0x1];
	/*0007*/
};

struct DELETE_USN_JOURNAL_DATA {
	/*0000*/ ULONGLONG UsnJournalID;
	/*0008*/ ULONG DeleteFlags;
	/*0010*/
};

struct DESKBANDINFO {
	/*0000*/ ULONG dwMask;
	/*0004*/ _POINTL ptMinSize;
	/*000c*/ _POINTL ptMaxSize;
	/*0014*/ _POINTL ptIntegral;
	/*001c*/ _POINTL ptActual;
	/*0024*/ WCHAR wszTitle[0x100];
	/*0224*/ ULONG dwModeFlags;
	/*0228*/ ULONG crBkgnd;
	/*022c*/
};

enum DESKTOP_SLIDESHOW_DIRECTION {
	DSD_FORWARD = 0x0,
	DSD_BACKWARD = 0x1
};

enum DESKTOP_SLIDESHOW_OPTIONS {
	DSO_SHUFFLEIMAGES = 0x1
};

enum DESKTOP_SLIDESHOW_STATE {
	DSS_ENABLED = 0x1,
	DSS_SLIDESHOW = 0x2,
	DSS_DISABLED_BY_REMOTE_SESSION = 0x4
};

enum DESKTOP_VISIBILITY_NOTIFICATION_TYPE {
	DVNT_GLOBAL = 0x0,
	DVNT_PERMONITOR = 0x1
};

enum DESKTOP_WALLPAPER_POSITION {
	DWPOS_CENTER = 0x0,
	DWPOS_TILE = 0x1,
	DWPOS_STRETCH = 0x2,
	DWPOS_FIT = 0x3,
	DWPOS_FILL = 0x4,
	DWPOS_SPAN = 0x5
};

enum DESTLISTKIND {
	DESTLISTKIND_FIRST = 0x0,
	DESTLISTKIND_AUTOMATIC = 0x0,
	DESTLISTKIND_CUSTOM = 0x1,
	DESTLISTKIND_LAST = 0x1
};

enum DESTLISTTYPE {
	DLT_PINNED = 0x0,
	DLT_RECENT = 0x1,
	DLT_FREQUENT = 0x2
};

enum DEVICE_SCALE_FACTOR {
	DEVICE_SCALE_FACTOR_INVALID = 0x0,
	SCALE_100_PERCENT = 0x64,
	SCALE_120_PERCENT = 0x78,
	SCALE_125_PERCENT = 0x7d,
	SCALE_140_PERCENT = 0x8c,
	SCALE_150_PERCENT = 0x96,
	SCALE_160_PERCENT = 0xa0,
	SCALE_175_PERCENT = 0xaf,
	SCALE_180_PERCENT = 0xb4,
	SCALE_200_PERCENT = 0xc8,
	SCALE_225_PERCENT = 0xe1,
	SCALE_250_PERCENT = 0xfa,
	SCALE_300_PERCENT = 0x12c,
	SCALE_350_PERCENT = 0x15e,
	SCALE_400_PERCENT = 0x190,
	SCALE_450_PERCENT = 0x1c2,
	SCALE_500_PERCENT = 0x1f4
};

class DH_FILENT : public SH<void *,DH_FILENT> {
public:
	void DH_FILENT( void * );
	void DH_FILENT( DH_FILENT const & );
	void DH_FILENT();
	DH_FILENT & operator=( void * );
	DH_FILENT & operator=( DH_FILENT const & );
	DH_FILENT & operator=( INT const );
	static BOOLEAN IsNull( void * );
	static void * GetNull();
	static void Destroy( void * );
	void ~DH_FILENT();
	void * __vecDelDtor( UINT );
	/*0008*/
};

class DH_HANDLE : public SH<void *,DH_HANDLE> {
public:
	void DH_HANDLE( void * );
	void DH_HANDLE( DH_HANDLE const & );
	void DH_HANDLE();
	DH_HANDLE & operator=( void * );
	DH_HANDLE & operator=( DH_HANDLE const & );
	DH_HANDLE & operator=( INT const );
	static void Destroy( void * );
	void ~DH_HANDLE();
	void * __vecDelDtor( UINT );
	/*0008*/
};

class DH_HMODULE : public SH<HINSTANCE__ *,DH_HMODULE> {
public:
	void DH_HMODULE( HINSTANCE__ * );
	void DH_HMODULE( DH_HMODULE const & );
	void DH_HMODULE();
	DH_HMODULE & operator=( HINSTANCE__ * );
	DH_HMODULE & operator=( DH_HMODULE const & );
	DH_HMODULE & operator=( INT const );
	static void Destroy( HINSTANCE__ * );
	void ~DH_HMODULE();
	void * __vecDelDtor( UINT );
	/*0008*/
};

class DH_WAITHANDLE : public SH<void *,DH_WAITHANDLE> {
public:
	void DH_WAITHANDLE( void * );
	void DH_WAITHANDLE( DH_WAITHANDLE const & );
	void DH_WAITHANDLE();
	DH_WAITHANDLE & operator=( void * );
	DH_WAITHANDLE & operator=( DH_WAITHANDLE const & );
	DH_WAITHANDLE & operator=( INT const );
	static void Destroy( void * );
	void ~DH_WAITHANDLE();
	void * __vecDelDtor( UINT );
	/*0008*/
};

enum DIALOG_CONTROL_DPI_CHANGE_BEHAVIORS {
	DCDC_DEFAULT = 0x0,
	DCDC_DISABLE_FONT_UPDATE = 0x1,
	DCDC_DISABLE_RELAYOUT = 0x2
};

enum DIALOG_DPI_CHANGE_BEHAVIORS {
	DDC_DEFAULT = 0x0,
	DDC_DISABLE_ALL = 0x1,
	DDC_DISABLE_RESIZE = 0x2,
	DDC_DISABLE_CONTROL_RELAYOUT = 0x4
};

struct DISK_SPACE_INFORMATION {
	/*0000*/ ULONGLONG ActualTotalAllocationUnits;
	/*0008*/ ULONGLONG ActualAvailableAllocationUnits;
	/*0010*/ ULONGLONG ActualPoolUnavailableAllocationUnits;
	/*0018*/ ULONGLONG CallerTotalAllocationUnits;
	/*0020*/ ULONGLONG CallerAvailableAllocationUnits;
	/*0028*/ ULONGLONG CallerPoolUnavailableAllocationUnits;
	/*0030*/ ULONGLONG UsedAllocationUnits;
	/*0038*/ ULONGLONG TotalReservedAllocationUnits;
	/*0040*/ ULONGLONG VolumeStorageReserveAllocationUnits;
	/*0048*/ ULONGLONG AvailableCommittedAllocationUnits;
	/*0050*/ ULONGLONG PoolAvailableAllocationUnits;
	/*0058*/ ULONG SectorsPerAllocationUnit;
	/*005c*/ ULONG BytesPerSector;
	/*0060*/
};

struct DISPLAYCONFIG_2DREGION {
	/*0000*/ UINT cx;
	/*0004*/ UINT cy;
	/*0008*/
};

struct DISPLAYCONFIG_ADAPTER_NAME {
	/*0000*/ DISPLAYCONFIG_DEVICE_INFO_HEADER header;
	/*0014*/ WCHAR adapterDevicePath[0x80];
	/*0114*/
};

struct DISPLAYCONFIG_DESKTOP_IMAGE_INFO {
	/*0000*/ _POINTL PathSourceSize;
	/*0008*/ _RECTL DesktopImageRegion;
	/*0018*/ _RECTL DesktopImageClip;
	/*0028*/
};

struct DISPLAYCONFIG_DEVICE_INFO_HEADER {
	/*0000*/ DISPLAYCONFIG_DEVICE_INFO_TYPE type;
	/*0004*/ UINT size;
	/*0008*/ _LUID adapterId;
	/*0010*/ UINT id;
	/*0014*/
};

enum DISPLAYCONFIG_DEVICE_INFO_TYPE {
	DISPLAYCONFIG_DEVICE_INFO_GET_SOURCE_NAME = 0x1,
	DISPLAYCONFIG_DEVICE_INFO_GET_TARGET_NAME = 0x2,
	DISPLAYCONFIG_DEVICE_INFO_GET_TARGET_PREFERRED_MODE = 0x3,
	DISPLAYCONFIG_DEVICE_INFO_GET_ADAPTER_NAME = 0x4,
	DISPLAYCONFIG_DEVICE_INFO_SET_TARGET_PERSISTENCE = 0x5,
	DISPLAYCONFIG_DEVICE_INFO_GET_TARGET_BASE_TYPE = 0x6,
	DISPLAYCONFIG_DEVICE_INFO_GET_SUPPORT_VIRTUAL_RESOLUTION = 0x7,
	DISPLAYCONFIG_DEVICE_INFO_SET_SUPPORT_VIRTUAL_RESOLUTION = 0x8,
	DISPLAYCONFIG_DEVICE_INFO_GET_ADVANCED_COLOR_INFO = 0x9,
	DISPLAYCONFIG_DEVICE_INFO_SET_ADVANCED_COLOR_STATE = 0xa,
	DISPLAYCONFIG_DEVICE_INFO_GET_SDR_WHITE_LEVEL = 0xb,
	DISPLAYCONFIG_DEVICE_INFO_FORCE_UINT32 = 0xffffffff
};

struct DISPLAYCONFIG_MODE_INFO {
	/*0000*/ DISPLAYCONFIG_MODE_INFO_TYPE infoType;
	/*0004*/ UINT id;
	/*0008*/ _LUID adapterId;
	/*0010*/ DISPLAYCONFIG_TARGET_MODE targetMode;
	/*0010*/ DISPLAYCONFIG_SOURCE_MODE sourceMode;
	/*0010*/ DISPLAYCONFIG_DESKTOP_IMAGE_INFO desktopImageInfo;
	/*0040*/
};

enum DISPLAYCONFIG_MODE_INFO_TYPE {
	DISPLAYCONFIG_MODE_INFO_TYPE_SOURCE = 0x1,
	DISPLAYCONFIG_MODE_INFO_TYPE_TARGET = 0x2,
	DISPLAYCONFIG_MODE_INFO_TYPE_DESKTOP_IMAGE = 0x3,
	DISPLAYCONFIG_MODE_INFO_TYPE_FORCE_UINT32 = 0xffffffff
};

struct DISPLAYCONFIG_PATH_INFO {
	/*0000*/ DISPLAYCONFIG_PATH_SOURCE_INFO sourceInfo;
	/*0014*/ DISPLAYCONFIG_PATH_TARGET_INFO targetInfo;
	/*0044*/ UINT flags;
	/*0048*/
};

struct DISPLAYCONFIG_PATH_SOURCE_INFO {
	/*0000*/ _LUID adapterId;
	/*0008*/ UINT id;
	/*000c*/ UINT modeInfoIdx;
	/*000c*/ UINT cloneGroupId : 16; // 0x0000ffff;
	/*000c*/ UINT sourceModeInfoIdx : 16; // 0xffff0000;
	/*0010*/ UINT statusFlags;
	/*0014*/
};

struct DISPLAYCONFIG_PATH_TARGET_INFO {
	/*0000*/ _LUID adapterId;
	/*0008*/ UINT id;
	/*000c*/ UINT modeInfoIdx;
	/*000c*/ UINT desktopModeInfoIdx : 16; // 0x0000ffff;
	/*000c*/ UINT targetModeInfoIdx : 16; // 0xffff0000;
	/*0010*/ DISPLAYCONFIG_VIDEO_OUTPUT_TECHNOLOGY outputTechnology;
	/*0014*/ DISPLAYCONFIG_ROTATION rotation;
	/*0018*/ DISPLAYCONFIG_SCALING scaling;
	/*001c*/ DISPLAYCONFIG_RATIONAL refreshRate;
	/*0024*/ DISPLAYCONFIG_SCANLINE_ORDERING scanLineOrdering;
	/*0028*/ INT targetAvailable;
	/*002c*/ UINT statusFlags;
	/*0030*/
};

enum DISPLAYCONFIG_PIXELFORMAT {
	DISPLAYCONFIG_PIXELFORMAT_8BPP = 0x1,
	DISPLAYCONFIG_PIXELFORMAT_16BPP = 0x2,
	DISPLAYCONFIG_PIXELFORMAT_24BPP = 0x3,
	DISPLAYCONFIG_PIXELFORMAT_32BPP = 0x4,
	DISPLAYCONFIG_PIXELFORMAT_NONGDI = 0x5,
	DISPLAYCONFIG_PIXELFORMAT_FORCE_UINT32 = 0xffffffff
};

struct DISPLAYCONFIG_RATIONAL {
	/*0000*/ UINT Numerator;
	/*0004*/ UINT Denominator;
	/*0008*/
};

enum DISPLAYCONFIG_ROTATION {
	DISPLAYCONFIG_ROTATION_IDENTITY = 0x1,
	DISPLAYCONFIG_ROTATION_ROTATE90 = 0x2,
	DISPLAYCONFIG_ROTATION_ROTATE180 = 0x3,
	DISPLAYCONFIG_ROTATION_ROTATE270 = 0x4,
	DISPLAYCONFIG_ROTATION_FORCE_UINT32 = 0xffffffff
};

enum DISPLAYCONFIG_SCALING {
	DISPLAYCONFIG_SCALING_IDENTITY = 0x1,
	DISPLAYCONFIG_SCALING_CENTERED = 0x2,
	DISPLAYCONFIG_SCALING_STRETCHED = 0x3,
	DISPLAYCONFIG_SCALING_ASPECTRATIOCENTEREDMAX = 0x4,
	DISPLAYCONFIG_SCALING_CUSTOM = 0x5,
	DISPLAYCONFIG_SCALING_PREFERRED = 0x80,
	DISPLAYCONFIG_SCALING_FORCE_UINT32 = 0xffffffff
};

enum DISPLAYCONFIG_SCANLINE_ORDERING {
	DISPLAYCONFIG_SCANLINE_ORDERING_UNSPECIFIED = 0x0,
	DISPLAYCONFIG_SCANLINE_ORDERING_PROGRESSIVE = 0x1,
	DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED = 0x2,
	DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED_UPPERFIELDFIRST = 0x2,
	DISPLAYCONFIG_SCANLINE_ORDERING_INTERLACED_LOWERFIELDFIRST = 0x3,
	DISPLAYCONFIG_SCANLINE_ORDERING_FORCE_UINT32 = 0xffffffff
};

struct DISPLAYCONFIG_SET_TARGET_PERSISTENCE {
	/*0000*/ DISPLAYCONFIG_DEVICE_INFO_HEADER header;
	/*0014*/ UINT bootPersistenceOn : 01; // 0x00000001;
	/*0014*/ UINT reserved : 31; // 0xfffffffe;
	/*0014*/ UINT value;
	/*0018*/
};

struct DISPLAYCONFIG_SOURCE_DEVICE_NAME {
	/*0000*/ DISPLAYCONFIG_DEVICE_INFO_HEADER header;
	/*0014*/ WCHAR viewGdiDeviceName[0x20];
	/*0054*/
};

struct DISPLAYCONFIG_SOURCE_MODE {
	/*0000*/ UINT width;
	/*0004*/ UINT height;
	/*0008*/ DISPLAYCONFIG_PIXELFORMAT pixelFormat;
	/*000c*/ _POINTL position;
	/*0014*/
};

struct DISPLAYCONFIG_SUPPORT_VIRTUAL_RESOLUTION {
	/*0000*/ DISPLAYCONFIG_DEVICE_INFO_HEADER header;
	/*0014*/ UINT disableMonitorVirtualResolution : 01; // 0x00000001;
	/*0014*/ UINT reserved : 31; // 0xfffffffe;
	/*0014*/ UINT value;
	/*0018*/
};

struct DISPLAYCONFIG_TARGET_BASE_TYPE {
	/*0000*/ DISPLAYCONFIG_DEVICE_INFO_HEADER header;
	/*0014*/ DISPLAYCONFIG_VIDEO_OUTPUT_TECHNOLOGY baseOutputTechnology;
	/*0018*/
};

struct DISPLAYCONFIG_TARGET_DEVICE_NAME {
	/*0000*/ DISPLAYCONFIG_DEVICE_INFO_HEADER header;
	/*0014*/ DISPLAYCONFIG_TARGET_DEVICE_NAME_FLAGS flags;
	/*0018*/ DISPLAYCONFIG_VIDEO_OUTPUT_TECHNOLOGY outputTechnology;
	/*001c*/ USHORT edidManufactureId;
	/*001e*/ USHORT edidProductCodeId;
	/*0020*/ UINT connectorInstance;
	/*0024*/ WCHAR monitorFriendlyDeviceName[0x40];
	/*00a4*/ WCHAR monitorDevicePath[0x80];
	/*01a4*/
};

struct DISPLAYCONFIG_TARGET_DEVICE_NAME_FLAGS {
	/*0000*/ UINT friendlyNameFromEdid : 01; // 0x00000001;
	/*0000*/ UINT friendlyNameForced : 01; // 0x00000002;
	/*0000*/ UINT edidIdsValid : 01; // 0x00000004;
	/*0000*/ UINT reserved : 29; // 0xfffffff8;
	/*0000*/ UINT value;
	/*0004*/
};

struct DISPLAYCONFIG_TARGET_MODE {
	/*0000*/ DISPLAYCONFIG_VIDEO_SIGNAL_INFO targetVideoSignalInfo;
	/*0030*/
};

struct DISPLAYCONFIG_TARGET_PREFERRED_MODE {
	/*0000*/ DISPLAYCONFIG_DEVICE_INFO_HEADER header;
	/*0014*/ UINT width;
	/*0018*/ UINT height;
	/*0020*/ DISPLAYCONFIG_TARGET_MODE targetMode;
	/*0050*/
};

enum DISPLAYCONFIG_TOPOLOGY_ID {
	DISPLAYCONFIG_TOPOLOGY_INTERNAL = 0x1,
	DISPLAYCONFIG_TOPOLOGY_CLONE = 0x2,
	DISPLAYCONFIG_TOPOLOGY_EXTEND = 0x4,
	DISPLAYCONFIG_TOPOLOGY_EXTERNAL = 0x8,
	DISPLAYCONFIG_TOPOLOGY_FORCE_UINT32 = 0xffffffff
};

enum DISPLAYCONFIG_VIDEO_OUTPUT_TECHNOLOGY {
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_OTHER = 0xffffffff,
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_HD15 = 0x0,
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_SVIDEO = 0x1,
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_COMPOSITE_VIDEO = 0x2,
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_COMPONENT_VIDEO = 0x3,
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_DVI = 0x4,
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_HDMI = 0x5,
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_LVDS = 0x6,
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_D_JPN = 0x8,
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_SDI = 0x9,
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_DISPLAYPORT_EXTERNAL = 0xa,
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_DISPLAYPORT_EMBEDDED = 0xb,
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_UDI_EXTERNAL = 0xc,
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_UDI_EMBEDDED = 0xd,
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_SDTVDONGLE = 0xe,
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_MIRACAST = 0xf,
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_INDIRECT_WIRED = 0x10,
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_INDIRECT_VIRTUAL = 0x11,
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_INTERNAL = 0x80000000,
	DISPLAYCONFIG_OUTPUT_TECHNOLOGY_FORCE_UINT32 = 0xffffffff
};

struct DISPLAYCONFIG_VIDEO_SIGNAL_INFO {
	
	/*0000*/ ULONGLONG pixelRate;
	/*0008*/ DISPLAYCONFIG_RATIONAL hSyncFreq;
	/*0010*/ DISPLAYCONFIG_RATIONAL vSyncFreq;
	/*0018*/ DISPLAYCONFIG_2DREGION activeSize;
	/*0020*/ DISPLAYCONFIG_2DREGION totalSize;
	/*0028*/ <unnamed-type-AdditionalSignalInfo> AdditionalSignalInfo;
	/*0028*/ UINT videoStandard;
	/*002c*/ DISPLAYCONFIG_SCANLINE_ORDERING scanLineOrdering;
	/*0030*/
};

enum DIT_HITTESTATTRIBUTES {
	DIT_HITTESTATTRIBUTES_NONE = 0x0,
	DIT_HITTESTATTRIBUTES_MOUSEWHEEL = 0x1,
	DIT_HITTESTATTRIBUTES_MOUSEWHEELISINCREASING = 0x2,
	DIT_HITTESTATTRIBUTES_MOUSEWHEELISHORIZONTAL = 0x4,
	DIT_HITTESTATTRIBUTES_MOUSEBUTTONDOWN = 0x8,
	DIT_HITTESTATTRIBUTES_TOUCHTARGETING = 0x10,
	DIT_HITTESTATTRIBUTES_NOHOVERPOINTER = 0x20,
	DIT_HITTESTATTRIBUTES_BARRELBUTTONDOWN = 0x40,
	DIT_HITTESTATTRIBUTES_ERASERDOWN = 0x80,
	DIT_HITTESTATTRIBUTES_CONTROLDOWN = 0x100,
	DIT_HITTESTATTRIBUTES_VALID = 0xff
};

struct DLGITEMTEMPLATE {
	/*0000*/ ULONG style;
	/*0004*/ ULONG dwExtendedStyle;
	/*0008*/ SHORT x;
	/*000a*/ SHORT y;
	/*000c*/ SHORT cx;
	/*000e*/ SHORT cy;
	/*0010*/ USHORT id;
	/*0012*/
};

struct DLGTEMPLATE {
	/*0000*/ ULONG style;
	/*0004*/ ULONG dwExtendedStyle;
	/*0008*/ USHORT cdit;
	/*000a*/ SHORT x;
	/*000c*/ SHORT y;
	/*000e*/ SHORT cx;
	/*0010*/ SHORT cy;
	/*0012*/
};

enum DL_ADDRESS_TYPE {
	DlUnicast = 0x0,
	DlMulticast = 0x1,
	DlBroadcast = 0x2
};

struct DNN_LIST {
	/*0000*/ ULONG count;
	/*0004*/ DNN_TYPE DNNValues[0x1];
	/*00d0*/
};

struct DNN_TYPE {
	/*0000*/ WCHAR DNN[0x65];
	/*00ca*/
};

struct DNS_AAAA_DATA {
	/*0000*/ IP6_ADDRESS Ip6Address;
	/*0010*/
};

struct DNS_ATMA_DATA {
	/*0000*/ UCHAR AddressType;
	/*0001*/ UCHAR Address[0x14];
	/*0015*/
};

struct DNS_A_DATA {
	/*0000*/ ULONG IpAddress;
	/*0004*/
};

enum DNS_CONFIG_TYPE {
	DnsConfigPrimaryDomainName_W = 0x0,
	DnsConfigPrimaryDomainName_A = 0x1,
	DnsConfigPrimaryDomainName_UTF8 = 0x2,
	DnsConfigAdapterDomainName_W = 0x3,
	DnsConfigAdapterDomainName_A = 0x4,
	DnsConfigAdapterDomainName_UTF8 = 0x5,
	DnsConfigDnsServerList = 0x6,
	DnsConfigSearchList = 0x7,
	DnsConfigAdapterInfo = 0x8,
	DnsConfigPrimaryHostNameRegistrationEnabled = 0x9,
	DnsConfigAdapterHostNameRegistrationEnabled = 0xa,
	DnsConfigAddressRegistrationMaxCount = 0xb,
	DnsConfigHostName_W = 0xc,
	DnsConfigHostName_A = 0xd,
	DnsConfigHostName_UTF8 = 0xe,
	DnsConfigFullHostName_W = 0xf,
	DnsConfigFullHostName_A = 0x10,
	DnsConfigFullHostName_UTF8 = 0x11,
	DnsConfigNameServer = 0x12
};

enum DNS_CONNECTION_POLICY_TAG {
	TAG_DNS_CONNECTION_POLICY_TAG_DEFAULT = 0x0,
	TAG_DNS_CONNECTION_POLICY_TAG_CONNECTION_MANAGER = 0x1,
	TAG_DNS_CONNECTION_POLICY_TAG_WWWPT = 0x2
};

struct DNS_DHCID_DATA {
	/*0000*/ ULONG dwByteCount;
	/*0004*/ UCHAR DHCID[0x1];
	/*0008*/
};

struct DNS_DS_DATA {
	/*0000*/ USHORT wKeyTag;
	/*0002*/ UCHAR chAlgorithm;
	/*0003*/ UCHAR chDigestType;
	/*0004*/ USHORT wDigestLength;
	/*0006*/ USHORT wPad;
	/*0008*/ UCHAR Digest[0x1];
	/*000a*/
};

enum DNS_FREE_TYPE {
	DnsFreeFlat = 0x0,
	DnsFreeRecordList = 0x1,
	DnsFreeParsedMessageFields = 0x2
};

struct DNS_KEY_DATA {
	/*0000*/ USHORT wFlags;
	/*0002*/ UCHAR chProtocol;
	/*0003*/ UCHAR chAlgorithm;
	/*0004*/ USHORT wKeyLength;
	/*0006*/ USHORT wPad;
	/*0008*/ UCHAR Key[0x1];
	/*000a*/
};

struct DNS_LOC_DATA {
	/*0000*/ USHORT wVersion;
	/*0002*/ USHORT wSize;
	/*0004*/ USHORT wHorPrec;
	/*0006*/ USHORT wVerPrec;
	/*0008*/ ULONG dwLatitude;
	/*000c*/ ULONG dwLongitude;
	/*0010*/ ULONG dwAltitude;
	/*0014*/
};

struct DNS_MINFO_DATAA {
	/*0000*/ CHAR * pNameMailbox;
	/*0008*/ CHAR * pNameErrorsMailbox;
	/*0010*/
};

struct DNS_MINFO_DATAW {
	/*0000*/ WCHAR * pNameMailbox;
	/*0008*/ WCHAR * pNameErrorsMailbox;
	/*0010*/
};

struct DNS_MX_DATAA {
	/*0000*/ CHAR * pNameExchange;
	/*0008*/ USHORT wPreference;
	/*000a*/ USHORT Pad;
	/*0010*/
};

struct DNS_MX_DATAW {
	/*0000*/ WCHAR * pNameExchange;
	/*0008*/ USHORT wPreference;
	/*000a*/ USHORT Pad;
	/*0010*/
};

struct DNS_NAPTR_DATAA {
	/*0000*/ USHORT wOrder;
	/*0002*/ USHORT wPreference;
	/*0008*/ CHAR * pFlags;
	/*0010*/ CHAR * pService;
	/*0018*/ CHAR * pRegularExpression;
	/*0020*/ CHAR * pReplacement;
	/*0028*/
};

struct DNS_NAPTR_DATAW {
	/*0000*/ USHORT wOrder;
	/*0002*/ USHORT wPreference;
	/*0008*/ WCHAR * pFlags;
	/*0010*/ WCHAR * pService;
	/*0018*/ WCHAR * pRegularExpression;
	/*0020*/ WCHAR * pReplacement;
	/*0028*/
};

struct DNS_NSEC3PARAM_DATA {
	/*0000*/ UCHAR chAlgorithm;
	/*0001*/ UCHAR bFlags;
	/*0002*/ USHORT wIterations;
	/*0004*/ UCHAR bSaltLength;
	/*0005*/ UCHAR bPad[0x3];
	/*0008*/ UCHAR pbSalt[0x1];
	/*000a*/
};

struct DNS_NSEC3_DATA {
	/*0000*/ UCHAR chAlgorithm;
	/*0001*/ UCHAR bFlags;
	/*0002*/ USHORT wIterations;
	/*0004*/ UCHAR bSaltLength;
	/*0005*/ UCHAR bHashLength;
	/*0006*/ USHORT wTypeBitMapsLength;
	/*0008*/ UCHAR chData[0x1];
	/*000a*/
};

struct DNS_NSEC_DATAA {
	/*0000*/ CHAR * pNextDomainName;
	/*0008*/ USHORT wTypeBitMapsLength;
	/*000a*/ USHORT wPad;
	/*000c*/ UCHAR TypeBitMaps[0x1];
	/*0010*/
};

struct DNS_NSEC_DATAW {
	/*0000*/ WCHAR * pNextDomainName;
	/*0008*/ USHORT wTypeBitMapsLength;
	/*000a*/ USHORT wPad;
	/*000c*/ UCHAR TypeBitMaps[0x1];
	/*0010*/
};

struct DNS_NULL_DATA {
	/*0000*/ ULONG dwByteCount;
	/*0004*/ UCHAR Data[0x1];
	/*0008*/
};

struct DNS_NXT_DATAA {
	/*0000*/ CHAR * pNameNext;
	/*0008*/ USHORT wNumTypes;
	/*000a*/ USHORT wTypes[0x1];
	/*0010*/
};

struct DNS_NXT_DATAW {
	/*0000*/ WCHAR * pNameNext;
	/*0008*/ USHORT wNumTypes;
	/*000a*/ USHORT wTypes[0x1];
	/*0010*/
};

struct DNS_OPT_DATA {
	/*0000*/ USHORT wDataLength;
	/*0002*/ USHORT wPad;
	/*0004*/ UCHAR Data[0x1];
	/*0006*/
};

struct DNS_PROXY_INFORMATION {
	/*0000*/ ULONG version;
	/*0004*/ DNS_PROXY_INFORMATION_TYPE proxyInformationType;
	/*0008*/ WCHAR * proxyName;
	/*0010*/
};

enum DNS_PROXY_INFORMATION_TYPE {
	DNS_PROXY_INFORMATION_DIRECT = 0x0,
	DNS_PROXY_INFORMATION_DEFAULT_SETTINGS = 0x1,
	DNS_PROXY_INFORMATION_PROXY_NAME = 0x2,
	DNS_PROXY_INFORMATION_DOES_NOT_EXIST = 0x3
};

struct DNS_PTR_DATAA {
	/*0000*/ CHAR * pNameHost;
	/*0008*/
};

struct DNS_PTR_DATAW {
	/*0000*/ WCHAR * pNameHost;
	/*0008*/
};

struct DNS_SIG_DATAA {
	/*0000*/ USHORT wTypeCovered;
	/*0002*/ UCHAR chAlgorithm;
	/*0003*/ UCHAR chLabelCount;
	/*0004*/ ULONG dwOriginalTtl;
	/*0008*/ ULONG dwExpiration;
	/*000c*/ ULONG dwTimeSigned;
	/*0010*/ USHORT wKeyTag;
	/*0012*/ USHORT wSignatureLength;
	/*0018*/ CHAR * pNameSigner;
	/*0020*/ UCHAR Signature[0x1];
	/*0028*/
};

struct DNS_SIG_DATAW {
	/*0000*/ USHORT wTypeCovered;
	/*0002*/ UCHAR chAlgorithm;
	/*0003*/ UCHAR chLabelCount;
	/*0004*/ ULONG dwOriginalTtl;
	/*0008*/ ULONG dwExpiration;
	/*000c*/ ULONG dwTimeSigned;
	/*0010*/ USHORT wKeyTag;
	/*0012*/ USHORT wSignatureLength;
	/*0018*/ WCHAR * pNameSigner;
	/*0020*/ UCHAR Signature[0x1];
	/*0028*/
};

struct DNS_SOA_DATAA {
	/*0000*/ CHAR * pNamePrimaryServer;
	/*0008*/ CHAR * pNameAdministrator;
	/*0010*/ ULONG dwSerialNo;
	/*0014*/ ULONG dwRefresh;
	/*0018*/ ULONG dwRetry;
	/*001c*/ ULONG dwExpire;
	/*0020*/ ULONG dwDefaultTtl;
	/*0028*/
};

struct DNS_SOA_DATAW {
	/*0000*/ WCHAR * pNamePrimaryServer;
	/*0008*/ WCHAR * pNameAdministrator;
	/*0010*/ ULONG dwSerialNo;
	/*0014*/ ULONG dwRefresh;
	/*0018*/ ULONG dwRetry;
	/*001c*/ ULONG dwExpire;
	/*0020*/ ULONG dwDefaultTtl;
	/*0028*/
};

struct DNS_SRV_DATAA {
	/*0000*/ CHAR * pNameTarget;
	/*0008*/ USHORT wPriority;
	/*000a*/ USHORT wWeight;
	/*000c*/ USHORT wPort;
	/*000e*/ USHORT Pad;
	/*0010*/
};

struct DNS_SRV_DATAW {
	/*0000*/ WCHAR * pNameTarget;
	/*0008*/ USHORT wPriority;
	/*000a*/ USHORT wWeight;
	/*000c*/ USHORT wPort;
	/*000e*/ USHORT Pad;
	/*0010*/
};

struct DNS_TKEY_DATAA {
	/*0000*/ CHAR * pNameAlgorithm;
	/*0008*/ UCHAR * pAlgorithmPacket;
	/*0010*/ UCHAR * pKey;
	/*0018*/ UCHAR * pOtherData;
	/*0020*/ ULONG dwCreateTime;
	/*0024*/ ULONG dwExpireTime;
	/*0028*/ USHORT wMode;
	/*002a*/ USHORT wError;
	/*002c*/ USHORT wKeyLength;
	/*002e*/ USHORT wOtherLength;
	/*0030*/ UCHAR cAlgNameLength;
	/*0034*/ INT bPacketPointers;
	/*0038*/
};

struct DNS_TKEY_DATAW {
	/*0000*/ WCHAR * pNameAlgorithm;
	/*0008*/ UCHAR * pAlgorithmPacket;
	/*0010*/ UCHAR * pKey;
	/*0018*/ UCHAR * pOtherData;
	/*0020*/ ULONG dwCreateTime;
	/*0024*/ ULONG dwExpireTime;
	/*0028*/ USHORT wMode;
	/*002a*/ USHORT wError;
	/*002c*/ USHORT wKeyLength;
	/*002e*/ USHORT wOtherLength;
	/*0030*/ UCHAR cAlgNameLength;
	/*0034*/ INT bPacketPointers;
	/*0038*/
};

struct DNS_TLSA_DATA {
	/*0000*/ UCHAR bCertUsage;
	/*0001*/ UCHAR bSelector;
	/*0002*/ UCHAR bMatchingType;
	/*0004*/ USHORT bCertificateAssociationDataLength;
	/*0006*/ UCHAR bPad[0x3];
	/*0009*/ UCHAR bCertificateAssociationData[0x1];
	/*000a*/
};

struct DNS_TSIG_DATAA {
	/*0000*/ CHAR * pNameAlgorithm;
	/*0008*/ UCHAR * pAlgorithmPacket;
	/*0010*/ UCHAR * pSignature;
	/*0018*/ UCHAR * pOtherData;
	/*0020*/ LONGLONG i64CreateTime;
	/*0028*/ USHORT wFudgeTime;
	/*002a*/ USHORT wOriginalXid;
	/*002c*/ USHORT wError;
	/*002e*/ USHORT wSigLength;
	/*0030*/ USHORT wOtherLength;
	/*0032*/ UCHAR cAlgNameLength;
	/*0034*/ INT bPacketPointers;
	/*0038*/
};

struct DNS_TSIG_DATAW {
	/*0000*/ WCHAR * pNameAlgorithm;
	/*0008*/ UCHAR * pAlgorithmPacket;
	/*0010*/ UCHAR * pSignature;
	/*0018*/ UCHAR * pOtherData;
	/*0020*/ LONGLONG i64CreateTime;
	/*0028*/ USHORT wFudgeTime;
	/*002a*/ USHORT wOriginalXid;
	/*002c*/ USHORT wError;
	/*002e*/ USHORT wSigLength;
	/*0030*/ USHORT wOtherLength;
	/*0032*/ UCHAR cAlgNameLength;
	/*0034*/ INT bPacketPointers;
	/*0038*/
};

struct DNS_TXT_DATAA {
	/*0000*/ ULONG dwStringCount;
	/*0008*/ CHAR * pStringArray[0x1];
	/*0010*/
};

struct DNS_TXT_DATAW {
	/*0000*/ ULONG dwStringCount;
	/*0008*/ WCHAR * pStringArray[0x1];
	/*0010*/
};

struct DNS_UNKNOWN_DATA {
	/*0000*/ ULONG dwByteCount;
	/*0004*/ UCHAR bData[0x1];
	/*0008*/
};

struct DNS_WINSR_DATAA {
	/*0000*/ ULONG dwMappingFlag;
	/*0004*/ ULONG dwLookupTimeout;
	/*0008*/ ULONG dwCacheTimeout;
	/*0010*/ CHAR * pNameResultDomain;
	/*0018*/
};

struct DNS_WINSR_DATAW {
	/*0000*/ ULONG dwMappingFlag;
	/*0004*/ ULONG dwLookupTimeout;
	/*0008*/ ULONG dwCacheTimeout;
	/*0010*/ WCHAR * pNameResultDomain;
	/*0018*/
};

struct DNS_WINS_DATA {
	/*0000*/ ULONG dwMappingFlag;
	/*0004*/ ULONG dwLookupTimeout;
	/*0008*/ ULONG dwCacheTimeout;
	/*000c*/ ULONG cWinsServerCount;
	/*0010*/ ULONG WinsServers[0x1];
	/*0014*/
};

struct DNS_WKS_DATA {
	/*0000*/ ULONG IpAddress;
	/*0004*/ UCHAR chProtocol;
	/*0005*/ UCHAR BitMask[0x1];
	/*0008*/
};

struct DOT11_ACCESSNETWORKOPTIONS {
	/*0000*/ UCHAR AccessNetworkType;
	/*0001*/ UCHAR Internet;
	/*0002*/ UCHAR ASRA;
	/*0003*/ UCHAR ESR;
	/*0004*/ UCHAR UESA;
	/*0005*/
};

struct DOT11_ASSOCIATION_COMPLETION_EX_PARAMETERS {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ UCHAR MacAddr[0x6];
	/*000c*/ ULONG uStatus;
	/*0010*/ UCHAR bReAssocReq;
	/*0011*/ UCHAR bReAssocResp;
	/*0014*/ ULONG uAssocReqOffset;
	/*0018*/ ULONG uAssocReqSize;
	/*001c*/ ULONG uAssocRespOffset;
	/*0020*/ ULONG uAssocRespSize;
	/*0024*/ ULONG uBeaconOffset;
	/*0028*/ ULONG uBeaconSize;
	/*002c*/ ULONG uIHVDataOffset;
	/*0030*/ ULONG uIHVDataSize;
	/*0034*/ _DOT11_AUTH_ALGORITHM AuthAlgo;
	/*0038*/ _DOT11_CIPHER_ALGORITHM UnicastCipher;
	/*003c*/ _DOT11_CIPHER_ALGORITHM MulticastCipher;
	/*0040*/ ULONG uActivePhyListOffset;
	/*0044*/ ULONG uActivePhyListSize;
	/*0048*/ UCHAR bFourAddressSupported;
	/*0049*/ UCHAR bPortAuthorized;
	/*004a*/ UCHAR ucActiveQoSProtocol;
	/*004c*/ DOT11_DS_INFO DSInfo;
	/*0050*/ ULONG uEncapTableOffset;
	/*0054*/ ULONG uEncapTableSize;
	/*0058*/ _DOT11_CIPHER_ALGORITHM MulticastMgmtCipher;
	/*005c*/ ULONG uAssocComebackTime;
	/*0060*/ _DOT11_ASSOCIATION_TYPE AssociationType;
	/*0064*/
};

struct DOT11_ASSOCIATION_COMPLETION_PARAMETERS {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ UCHAR MacAddr[0x6];
	/*000c*/ ULONG uStatus;
	/*0010*/ UCHAR bReAssocReq;
	/*0011*/ UCHAR bReAssocResp;
	/*0014*/ ULONG uAssocReqOffset;
	/*0018*/ ULONG uAssocReqSize;
	/*001c*/ ULONG uAssocRespOffset;
	/*0020*/ ULONG uAssocRespSize;
	/*0024*/ ULONG uBeaconOffset;
	/*0028*/ ULONG uBeaconSize;
	/*002c*/ ULONG uIHVDataOffset;
	/*0030*/ ULONG uIHVDataSize;
	/*0034*/ _DOT11_AUTH_ALGORITHM AuthAlgo;
	/*0038*/ _DOT11_CIPHER_ALGORITHM UnicastCipher;
	/*003c*/ _DOT11_CIPHER_ALGORITHM MulticastCipher;
	/*0040*/ ULONG uActivePhyListOffset;
	/*0044*/ ULONG uActivePhyListSize;
	/*0048*/ UCHAR bFourAddressSupported;
	/*0049*/ UCHAR bPortAuthorized;
	/*004a*/ UCHAR ucActiveQoSProtocol;
	/*004c*/ DOT11_DS_INFO DSInfo;
	/*0050*/ ULONG uEncapTableOffset;
	/*0054*/ ULONG uEncapTableSize;
	/*0058*/ _DOT11_CIPHER_ALGORITHM MulticastMgmtCipher;
	/*005c*/ ULONG uAssocComebackTime;
	/*0060*/
};

struct DOT11_ASSOCIATION_INFO_LIST {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uNumOfEntries;
	/*0008*/ ULONG uTotalNumOfEntries;
	/*0010*/ _DOT11_ASSOCIATION_INFO_EX dot11AssocInfo[0x1];
	/*0158*/
};

struct DOT11_ASSOCIATION_PARAMS {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ UCHAR BSSID[0x6];
	/*000c*/ ULONG uAssocRequestIEsOffset;
	/*0010*/ ULONG uAssocRequestIEsLength;
	/*0014*/
};

struct DOT11_ASSOCIATION_START_PARAMETERS {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ UCHAR MacAddr[0x6];
	/*000c*/ _DOT11_SSID SSID;
	/*0030*/ ULONG uIHVDataOffset;
	/*0034*/ ULONG uIHVDataSize;
	/*0038*/
};

struct DOT11_AUTH_ALGORITHM_LIST {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uNumOfEntries;
	/*0008*/ ULONG uTotalNumOfEntries;
	/*000c*/ _DOT11_AUTH_ALGORITHM AlgorithmIds[0x1];
	/*0010*/
};

struct DOT11_AUTH_CIPHER_PAIR {
	/*0000*/ _DOT11_AUTH_ALGORITHM AuthAlgoId;
	/*0004*/ _DOT11_CIPHER_ALGORITHM CipherAlgoId;
	/*0008*/
};

struct DOT11_AUTH_CIPHER_PAIR_LIST {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uNumOfEntries;
	/*0008*/ ULONG uTotalNumOfEntries;
	/*000c*/ DOT11_AUTH_CIPHER_PAIR AuthCipherPairs[0x1];
	/*0014*/
};

enum DOT11_BAND {
	dot11_band_2p4g = 0x1,
	dot11_band_4p9g = 0x2,
	dot11_band_5g = 0x3
};

struct DOT11_BSSID_CANDIDATE {
	/*0000*/ UCHAR BSSID[0x6];
	/*0008*/ ULONG uFlags;
	/*000c*/
};

struct DOT11_BSSID_LIST {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uNumOfEntries;
	/*0008*/ ULONG uTotalNumOfEntries;
	/*000c*/ UCHAR BSSIDs[0x1][0x6];
	/*0014*/
};

struct DOT11_BSS_ENTRY {
	/*0000*/ ULONG uPhyId;
	/*0004*/ DOT11_BSS_ENTRY_PHY_SPECIFIC_INFO PhySpecificInfo;
	/*0010*/ UCHAR dot11BSSID[0x6];
	/*0018*/ _DOT11_BSS_TYPE dot11BSSType;
	/*001c*/ LONG lRSSI;
	/*0020*/ ULONG uLinkQuality;
	/*0024*/ UCHAR bInRegDomain;
	/*0026*/ USHORT usBeaconPeriod;
	/*0028*/ ULONGLONG ullTimestamp;
	/*0030*/ ULONGLONG ullHostTimestamp;
	/*0038*/ USHORT usCapabilityInformation;
	/*003c*/ ULONG uBufferLength;
	/*0040*/ UCHAR ucBuffer[0x1];
	/*0048*/
};

union DOT11_BSS_ENTRY_PHY_SPECIFIC_INFO {
	
	/*0000*/ ULONG uChCenterFrequency;
	/*0000*/ <unnamed-type-FHSS> FHSS;
	/*000c*/
};

struct DOT11_BYTE_ARRAY {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uNumOfBytes;
	/*0008*/ ULONG uTotalNumOfBytes;
	/*000c*/ UCHAR ucBuffer[0x1];
	/*0010*/
};

struct DOT11_CHANNEL_HINT {
	/*0000*/ _DOT11_PHY_TYPE Dot11PhyType;
	/*0004*/ ULONG uChannelNumber;
	/*0008*/
};

struct DOT11_CIPHER_ALGORITHM_LIST {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uNumOfEntries;
	/*0008*/ ULONG uTotalNumOfEntries;
	/*000c*/ _DOT11_CIPHER_ALGORITHM AlgorithmIds[0x1];
	/*0010*/
};

struct DOT11_CIPHER_DEFAULT_KEY_VALUE {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uKeyIndex;
	/*0008*/ _DOT11_CIPHER_ALGORITHM AlgorithmId;
	/*000c*/ UCHAR MacAddr[0x6];
	/*0012*/ UCHAR bDelete;
	/*0013*/ UCHAR bStatic;
	/*0014*/ USHORT usKeyLength;
	/*0016*/ UCHAR ucKey[0x1];
	/*0018*/
};

struct DOT11_CIPHER_KEY_MAPPING_KEY_VALUE {
	/*0000*/ UCHAR PeerMacAddr[0x6];
	/*0008*/ _DOT11_CIPHER_ALGORITHM AlgorithmId;
	/*000c*/ DOT11_DIRECTION Direction;
	/*0010*/ UCHAR bDelete;
	/*0011*/ UCHAR bStatic;
	/*0012*/ USHORT usKeyLength;
	/*0014*/ UCHAR ucKey[0x1];
	/*0018*/
};

struct DOT11_CONNECTION_COMPLETION_PARAMETERS {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uStatus;
	/*0008*/
};

struct DOT11_CONNECTION_START_PARAMETERS {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ _DOT11_BSS_TYPE BSSType;
	/*0008*/ UCHAR AdhocBSSID[0x6];
	/*0010*/ _DOT11_SSID AdhocSSID;
	/*0034*/
};

struct DOT11_COUNTRY_OR_REGION_STRING_LIST {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uNumOfEntries;
	/*0008*/ ULONG uTotalNumOfEntries;
	/*000c*/ UCHAR CountryOrRegionStrings[0x1][0x3];
	/*0010*/
};

struct DOT11_DATA_RATE_MAPPING_ENTRY {
	/*0000*/ UCHAR ucDataRateIndex;
	/*0001*/ UCHAR ucDataRateFlag;
	/*0002*/ USHORT usDataRateValue;
	/*0004*/
};

enum DOT11_DIRECTION {
	DOT11_DIR_INBOUND = 0x1,
	DOT11_DIR_OUTBOUND = 0x2,
	DOT11_DIR_BOTH = 0x3
};

struct DOT11_DISASSOCIATION_PARAMETERS {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ UCHAR MacAddr[0x6];
	/*000c*/ ULONG uReason;
	/*0010*/ ULONG uIHVDataOffset;
	/*0014*/ ULONG uIHVDataSize;
	/*0018*/
};

enum DOT11_DS_INFO {
	DOT11_DS_CHANGED = 0x0,
	DOT11_DS_UNCHANGED = 0x1,
	DOT11_DS_UNKNOWN = 0x2
};

struct DOT11_ENCAP_ENTRY {
	/*0000*/ USHORT usEtherType;
	/*0002*/ USHORT usEncapType;
	/*0004*/
};

struct DOT11_ERP_PHY_ATTRIBUTES {
	/*0000*/ DOT11_HRDSSS_PHY_ATTRIBUTES HRDSSSAttributes;
	/*0008*/ UCHAR bERPPBCCOptionImplemented;
	/*0009*/ UCHAR bDSSSOFDMOptionImplemented;
	/*000a*/ UCHAR bShortSlotTimeOptionImplemented;
	/*000c*/
};

struct DOT11_EXTSTA_ATTRIBUTES {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uScanSSIDListSize;
	/*0008*/ ULONG uDesiredBSSIDListSize;
	/*000c*/ ULONG uDesiredSSIDListSize;
	/*0010*/ ULONG uExcludedMacAddressListSize;
	/*0014*/ ULONG uPrivacyExemptionListSize;
	/*0018*/ ULONG uKeyMappingTableSize;
	/*001c*/ ULONG uDefaultKeyTableSize;
	/*0020*/ ULONG uWEPKeyValueMaxLength;
	/*0024*/ ULONG uPMKIDCacheSize;
	/*0028*/ ULONG uMaxNumPerSTADefaultKeyTables;
	/*002c*/ UCHAR bStrictlyOrderedServiceClassImplemented;
	/*002d*/ UCHAR ucSupportedQoSProtocolFlags;
	/*002e*/ UCHAR bSafeModeImplemented;
	/*0030*/ ULONG uNumSupportedCountryOrRegionStrings;
	/*0038*/ UCHAR (* pSupportedCountryOrRegionStrings)[0x3];
	/*0040*/ ULONG uInfraNumSupportedUcastAlgoPairs;
	/*0048*/ DOT11_AUTH_CIPHER_PAIR * pInfraSupportedUcastAlgoPairs;
	/*0050*/ ULONG uInfraNumSupportedMcastAlgoPairs;
	/*0058*/ DOT11_AUTH_CIPHER_PAIR * pInfraSupportedMcastAlgoPairs;
	/*0060*/ ULONG uAdhocNumSupportedUcastAlgoPairs;
	/*0068*/ DOT11_AUTH_CIPHER_PAIR * pAdhocSupportedUcastAlgoPairs;
	/*0070*/ ULONG uAdhocNumSupportedMcastAlgoPairs;
	/*0078*/ DOT11_AUTH_CIPHER_PAIR * pAdhocSupportedMcastAlgoPairs;
	/*0080*/ UCHAR bAutoPowerSaveMode;
	/*0084*/ ULONG uMaxNetworkOffloadListSize;
	/*0088*/ UCHAR bMFPCapable;
	/*008c*/ ULONG uInfraNumSupportedMcastMgmtAlgoPairs;
	/*0090*/ DOT11_AUTH_CIPHER_PAIR * pInfraSupportedMcastMgmtAlgoPairs;
	/*0098*/ UCHAR bNeighborReportSupported;
	/*0099*/ UCHAR bAPChannelReportSupported;
	/*009a*/ UCHAR bActionFramesSupported;
	/*009b*/ UCHAR bANQPQueryOffloadSupported;
	/*009c*/ UCHAR bHESSIDConnectionSupported;
	/*00a0*/
};

struct DOT11_EXTSTA_CAPABILITY {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uScanSSIDListSize;
	/*0008*/ ULONG uDesiredBSSIDListSize;
	/*000c*/ ULONG uDesiredSSIDListSize;
	/*0010*/ ULONG uExcludedMacAddressListSize;
	/*0014*/ ULONG uPrivacyExemptionListSize;
	/*0018*/ ULONG uKeyMappingTableSize;
	/*001c*/ ULONG uDefaultKeyTableSize;
	/*0020*/ ULONG uWEPKeyValueMaxLength;
	/*0024*/ ULONG uPMKIDCacheSize;
	/*0028*/ ULONG uMaxNumPerSTADefaultKeyTables;
	/*002c*/
};

struct DOT11_EXTSTA_RECV_CONTEXT {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uReceiveFlags;
	/*0008*/ ULONG uPhyId;
	/*000c*/ ULONG uChCenterFrequency;
	/*0010*/ USHORT usNumberOfMPDUsReceived;
	/*0014*/ LONG lRSSI;
	/*0018*/ UCHAR ucDataRate;
	/*001c*/ ULONG uSizeMediaSpecificInfo;
	/*0020*/ void * pvMediaSpecificInfo;
	/*0028*/ ULONGLONG ullTimestamp;
	/*0030*/
};

struct DOT11_EXTSTA_SEND_CONTEXT {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ USHORT usExemptionActionType;
	/*0008*/ ULONG uPhyId;
	/*000c*/ ULONG uDelayedSleepValue;
	/*0010*/ void * pvMediaSpecificInfo;
	/*0018*/ ULONG uSendFlags;
	/*0020*/
};

struct DOT11_HRDSSS_PHY_ATTRIBUTES {
	/*0000*/ UCHAR bShortPreambleOptionImplemented;
	/*0001*/ UCHAR bPBCCOptionImplemented;
	/*0002*/ UCHAR bChannelAgilityPresent;
	/*0004*/ ULONG uHRCCAModeSupported;
	/*0008*/
};

struct DOT11_IBSS_PARAMS {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ UCHAR bJoinOnly;
	/*0008*/ ULONG uIEsOffset;
	/*000c*/ ULONG uIEsLength;
	/*0010*/
};

struct DOT11_KEY_ALGO_BIP {
	/*0000*/ UCHAR ucIPN[0x6];
	/*0008*/ ULONG ulBIPKeyLength;
	/*000c*/ UCHAR ucBIPKey[0x1];
	/*0010*/
};

struct DOT11_KEY_ALGO_BIP_GMAC_256 {
	/*0000*/ UCHAR ucIPN[0x6];
	/*0008*/ ULONG ulBIPGmac256KeyLength;
	/*000c*/ UCHAR ucBIPGmac256Key[0x1];
	/*0010*/
};

struct DOT11_KEY_ALGO_CCMP {
	/*0000*/ UCHAR ucIV48Counter[0x6];
	/*0008*/ ULONG ulCCMPKeyLength;
	/*000c*/ UCHAR ucCCMPKey[0x1];
	/*0010*/
};

struct DOT11_KEY_ALGO_GCMP {
	/*0000*/ UCHAR ucIV48Counter[0x6];
	/*0008*/ ULONG ulGCMPKeyLength;
	/*000c*/ UCHAR ucGCMPKey[0x1];
	/*0010*/
};

struct DOT11_KEY_ALGO_GCMP_256 {
	/*0000*/ UCHAR ucIV48Counter[0x6];
	/*0008*/ ULONG ulGCMP256KeyLength;
	/*000c*/ UCHAR ucGCMP256Key[0x1];
	/*0010*/
};

struct DOT11_KEY_ALGO_TKIP_MIC {
	/*0000*/ UCHAR ucIV48Counter[0x6];
	/*0008*/ ULONG ulTKIPKeyLength;
	/*000c*/ ULONG ulMICKeyLength;
	/*0010*/ UCHAR ucTKIPMICKeys[0x1];
	/*0014*/
};

struct DOT11_LINK_QUALITY_ENTRY {
	/*0000*/ UCHAR PeerMacAddr[0x6];
	/*0006*/ UCHAR ucLinkQuality;
	/*0007*/
};

struct DOT11_LINK_QUALITY_PARAMETERS {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uLinkQualityListSize;
	/*0008*/ ULONG uLinkQualityListOffset;
	/*000c*/
};

struct DOT11_MAC_ADDRESS_LIST {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uNumOfEntries;
	/*0008*/ ULONG uTotalNumOfEntries;
	/*000c*/ UCHAR MacAddrs[0x1][0x6];
	/*0014*/
};

struct DOT11_MAC_FRAME_STATISTICS {
	/*0000*/ ULONGLONG ullTransmittedFrameCount;
	/*0008*/ ULONGLONG ullReceivedFrameCount;
	/*0010*/ ULONGLONG ullTransmittedFailureFrameCount;
	/*0018*/ ULONGLONG ullReceivedFailureFrameCount;
	/*0020*/ ULONGLONG ullWEPExcludedCount;
	/*0028*/ ULONGLONG ullTKIPLocalMICFailures;
	/*0030*/ ULONGLONG ullTKIPReplays;
	/*0038*/ ULONGLONG ullTKIPICVErrorCount;
	/*0040*/ ULONGLONG ullCCMPReplays;
	/*0048*/ ULONGLONG ullCCMPDecryptErrors;
	/*0050*/ ULONGLONG ullWEPUndecryptableCount;
	/*0058*/ ULONGLONG ullWEPICVErrorCount;
	/*0060*/ ULONGLONG ullDecryptSuccessCount;
	/*0068*/ ULONGLONG ullDecryptFailureCount;
	/*0070*/
};

struct DOT11_MAC_INFO {
	/*0000*/ ULONG uReserved;
	/*0004*/ ULONG uNdisPortNumber;
	/*0008*/ UCHAR MacAddr[0x6];
	/*0010*/
};

struct DOT11_MANUFACTURING_CALLBACK_PARAMETERS {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ _DOT11_MANUFACTURING_CALLBACK_TYPE dot11ManufacturingCallbackType;
	/*0008*/ ULONG uStatus;
	/*0010*/ void * pvContext;
	/*0018*/
};

enum DOT11_MANUFACTURING_SELF_TEST_TYPE {
	DOT11_MANUFACTURING_SELF_TEST_TYPE_INTERFACE = 0x1,
	DOT11_MANUFACTURING_SELF_TEST_TYPE_RF_INTERFACE = 0x2,
	DOT11_MANUFACTURING_SELF_TEST_TYPE_BT_COEXISTENCE = 0x3
};

struct DOT11_MPDU_MAX_LENGTH_INDICATION {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uPhyId;
	/*0008*/ ULONG uMPDUMaxLength;
	/*000c*/
};

struct DOT11_OFDM_PHY_ATTRIBUTES {
	/*0000*/ ULONG uFrequencyBandsSupported;
	/*0004*/
};

struct DOT11_OFFLOAD_NETWORK {
	/*0000*/ _DOT11_SSID Ssid;
	/*0024*/ _DOT11_CIPHER_ALGORITHM UnicastCipher;
	/*0028*/ _DOT11_AUTH_ALGORITHM AuthAlgo;
	/*002c*/ DOT11_CHANNEL_HINT Dot11ChannelHints[0x4];
	/*004c*/
};

struct DOT11_PHY_ATTRIBUTES {
	
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ _DOT11_PHY_TYPE PhyType;
	/*0008*/ UCHAR bHardwarePhyState;
	/*0009*/ UCHAR bSoftwarePhyState;
	/*000a*/ UCHAR bCFPollable;
	/*000c*/ ULONG uMPDUMaxLength;
	/*0010*/ _DOT11_TEMP_TYPE TempType;
	/*0014*/ _DOT11_DIVERSITY_SUPPORT DiversitySupport;
	/*0018*/ <unnamed-type-PhySpecificAttributes> PhySpecificAttributes;
	/*0024*/ ULONG uNumberSupportedPowerLevels;
	/*0028*/ ULONG TxPowerLevels[0x8];
	/*0048*/ ULONG uNumDataRateMappingEntries;
	/*004c*/ DOT11_DATA_RATE_MAPPING_ENTRY DataRateMappingEntries[0x7e];
	/*0244*/ _DOT11_SUPPORTED_DATA_RATES_VALUE_V2 SupportedDataRatesValue;
	/*0444*/
};

struct DOT11_PHY_FRAME_STATISTICS {
	/*0000*/ ULONGLONG ullTransmittedFrameCount;
	/*0008*/ ULONGLONG ullMulticastTransmittedFrameCount;
	/*0010*/ ULONGLONG ullFailedCount;
	/*0018*/ ULONGLONG ullRetryCount;
	/*0020*/ ULONGLONG ullMultipleRetryCount;
	/*0028*/ ULONGLONG ullMaxTXLifetimeExceededCount;
	/*0030*/ ULONGLONG ullTransmittedFragmentCount;
	/*0038*/ ULONGLONG ullRTSSuccessCount;
	/*0040*/ ULONGLONG ullRTSFailureCount;
	/*0048*/ ULONGLONG ullACKFailureCount;
	/*0050*/ ULONGLONG ullReceivedFrameCount;
	/*0058*/ ULONGLONG ullMulticastReceivedFrameCount;
	/*0060*/ ULONGLONG ullPromiscuousReceivedFrameCount;
	/*0068*/ ULONGLONG ullMaxRXLifetimeExceededCount;
	/*0070*/ ULONGLONG ullFrameDuplicateCount;
	/*0078*/ ULONGLONG ullReceivedFragmentCount;
	/*0080*/ ULONGLONG ullPromiscuousReceivedFragmentCount;
	/*0088*/ ULONGLONG ullFCSErrorCount;
	/*0090*/
};

struct DOT11_PHY_ID_LIST {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uNumOfEntries;
	/*0008*/ ULONG uTotalNumOfEntries;
	/*000c*/ ULONG dot11PhyId[0x1];
	/*0010*/
};

struct DOT11_PHY_STATE_PARAMETERS {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uPhyId;
	/*0008*/ UCHAR bHardwarePhyState;
	/*0009*/ UCHAR bSoftwarePhyState;
	/*000c*/
};

struct DOT11_PHY_TYPE_LIST {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uNumOfEntries;
	/*0008*/ ULONG uTotalNumOfEntries;
	/*000c*/ _DOT11_PHY_TYPE dot11PhyType[0x1];
	/*0010*/
};

struct DOT11_PMKID_CANDIDATE_LIST_PARAMETERS {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uCandidateListSize;
	/*0008*/ ULONG uCandidateListOffset;
	/*000c*/
};

struct DOT11_PMKID_ENTRY {
	/*0000*/ UCHAR BSSID[0x6];
	/*0006*/ UCHAR PMKID[0x10];
	/*0018*/ ULONG uFlags;
	/*001c*/
};

struct DOT11_PMKID_LIST {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uNumOfEntries;
	/*0008*/ ULONG uTotalNumOfEntries;
	/*000c*/ DOT11_PMKID_ENTRY PMKIDs[0x1];
	/*0028*/
};

struct DOT11_PORT_STATE_NOTIFICATION {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ UCHAR PeerMac[0x6];
	/*000a*/ UCHAR bOpen;
	/*000c*/
};

struct DOT11_PRIVACY_EXEMPTION {
	/*0000*/ USHORT usEtherType;
	/*0002*/ USHORT usExemptionActionType;
	/*0004*/ USHORT usExemptionPacketType;
	/*0006*/
};

struct DOT11_PRIVACY_EXEMPTION_LIST {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uNumOfEntries;
	/*0008*/ ULONG uTotalNumOfEntries;
	/*000c*/ DOT11_PRIVACY_EXEMPTION PrivacyExemptionEntries[0x1];
	/*0014*/
};

struct DOT11_QOS_PARAMS {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ UCHAR ucEnabledQoSProtocolFlags;
	/*0006*/
};

struct DOT11_ROAMING_COMPLETION_PARAMETERS {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uStatus;
	/*0008*/
};

struct DOT11_ROAMING_START_PARAMETERS {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ UCHAR AdhocBSSID[0x6];
	/*000c*/ _DOT11_SSID AdhocSSID;
	/*0030*/ ULONG uRoamingReason;
	/*0034*/
};

struct DOT11_SSID_LIST {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uNumOfEntries;
	/*0008*/ ULONG uTotalNumOfEntries;
	/*000c*/ _DOT11_SSID SSIDs[0x1];
	/*0030*/
};

struct DOT11_STATISTICS {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0008*/ ULONGLONG ullFourWayHandshakeFailures;
	/*0010*/ ULONGLONG ullTKIPCounterMeasuresInvoked;
	/*0018*/ ULONGLONG ullReserved;
	/*0020*/ DOT11_MAC_FRAME_STATISTICS MacUcastCounters;
	/*0090*/ DOT11_MAC_FRAME_STATISTICS MacMcastCounters;
	/*0100*/ DOT11_PHY_FRAME_STATISTICS PhyCounters[0x1];
	/*0190*/
};

struct DOT11_TKIPMIC_FAILURE_PARAMETERS {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ UCHAR bDefaultKeyFailure;
	/*0008*/ ULONG uKeyIndex;
	/*000c*/ UCHAR PeerMac[0x6];
	/*0014*/
};

struct DOT11_VENUEINFO {
	/*0000*/ UCHAR VenueGroup;
	/*0001*/ UCHAR VenueType;
	/*0002*/
};

struct DOT11_VWIFI_ATTRIBUTES {
	/*0000*/ _NDIS_OBJECT_HEADER Header;
	/*0004*/ ULONG uTotalNumOfEntries;
	/*0008*/ _DOT11_VWIFI_COMBINATION Combinations[0x1];
	/*0018*/
};

enum DPI_AWARENESS {
	DPI_AWARENESS_INVALID = 0xffffffff,
	DPI_AWARENESS_UNAWARE = 0x0,
	DPI_AWARENESS_SYSTEM_AWARE = 0x1,
	DPI_AWARENESS_PER_MONITOR_AWARE = 0x2
};

struct DPI_AWARENESS_CONTEXT__ {
	/*0000*/ INT unused;
	/*0004*/
};

enum DPI_HOSTING_BEHAVIOR {
	DPI_HOSTING_BEHAVIOR_INVALID = 0xffffffff,
	DPI_HOSTING_BEHAVIOR_DEFAULT = 0x0,
	DPI_HOSTING_BEHAVIOR_MIXED = 0x1
};

union EAP_UI_DATA_FORMAT {
	/*0000*/ _EAP_CONFIG_INPUT_FIELD_ARRAY * credData;
	/*0000*/ _EAP_CRED_EXPIRY_REQ * credExpiryData;
	/*0000*/ _EAP_CONFIG_INPUT_FIELD_ARRAY * credLogonData;
	/*0008*/
};

enum EC_ENDOFLINE {
	EC_ENDOFLINE_DETECTFROMCONTENT = 0x0,
	EC_ENDOFLINE_CRLF = 0x1,
	EC_ENDOFLINE_CR = 0x2,
	EC_ENDOFLINE_LF = 0x3
};

enum EC_HOST_UI_MODE {
	ECHUIM_DESKTOP = 0x0,
	ECHUIM_IMMERSIVE = 0x1,
	ECHUIM_SYSTEM_LAUNCHER = 0x2
};

enum EC_SEARCHWEB_ENTRYPOINT {
	EC_SEARCHWEB_ENTRYPOINT_EXTERNAL = 0x0,
	EC_SEARCHWEB_ENTRYPOINT_CONTEXTMENU = 0x1
};

enum EDGE_GESTURE_KIND {
	EGK_TOUCH = 0x0,
	EGK_KEYBOARD = 0x1,
	EGK_MOUSE = 0x2
};

enum EDIT_CONTROL_FEATURE {
	EDIT_CONTROL_FEATURE_ENTERPRISE_DATA_PROTECTION_PASTE_SUPPORT = 0x0,
	EDIT_CONTROL_FEATURE_PASTE_NOTIFICATIONS = 0x1
};

struct EHExceptionRecord {

	struct EHParameters {
		/*0000*/ ULONG magicNumber;
		/*0008*/ void * pExceptionObject;
		/*0010*/ _s_ThrowInfo const * pThrowInfo;
		/*0018*/ void * pThrowImageBase;
		/*0020*/
	};

	/*0000*/ ULONG ExceptionCode;
	/*0004*/ ULONG ExceptionFlags;
	/*0008*/ _EXCEPTION_RECORD * ExceptionRecord;
	/*0010*/ void * ExceptionAddress;
	/*0018*/ ULONG NumberParameters;
	/*0020*/ EHParameters params;
	/*0040*/
};

enum ELEVATION_STATE {
	ELEVATION_NOT_CHECKED = 0x0,
	ELEVATION_CHECKED_SHIELD = 0x1,
	ELEVATION_CHECKED_NOSHIELD = 0x2
};

struct ENTRYID {
	/*0000*/ UCHAR abFlags[0x4];
	/*0004*/ UCHAR ab[0x1];
	/*0005*/
};

enum ENUM_FILE_INFORMATION_CLASS {
	ENUM_FILE_ID_BOTH_DIR_INFO = 0x0,
	ENUM_FILE_BOTH_DIR_INFO = 0x1,
	ENUM_FILE_FULL_DIR_INFO = 0x2
};

enum ETW_COMPRESSION_RESUMPTION_MODE {
	EtwCompressionModeRestart = 0x0,
	EtwCompressionModeNoDisable = 0x1,
	EtwCompressionModeNoRestart = 0x2
};

struct EVENT_ENTRY {
	/*0000*/ _EVENT_DESCRIPTOR EventDescriptor;
	/*0010*/ _EVENT_DATA_DESCRIPTOR * UserData;
	/*0018*/ EVENT_ENTRY * LeftEntry;
	/*0020*/ EVENT_ENTRY * RightEntry;
	/*0028*/ UINT Hash;
	/*002c*/ UCHAR UserDataCount;
	/*002d*/ UCHAR NumAggregateFields;
	/*002e*/
};

struct EVENT_ENTRY_LOOKUP_TABLE {
	/*0000*/ EVENT_ENTRY * EntryBuckets[0x20];
	/*0100*/ ULONG NumEventEntries;
	/*0104*/ ULONG NextBucketToFlush;
	/*0108*/
};

struct EVENT_INSTANCE_INFO {
	/*0000*/ void * RegHandle;
	/*0008*/ ULONG InstanceId;
	/*0010*/
};

enum EXPLORER_BROWSER_FILL_FLAGS {
	EBF_NONE = 0x0,
	EBF_SELECTFROMDATAOBJECT = 0x100,
	EBF_NODROPTARGET = 0x200
};

enum EXPLORER_BROWSER_OPTIONS {
	EBO_NONE = 0x0,
	EBO_NAVIGATEONCE = 0x1,
	EBO_SHOWFRAMES = 0x2,
	EBO_ALWAYSNAVIGATE = 0x4,
	EBO_NOTRAVELLOG = 0x8,
	EBO_NOWRAPPERWINDOW = 0x10,
	EBO_HTMLSHAREPOINTVIEW = 0x20,
	EBO_NOBORDER = 0x40,
	EBO_NOPERSISTVIEWSTATE = 0x80
};

enum EXTENDED_NAME_FORMAT {
	NameUnknown = 0x0,
	NameFullyQualifiedDN = 0x1,
	NameSamCompatible = 0x2,
	NameDisplay = 0x3,
	NameUniqueId = 0x6,
	NameCanonical = 0x7,
	NameUserPrincipal = 0x8,
	NameCanonicalEx = 0x9,
	NameServicePrincipal = 0xa,
	NameDnsDomain = 0xc,
	NameGivenName = 0xd,
	NameSurname = 0xe
};

struct EXTRASEARCH {
	/*0000*/ _GUID guidSearch;
	/*0010*/ WCHAR wszFriendlyName[0x50];
	/*00b0*/ WCHAR wszUrl[0x824];
	/*10f8*/
};

union EapCredentialTypeData {
	/*0000*/ _EapUsernamePasswordCredential username_password;
	/*0000*/ _EapCertificateCredential certificate;
	/*0000*/ _EapSimCredential sim;
	/*0020*/
};

class ErrorHandler {
public:
	static HRESULT Report( HRESULT , WCHAR const * );
	static HRESULT Report( HRESULT , ErrorHandlerOptions );
	static HRESULT Report( HRESULT );
	static HRESULT Report( HRESULT , WCHAR const * , ErrorHandlerOptions );
	/*0001*/
};

enum ErrorHandlerOptions {
	ErrorHandlerOptions_None = 0x0,
	ErrorHandlerOptions_SkipOriginateError = 0x1
};

struct EventRegistrationToken {
	/*0000*/ LONGLONG value;
	/*0008*/
};

enum FDAP {
	FDAP_BOTTOM = 0x0,
	FDAP_TOP = 0x1
};

enum FDE_OVERWRITE_RESPONSE {
	FDEOR_DEFAULT = 0x0,
	FDEOR_ACCEPT = 0x1,
	FDEOR_REFUSE = 0x2
};

enum FDE_SHAREVIOLATION_RESPONSE {
	FDESVR_DEFAULT = 0x0,
	FDESVR_ACCEPT = 0x1,
	FDESVR_REFUSE = 0x2
};

enum FFFP_MODE {
	FFFP_EXACTMATCH = 0x0,
	FFFP_NEARESTPARENTMATCH = 0x1
};

enum FILETYPEATTRIBUTEFLAGS {
	FTA_None = 0x0,
	FTA_Exclude = 0x1,
	FTA_Show = 0x2,
	FTA_HasExtension = 0x4,
	FTA_NoEdit = 0x8,
	FTA_NoRemove = 0x10,
	FTA_NoNewVerb = 0x20,
	FTA_NoEditVerb = 0x40,
	FTA_NoRemoveVerb = 0x80,
	FTA_NoEditDesc = 0x100,
	FTA_NoEditIcon = 0x200,
	FTA_NoEditDflt = 0x400,
	FTA_NoEditVerbCmd = 0x800,
	FTA_NoEditVerbExe = 0x1000,
	FTA_NoDDE = 0x2000,
	FTA_NoEditMIME = 0x8000,
	FTA_OpenIsSafe = 0x10000,
	FTA_AlwaysUnsafe = 0x20000,
	FTA_NoRecentDocs = 0x100000,
	FTA_SafeForElevation = 0x200000,
	FTA_AlwaysUseDirectInvoke = 0x400000
};

struct FILE_ID_DESCRIPTOR {
	/*0000*/ ULONG dwSize;
	/*0004*/ _FILE_ID_TYPE Type;
	/*0008*/ _LARGE_INTEGER FileId;
	/*0008*/ _GUID ObjectId;
	/*0008*/ _FILE_ID_128 ExtendedFileId;
	/*0018*/
};

enum FILE_OPERATION_FLAGS2 {
	FOF2_NONE = 0x0,
	FOF2_MERGEFOLDERSONCOLLISION = 0x1
};

enum FILE_USAGE_TYPE {
	FUT_PLAYING = 0x0,
	FUT_EDITING = 0x1,
	FUT_GENERIC = 0x2
};

struct FIND_BY_SID_DATA {
	/*0000*/ ULONG Restart;
	/*0004*/ _SID Sid;
	/*0010*/
};

struct FIND_BY_SID_OUTPUT {
	/*0000*/ ULONG NextEntryOffset;
	/*0004*/ ULONG FileIndex;
	/*0008*/ ULONG FileNameLength;
	/*000c*/ WCHAR FileName[0x1];
	/*0010*/
};

struct FIXED_INFO_W2KSP1 {
	/*0000*/ CHAR HostName[0x84];
	/*0084*/ CHAR DomainName[0x84];
	/*0108*/ _IP_ADDR_STRING * CurrentDnsServer;
	/*0110*/ _IP_ADDR_STRING DnsServerList;
	/*0140*/ UINT NodeType;
	/*0144*/ CHAR ScopeId[0x104];
	/*0248*/ UINT EnableRouting;
	/*024c*/ UINT EnableProxy;
	/*0250*/ UINT EnableDns;
	/*0258*/
};

struct FLASHWINFO {
	/*0000*/ UINT cbSize;
	/*0008*/ HWND__ * hwnd;
	/*0010*/ ULONG dwFlags;
	/*0014*/ UINT uCount;
	/*0018*/ ULONG dwTimeout;
	/*0020*/
};

struct FLATENTRY {
	/*0000*/ ULONG cb;
	/*0004*/ UCHAR abEntry[0x1];
	/*0008*/
};

struct FLATENTRYLIST {
	/*0000*/ ULONG cEntries;
	/*0004*/ ULONG cbEntries;
	/*0008*/ UCHAR abEntries[0x1];
	/*000c*/
};

struct FLATMTSIDLIST {
	/*0000*/ ULONG cMTSIDs;
	/*0004*/ ULONG cbMTSIDs;
	/*0008*/ UCHAR abMTSIDs[0x1];
	/*000c*/
};

enum FLYOUT_PLACEMENT {
	FP_DEFAULT = 0x0,
	FP_ABOVE = 0x1,
	FP_BELOW = 0x2,
	FP_LEFT = 0x3,
	FP_RIGHT = 0x4
};

enum FOLDERFLAGS {
	FWF_NONE = 0x0,
	FWF_AUTOARRANGE = 0x1,
	FWF_ABBREVIATEDNAMES = 0x2,
	FWF_SNAPTOGRID = 0x4,
	FWF_OWNERDATA = 0x8,
	FWF_BESTFITWINDOW = 0x10,
	FWF_DESKTOP = 0x20,
	FWF_SINGLESEL = 0x40,
	FWF_NOSUBFOLDERS = 0x80,
	FWF_TRANSPARENT = 0x100,
	FWF_NOCLIENTEDGE = 0x200,
	FWF_NOSCROLL = 0x400,
	FWF_ALIGNLEFT = 0x800,
	FWF_NOICONS = 0x1000,
	FWF_SHOWSELALWAYS = 0x2000,
	FWF_NOVISIBLE = 0x4000,
	FWF_SINGLECLICKACTIVATE = 0x8000,
	FWF_NOWEBVIEW = 0x10000,
	FWF_HIDEFILENAMES = 0x20000,
	FWF_CHECKSELECT = 0x40000,
	FWF_NOENUMREFRESH = 0x80000,
	FWF_NOGROUPING = 0x100000,
	FWF_FULLROWSELECT = 0x200000,
	FWF_NOFILTERS = 0x400000,
	FWF_NOCOLUMNHEADER = 0x800000,
	FWF_NOHEADERINALLVIEWS = 0x1000000,
	FWF_EXTENDEDTILES = 0x2000000,
	FWF_TRICHECKSELECT = 0x4000000,
	FWF_AUTOCHECKSELECT = 0x8000000,
	FWF_NOBROWSERVIEWSTATE = 0x10000000,
	FWF_SUBSETGROUPS = 0x20000000,
	FWF_USESEARCHFOLDER = 0x40000000,
	FWF_ALLOWRTLREADING = 0x80000000
};

enum FOLDERLOGICALVIEWMODE {
	FLVM_UNSPECIFIED = 0xffffffff,
	FLVM_FIRST = 0x1,
	FLVM_DETAILS = 0x1,
	FLVM_TILES = 0x2,
	FLVM_ICONS = 0x3,
	FLVM_LIST = 0x4,
	FLVM_CONTENT = 0x5,
	FLVM_LAST = 0x5
};

struct FOLDERSETTINGS {
	/*0000*/ UINT ViewMode;
	/*0004*/ UINT fFlags;
	/*0008*/
};

enum FOLDERVIEWMODE {
	FVM_AUTO = 0xffffffff,
	FVM_FIRST = 0x1,
	FVM_ICON = 0x1,
	FVM_SMALLICON = 0x2,
	FVM_LIST = 0x3,
	FVM_DETAILS = 0x4,
	FVM_THUMBNAIL = 0x5,
	FVM_TILE = 0x6,
	FVM_THUMBSTRIP = 0x7,
	FVM_CONTENT = 0x8,
	FVM_LAST = 0x8
};

enum FOLDER_ENUM_MODE {
	FEM_VIEWRESULT = 0x0,
	FEM_NAVIGATION = 0x1
};

enum FRAMEWORK_INPUT_PANE_BEHAVIOR_MODE {
	FIPBM_AUTO = 0x0,
	FIPBM_STORE_APP = 0x1,
	FIPBM_DESKTOP_APP = 0x2
};

union FT {
	/*0000*/ ULONGLONG ft_scalar;
	/*0000*/ _FILETIME ft_struct;
	/*0008*/
};

enum FVTEXTTYPE {
	FVST_EMPTYTEXT = 0x0
};

enum GETPROPERTYSTOREFLAGS {
	GPS_DEFAULT = 0x0,
	GPS_HANDLERPROPERTIESONLY = 0x1,
	GPS_READWRITE = 0x2,
	GPS_TEMPORARY = 0x4,
	GPS_FASTPROPERTIESONLY = 0x8,
	GPS_OPENSLOWITEM = 0x10,
	GPS_DELAYCREATION = 0x20,
	GPS_BESTEFFORT = 0x40,
	GPS_NO_OPLOCK = 0x80,
	GPS_PREFERQUERYPROPERTIES = 0x100,
	GPS_EXTRINSICPROPERTIES = 0x200,
	GPS_EXTRINSICPROPERTIESONLY = 0x400,
	GPS_VOLATILEPROPERTIES = 0x800,
	GPS_VOLATILEPROPERTIESONLY = 0x1000,
	GPS_MASK_VALID = 0x1fff
};

enum GET_PROPERTY_STORE_TYPE {
	GIPST_CACHED = 0x0,
	GIPST_FALLBACK = 0x1
};

enum GLOBALOPT_SERVICE_REFCOUNT_ENFORCEMENT {
	GLOBALOPT_SERVICE_REFCOUNT_ENFORCEMENT_DEFAULT = 0x0,
	GLOBALOPT_SERVICE_REFCOUNT_ENFORCEMENT_DISALLOWGLOBALREFCOUNT = 0x1,
	GLOBALOPT_SERVICE_REFCOUNT_ENFORCEMENT_VALUECOUNT = 0x2
};

enum GROUP_WINDOW_MANAGEMENT_POLICY {
	GWMP_NONE = 0x0,
	GWMP_DELEGATE_CLOSE_REQUEST = 0x1
};

enum GROUP_WINDOW_ROLE {
	GWR_DEFAULT = 0x0,
	GWR_APPLICATION = 0x1,
	GWR_FALLBACK = 0x2,
	GWR_MAX = 0x2
};

class GetProxyConfigurationOperationServer : public RuntimeClass<Windows::Foundation::IAsyncOperation<Windows::Networking::Connectivity::ProxyConfiguration *>,Windows::Internal::AsyncBaseFTM<Windows::Foundation::IAsyncOperationCompletedHandler<Windows::Networking::Connectivity::ProxyConfiguration *>,1,AsyncOptions<-1,0,&GUID_CAUSALITY_WINDOWS_PLATFORM_ID,2> > > {
public:
	static WCHAR const * InternalGetRuntimeClassName();
	static TrustLevel InternalGetTrustLevel();
	/*    */ virtual HRESULT GetRuntimeClassName( HSTRING__ * * );
	/*    */ virtual HRESULT GetTrustLevel( TrustLevel * );
	/*    */ virtual HRESULT GetIids( ULONG * , _GUID * * );
	/*    */ virtual HRESULT QueryInterface( _GUID const & , void * * );
	/*    */ virtual ULONG Release();
	/*    */ virtual ULONG AddRef();
	/*    */ virtual HRESULT get_Completed( IAsyncOperationCompletedHandler<Networking::Connectivity::ProxyConfiguration *> * * );
	/*    */ virtual HRESULT put_Completed( IAsyncOperationCompletedHandler<Networking::Connectivity::ProxyConfiguration *> * );
	/*    */ virtual HRESULT GetResults( IProxyConfiguration * * );
	void GetProxyConfigurationOperationServer();
	/*    */ virtual void ~GetProxyConfigurationOperationServer();
	HRESULT Initialize( IUriRuntimeClass * );
private:
	/*    */ virtual HRESULT OnStart();
	/*    */ virtual void OnClose();
	/*    */ virtual void OnCancel();
	static void DoGetProxyConfigurationWorker( _TP_CALLBACK_INSTANCE * , void * , _TP_WORK * );
	void DoGetProxyConfiguration();
	static UINT currentId;
	/*00a8*/ String inputUriString;
	/*00b0*/ ComPtr<Windows::Networking::Connectivity::IProxyConfiguration> proxyConfiguration;
	/*00b8*/ void * threadReadyEvent;
	/*00c0*/ HRESULT hrThreadInit;
public:
	void __local_vftable_ctor_closure();
	/*0058*/ virtual void * __vecDelDtor( UINT );
	/*00c8*/
};

class GlobalInterfaceTable {
public:
	static UINT const c_InvalidCookie;
	static HRESULT Marshal( IUnknown * , _GUID const & , ULONG * );
	static HRESULT Unmarshal( ULONG , _GUID const & , void * * );
	static void Revoke( ULONG );
private:
	static HRESULT s_Retrieve();
	static IGlobalInterfaceTable * s_pGlobalInterfaceTable;
	/*0001*/
};

struct HACCEL__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HBITMAP__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HBRUSH__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HCOLORSPACE__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HDC__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HDESK__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HDROP__;

struct HENHMETAFILE__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HFONT__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HGESTUREINFO__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HGLRC__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HHOOK__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HICON__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HIFTIMESTAMPCHANGE__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HIMCC__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HIMC__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HINSTANCE__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HKEY__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HKL__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HLSURF__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HMENU__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HMETAFILE__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HMONITOR__ {
	/*0000*/ INT unused;
	/*0004*/
};

enum HOMEGROUPSHARINGCHOICES {
	HGSC_NONE = 0x0,
	HGSC_MUSICLIBRARY = 0x1,
	HGSC_PICTURESLIBRARY = 0x2,
	HGSC_VIDEOSLIBRARY = 0x4,
	HGSC_DOCUMENTSLIBRARY = 0x8,
	HGSC_PRINTERS = 0x10
};

enum HOSTED_APP_CHANGED {
	HAC_STARTED = 0x0,
	HAC_CLOSED = 0x1,
	HAC_INTERACTIVE = 0x2,
	HAC_NON_INTERACTIVE = 0x3
};

struct HPALETTE__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HPEN__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HRAWINPUT__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HRGN__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HRSRC__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HSAVEDUILANGUAGES__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HSPRITE__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HSTRING_BUFFER__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HSTRING_HEADER {
	
	/*0000*/ <unnamed-type-Reserved> Reserved;
	/*0018*/
};

struct HSTRING__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HSTR__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HSYNTHETICPOINTERDEVICE__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HTASK__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HTOUCHINPUT__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HUMPD__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HWINEVENTHOOK__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HWINSTA__ {
	/*0000*/ INT unused;
	/*0004*/
};

struct HWND__ {
	/*0000*/ INT unused;
	/*0004*/
};

class HandleManager : public RuntimeClass<IHandleManager,FtmBase> {
public:
	static HRESULT GetHandleManager( IHandleManager * * );
	/*    */ virtual HRESULT GetWlanHandle( void * * );
	/*    */ virtual HRESULT GetWwanHandle( void * * );
	/*    */ virtual HRESULT GetWcmHandle( void * * );
	/*    */ virtual HRESULT GetNetworkListManager( ComPtr<INetworkListManagerPrivate> * );
	/*    */ virtual HRESULT GetNetworkListManager2( ComPtr<INetworkListManagerPrivate2> * );
private:
	static WeakRef s_HandleManager;
	static critical_section s_HandleManagerLock;
	/*0040*/ critical_section m_Lock;
	/*0068*/ unique_any_t<details::unique_storage<details::resource_policy<void *,void (__cdecl*)(void *),&details::CloseWlanHandle,wistd::integral_constant<unsigned __int64,0>,void *,__int64,-1,std::nullptr_t> > > m_hWlanHandle;
	/*0070*/ unique_any_t<details::unique_storage<details::resource_policy<void *,void (__cdecl*)(void *),&details::CloseWwanHandle,wistd::integral_constant<unsigned __int64,0>,void *,__int64,-1,std::nullptr_t> > > m_hWwanHandle;
	/*0078*/ unique_any_t<details::unique_storage<details::resource_policy<void *,void (__cdecl*)(void *),&details::CloseWcmHandle,wistd::integral_constant<unsigned __int64,0>,void *,__int64,0,std::nullptr_t> > > m_hWcmHandle;
	/*0080*/ ComPtr<INetworkListManagerPrivate> m_networkListManager;
	/*0088*/ ComPtr<INetworkListManagerPrivate2> m_networkListManager2;
public:
	void HandleManager();
	/*    */ virtual void ~HandleManager();
	void __local_vftable_ctor_closure();
	/*0058*/ virtual void * __vecDelDtor( UINT );
	/*0090*/
};

struct IABContainer : IMAPIContainer {
	/*    */ virtual HRESULT QueryInterface( _GUID const & , void * * ) = 0;
	/*    */ virtual ULONG AddRef() = 0;
	/*    */ virtual ULONG Release() = 0;
	/*    */ virtual HRESULT GetLastError( HRESULT , ULONG , _MAPIERROR * * ) = 0;
	/*    */ virtual HRESULT SaveChanges( ULONG ) = 0;
	/*    */ virtual HRESULT GetProps( _SPropTagArray * , ULONG , ULONG * , _SPropValue * * ) = 0;
	/*    */ virtual HRESULT GetPropList( ULONG , _SPropTagArray * * ) = 0;
	/*    */ virtual HRESULT OpenProperty( ULONG , _GUID const * , ULONG , ULONG , IUnknown * * ) = 0;
	/*    */ virtual HRESULT SetProps( ULONG , _SPropValue * , _SPropProblemArray * * ) = 0;
	/*    */ virtual HRESULT DeleteProps( _SPropTagArray * , _SPropProblemArray * * ) = 0;
	/*    */ virtual HRESULT CopyTo( ULONG , _GUID const * , _SPropTagArray * , ULONG , IMAPIProgress * , _GUID const * , void * , ULONG , _SPropProblemArray * * ) = 0;
	/*    */ virtual HRESULT CopyProps( _SPropTagArray * , ULONG , IMAPIProgress * , _GUID const * , void * , ULONG , _SPropProblemArray * * ) = 0;
	/*    */ virtual HRESULT GetNamesFromIDs( _SPropTagArray * * , _GUID * , ULONG , ULONG * , _MAPINAMEID * * * ) = 0;
	/*    */ virtual HRESULT GetIDsFromNames( ULONG , _MAPINAMEID * * , ULONG , _SPropTagArray * * ) = 0;
	/*    */ virtual HRESULT GetContentsTable( ULONG , IMAPITable * * ) = 0;
	/*    */ virtual HRESULT GetHierarchyTable( ULONG , IMAPITable * * ) = 0;
	/*    */ virtual HRESULT OpenEntry( ULONG , ENTRYID * , _GUID const * , ULONG , ULONG * , IUnknown * * ) = 0;
	/*    */ virtual HRESULT SetSearchCriteria( _SRestriction * , _SBinaryArray * , ULONG ) = 0;
	/*    */ virtual HRESULT GetSearchCriteria( ULONG , _SRestriction * * , _SBinaryArray * * , ULONG * ) = 0;
	/*0098*/ virtual HRESULT CreateEntry( ULONG , ENTRYID * , ULONG , IMAPIProp * * ) = 0;
	/*00a0*/ virtual HRESULT CopyEntries( _SBinaryArray * , ULONG , IMAPIProgress * , ULONG ) = 0;
	/*00a8*/ virtual HRESULT DeleteEntries( _SBinaryArray * , ULONG ) = 0;
	/*00b0*/ virtual HRESULT ResolveNames( _SPropTagArray * , ULONG , _ADRLIST * , _flaglist * ) = 0;
	void IABContainer( IABContainer && );
	void IABContainer( IABContainer const & );
	void IABContainer();
	IABContainer & operator=( IABContainer && );
	IABContainer & operator=( IABContainer const & );
	/*0008*/
};

struct IAccIdentity : IUnknown {
	/*0018*/ virtual HRESULT GetIdentityString( ULONG , UCHAR * * , ULONG * ) = 0;
	void IAccIdentity( IAccIdentity && );
	void IAccIdentity( IAccIdentity const & );
	void IAccIdentity();
	IAccIdentity & operator=( IAccIdentity && );
	IAccIdentity & operator=( IAccIdentity const & );
	/*0008*/
};

struct IAccPropServer : IUnknown {
	/*0018*/ virtual HRESULT GetPropValue( UCHAR const * , ULONG , _GUID , tagVARIANT * , INT * ) = 0;
	void IAccPropServer( IAccPropServer && );
	void IAccPropServer( IAccPropServer const & );
	void IAccPropServer();
	IAccPropServer & operator=( IAccPropServer && );
	IAccPropServer & operator=( IAccPropServer const & );
	/*0008*/
};

struct IAccPropServices : IUnknown {
	/*0018*/ virtual HRESULT SetPropValue( UCHAR const * , ULONG , _GUID , tagVARIANT ) = 0;
	/*0020*/ virtual HRESULT SetPropServer( UCHAR const * , ULONG , _GUID const * , INT , IAccPropServer * , AnnoScope ) = 0;
	/*0028*/ virtual HRESULT ClearProps( UCHAR const * , ULONG , _GUID const * , INT ) = 0;
	/*0030*/ virtual HRESULT SetHwndProp( HWND__ * , ULONG , ULONG , _GUID , tagVARIANT ) = 0;
	/*0038*/ virtual HRESULT SetHwndPropStr( HWND__ * , ULONG , ULONG , _GUID , WCHAR const * ) = 0;
	/*0040*/ virtual HRESULT SetHwndPropServer( HWND__ * , ULONG , ULONG , _GUID const * , INT , IAccPropServer * , AnnoScope ) = 0;
	/*0048*/ virtual HRESULT ClearHwndProps( HWND__ * , ULONG , ULONG , _GUID const * , INT ) = 0;
	/*0050*/ virtual HRESULT ComposeHwndIdentityString( HWND__ * , ULONG , ULONG , UCHAR * * , ULONG * ) = 0;
	/*0058*/ virtual HRESULT DecomposeHwndIdentityString( UCHAR const * , ULONG , HWND__ * * , ULONG * , ULONG * ) = 0;
	/*0060*/ virtual HRESULT SetHmenuProp( HMENU__ * , ULONG , _GUID , tagVARIANT ) = 0;
	/*0068*/ virtual HRESULT SetHmenuPropStr( HMENU__ * , ULONG , _GUID , WCHAR const * ) = 0;
	/*0070*/ virtual HRESULT SetHmenuPropServer( HMENU__ * , ULONG , _GUID const * , INT , IAccPropServer * , AnnoScope ) = 0;
	/*0078*/ virtual HRESULT ClearHmenuProps( HMENU__ * , ULONG , _GUID const * , INT ) = 0;
	/*0080*/ virtual HRESULT ComposeHmenuIdentityString( HMENU__ * , ULONG , UCHAR * * , ULONG * ) = 0;
	/*0088*/ virtual HRESULT DecomposeHmenuIdentityString( UCHAR const * , ULONG , HMENU__ * * , ULONG * ) = 0;
	void IAccPropServices( IAccPropServices && );
	void IAccPropServices( IAccPropServices const & );
	void IAccPropServices();
	IAccPropServices & operator=( IAccPropServices && );
	IAccPropServices & operator=( IAccPropServices const & );
	/*0008*/
};

struct IAccessible : IDispatch {
	/*0038*/ virtual HRESULT get_accParent( IDispatch * * ) = 0;
	/*0040*/ virtual HRESULT get_accChildCount( LONG * ) = 0;
	/*0048*/ virtual HRESULT get_accChild( tagVARIANT , IDispatch * * ) = 0;
	/*0050*/ virtual HRESULT get_accName( tagVARIANT , WCHAR * * ) = 0;
	/*0058*/ virtual HRESULT get_accValue( tagVARIANT , WCHAR * * ) = 0;
	/*0060*/ virtual HRESULT get_accDescription( tagVARIANT , WCHAR * * ) = 0;
	/*0068*/ virtual HRESULT get_accRole( tagVARIANT , tagVARIANT * ) = 0;
	/*0070*/ virtual HRESULT get_accState( tagVARIANT , tagVARIANT * ) = 0;
	/*0078*/ virtual HRESULT get_accHelp( tagVARIANT , WCHAR * * ) = 0;
	/*0080*/ virtual HRESULT get_accHelpTopic( WCHAR * * , tagVARIANT , LONG * ) = 0;
	/*0088*/ virtual HRESULT get_accKeyboardShortcut( tagVARIANT , WCHAR * * ) = 0;
	/*0090*/ virtual HRESULT get_accFocus( tagVARIANT * ) = 0;
	/*0098*/ virtual HRESULT get_accSelection( tagVARIANT * ) = 0;
	/*00a0*/ virtual HRESULT get_accDefaultAction( tagVARIANT , WCHAR * * ) = 0;
	/*00a8*/ virtual HRESULT accSelect( LONG , tagVARIANT ) = 0;
	/*00b0*/ virtual HRESULT accLocation( LONG * , LONG * , LONG * , LONG * , tagVARIANT ) = 0;
	/*00b8*/ virtual HRESULT accNavigate( LONG , tagVARIANT , tagVARIANT * ) = 0;
	/*00c0*/ virtual HRESULT accHitTest( LONG , LONG , tagVARIANT * ) = 0;
	/*00c8*/ virtual HRESULT accDoDefaultAction( tagVARIANT ) = 0;
	/*00d0*/ virtual HRESULT put_accName( tagVARIANT , WCHAR * ) = 0;
	/*00d8*/ virtual HRESULT put_accValue( tagVARIANT , WCHAR * ) = 0;
	void IAccessible( IAccessible && );
	void IAccessible( IAccessible const & );
	void IAccessible();
	IAccessible & operator=( IAccessible && );
	IAccessible & operator=( IAccessible const & );
	/*0008*/
};

struct IAccessibleHandler : IUnknown {
	/*0018*/ virtual HRESULT AccessibleObjectFromID( LONG , LONG , IAccessible * * ) = 0;
	void IAccessibleHandler( IAccessibleHandler && );
	void IAccessibleHandler( IAccessibleHandler const & );
	void IAccessibleHandler();
	IAccessibleHandler & operator=( IAccessibleHandler && );
	IAccessibleHandler & operator=( IAccessibleHandler const & );
	/*0008*/
};

struct IAccessibleProxy : IUnknown {
	/*0018*/ virtual HRESULT SetServer( IAccessible * , IAccessibleServer * ) = 0;
	void IAccessibleProxy( IAccessibleProxy && );
	void IAccessibleProxy( IAccessibleProxy const & );
	void IAccessibleProxy();
	IAccessibleProxy & operator=( IAccessibleProxy && );
	IAccessibleProxy & operator=( IAccessibleProxy const & );
	/*0008*/
};

struct IAccessibleServer : IUnknown {
	/*0018*/ virtual HRESULT SetProxy( IAccessibleProxy * ) = 0;
	/*0020*/ virtual HRESULT GetHWND( HWND__ * * ) = 0;
	/*0028*/ virtual HRESULT GetEnumVariant( IEnumVARIANT * * ) = 0;
	void IAccessibleServer( IAccessibleServer && );
	void IAccessibleServer( IAccessibleServer const & );
	void IAccessibleServer();
	IAccessibleServer & operator=( IAccessibleServer && );
	IAccessibleServer & operator=( IAccessibleServer const & );
	/*0008*/
};

struct IAccessibleWindowlessSite : IUnknown {
	/*0018*/ virtual HRESULT AcquireObjectIdRange( LONG , IAccessibleHandler * , LONG * ) = 0;
	/*0020*/ virtual HRESULT ReleaseObjectIdRange( LONG , IAccessibleHandler * ) = 0;
	/*0028*/ virtual HRESULT QueryObjectIdRanges( IAccessibleHandler * , tagSAFEARRAY * * ) = 0;
	/*0030*/ virtual HRESULT GetParentAccessible( IAccessible * * ) = 0;
	void IAccessibleWindowlessSite( IAccessibleWindowlessSite && );
	void IAccessibleWindowlessSite( IAccessibleWindowlessSite const & );
	void IAccessibleWindowlessSite();
	IAccessibleWindowlessSite & operator=( IAccessibleWindowlessSite && );
	IAccessibleWindowlessSite & operator=( IAccessibleWindowlessSite const & );
	/*0008*/
};

struct IActionProgress : IUnknown {
	/*0018*/ virtual HRESULT Begin( _SPACTION , ULONG ) = 0;
	/*0020*/ virtual HRESULT UpdateProgress( ULONGLONG , ULONGLONG ) = 0;
	/*0028*/ virtual HRESULT UpdateText( _SPTEXT , WCHAR const * , INT ) = 0;
	/*0030*/ virtual HRESULT QueryCancel( INT * ) = 0;
	/*0038*/ virtual HRESULT ResetCancel() = 0;
	/*0040*/ virtual HRESULT End() = 0;
	void IActionProgress( IActionProgress && );
	void IActionProgress( IActionProgress const & );
	void IActionProgress();
	IActionProgress & operator=( IActionProgress && );
	IActionProgress & operator=( IActionProgress const & );
	/*0008*/
};

struct IActionProgressDialog : IUnknown {
	/*0018*/ virtual HRESULT Initialize( ULONG , WCHAR const * , WCHAR const * ) = 0;
	/*0020*/ virtual HRESULT Stop() = 0;
	void IActionProgressDialog( IActionProgressDialog && );
	void IActionProgressDialog( IActionProgressDialog const & );
	void IActionProgressDialog();
	IActionProgressDialog & operator=( IActionProgressDialog && );
	IActionProgressDialog & operator=( IActionProgressDialog const & );
	/*0008*/
};

struct IActivationFactory : IInspectable {
	/*0030*/ virtual HRESULT ActivateInstance( IInspectable * * ) = 0;
	void IActivationFactory( IActivationFactory && );
	void IActivationFactory( IActivationFactory const & );
	void IActivationFactory();
	IActivationFactory & operator=( IActivationFactory && );
	IActivationFactory & operator=( IActivationFactory const & );
	/*0008*/
};

struct IActivationFilter : IUnknown {
	/*0018*/ virtual HRESULT HandleActivation( ULONG , _GUID const & , _GUID * ) = 0;
	void IActivationFilter( IActivationFilter && );
	void IActivationFilter( IActivationFilter const & );
	void IActivationFilter();
	IActivationFilter & operator=( IActivationFilter && );
	IActivationFilter & operator=( IActivationFilter const & );
	/*0008*/
};

struct IAddrBook : IMAPIProp {
	/*    */ virtual HRESULT QueryInterface( _GUID const & , void * * ) = 0;
	/*    */ virtual ULONG AddRef() = 0;
	/*    */ virtual ULONG Release() = 0;
	/*    */ virtual HRESULT GetLastError( HRESULT , ULONG , _MAPIERROR * * ) = 0;
	/*    */ virtual HRESULT SaveChanges( ULONG ) = 0;
	/*    */ virtual HRESULT GetProps( _SPropTagArray * , ULONG , ULONG * , _SPropValue * * ) = 0;
	/*    */ virtual HRESULT GetPropList( ULONG , _SPropTagArray * * ) = 0;
	/*    */ virtual HRESULT OpenProperty( ULONG , _GUID const * , ULONG , ULONG , IUnknown * * ) = 0;
	/*    */ virtual HRESULT SetProps( ULONG , _SPropValue * , _SPropProblemArray * * ) = 0;
	/*    */ virtual HRESULT DeleteProps( _SPropTagArray * , _SPropProblemArray * * ) = 0;
	/*    */ virtual HRESULT CopyTo( ULONG , _GUID const * , _SPropTagArray * , ULONG , IMAPIProgress * , _GUID const * , void * , ULONG , _SPropProblemArray * * ) = 0;
	/*    */ virtual HRESULT CopyProps( _SPropTagArray * , ULONG , IMAPIProgress * , _GUID const * , void * , ULONG , _SPropProblemArray * * ) = 0;
	/*    */ virtual HRESULT GetNamesFromIDs( _SPropTagArray * * , _GUID * , ULONG , ULONG * , _MAPINAMEID * * * ) = 0;
	/*    */ virtual HRESULT GetIDsFromNames( ULONG , _MAPINAMEID * * , ULONG , _SPropTagArray * * ) = 0;
	/*0070*/ virtual HRESULT OpenEntry( ULONG , ENTRYID * , _GUID const * , ULONG , ULONG * , IUnknown * * ) = 0;
	/*0078*/ virtual HRESULT CompareEntryIDs( ULONG , ENTRYID * , ULONG , ENTRYID * , ULONG , ULONG * ) = 0;
	/*0080*/ virtual HRESULT Advise( ULONG , ENTRYID * , ULONG , IMAPIAdviseSink * , ULONG * ) = 0;
	/*0088*/ virtual HRESULT Unadvise( ULONG ) = 0;
	/*0090*/ virtual HRESULT CreateOneOff( WCHAR * , WCHAR * , WCHAR * , ULONG , ULONG * , ENTRYID * * ) = 0;
	/*0098*/ virtual HRESULT NewEntry( ULONG , ULONG , ULONG , ENTRYID * , ULONG , ENTRYID * , ULONG * , ENTRYID * * ) = 0;
	/*00a0*/ virtual HRESULT ResolveName( ULONG , ULONG , WCHAR * , _ADRLIST * ) = 0;
	/*00a8*/ virtual HRESULT Address( ULONG * , _ADRPARM * , _ADRLIST * * ) = 0;
	/*00b0*/ virtual HRESULT Details( ULONG * , void (* )( ULONG , void * ), void * , ULONG , ENTRYID * , LONG (* )( ULONG , void * , ULONG , ENTRYID * , ULONG ), void * , WCHAR * , ULONG ) = 0;
	/*00b8*/ virtual HRESULT RecipOptions( ULONG , ULONG , _ADRENTRY * ) = 0;
	/*00c0*/ virtual HRESULT QueryDefaultRecipOpt( WCHAR * , ULONG , ULONG * , _SPropValue * * ) = 0;
	/*00c8*/ virtual HRESULT GetPAB( ULONG * , ENTRYID * * ) = 0;
	/*00d0*/ virtual HRESULT SetPAB( ULONG , ENTRYID * ) = 0;
	/*00d8*/ virtual HRESULT GetDefaultDir( ULONG * , ENTRYID * * ) = 0;
	/*00e0*/ virtual HRESULT SetDefaultDir( ULONG , ENTRYID * ) = 0;
	/*00e8*/ virtual HRESULT GetSearchPath( ULONG , _SRowSet * * ) = 0;
	/*00f0*/ virtual HRESULT SetSearchPath( ULONG , _SRowSet * ) = 0;
	/*00f8*/ virtual HRESULT PrepareRecips( ULONG , _SPropTagArray * , _ADRLIST * ) = 0;
	void IAddrBook( IAddrBook && );
	void IAddrBook( IAddrBook const & );
	void IAddrBook();
	IAddrBook & operator=( IAddrBook && );
	IAddrBook & operator=( IAddrBook const & );
	/*0008*/
};

struct IAddrExclusionControl : IUnknown {
	/*0018*/ virtual HRESULT GetCurrentAddrExclusionList( _GUID const & , void * * ) = 0;
	/*0020*/ virtual HRESULT UpdateAddrExclusionList( IUnknown * ) = 0;
	void IAddrExclusionControl( IAddrExclusionControl && );
	void IAddrExclusionControl( IAddrExclusionControl const & );
	void IAddrExclusionControl();
	IAddrExclusionControl & operator=( IAddrExclusionControl && );
	IAddrExclusionControl & operator=( IAddrExclusionControl const & );
	/*0008*/
};

struct IAddrTrackingControl : IUnknown {
	/*0018*/ virtual HRESULT EnableCOMDynamicAddrTracking() = 0;
	/*0020*/ virtual HRESULT DisableCOMDynamicAddrTracking() = 0;
	void IAddrTrackingControl( IAddrTrackingControl && );
	void IAddrTrackingControl( IAddrTrackingControl const & );
	void IAddrTrackingControl();
	IAddrTrackingControl & operator=( IAddrTrackingControl && );
	IAddrTrackingControl & operator=( IAddrTrackingControl const & );
	/*0008*/
};

struct IAdviseSink : IUnknown {
	/*0018*/ virtual void OnDataChange( tagFORMATETC * , tagSTGMEDIUM * ) = 0;
	/*0020*/ virtual void OnViewChange( ULONG , LONG ) = 0;
	/*0028*/ virtual void OnRename( IMoniker * ) = 0;
	/*0030*/ virtual void OnSave() = 0;
	/*0038*/ virtual void OnClose() = 0;
	void IAdviseSink( IAdviseSink && );
	void IAdviseSink( IAdviseSink const & );
	void IAdviseSink();
	IAdviseSink & operator=( IAdviseSink && );
	IAdviseSink & operator=( IAdviseSink const & );
	/*0008*/
};

struct IAdviseSink2 : IAdviseSink {
	/*0040*/ virtual void OnLinkSrcChange( IMoniker * ) = 0;
	void IAdviseSink2( IAdviseSink2 && );
	void IAdviseSink2( IAdviseSink2 const & );
	void IAdviseSink2();
	IAdviseSink2 & operator=( IAdviseSink2 && );
	IAdviseSink2 & operator=( IAdviseSink2 const & );
	/*0008*/
};

struct IAdviseSinkEx : IAdviseSink {
	/*0040*/ virtual void OnViewStatusChange( ULONG ) = 0;
	void IAdviseSinkEx( IAdviseSinkEx && );
	void IAdviseSinkEx( IAdviseSinkEx const & );
	void IAdviseSinkEx();
	IAdviseSinkEx & operator=( IAdviseSinkEx && );
	IAdviseSinkEx & operator=( IAdviseSinkEx const & );
	/*0008*/
};

struct IAgileDataObject : IDataObject {
	void IAgileDataObject( IAgileDataObject && );
	void IAgileDataObject( IAgileDataObject const & );
	void IAgileDataObject();
	IAgileDataObject & operator=( IAgileDataObject && );
	IAgileDataObject & operator=( IAgileDataObject const & );
	/*0008*/
};

struct IAgileObject : IUnknown {
	void IAgileObject( IAgileObject && );
	void IAgileObject( IAgileObject const & );
	void IAgileObject();
	IAgileObject & operator=( IAgileObject && );
	IAgileObject & operator=( IAgileObject const & );
	/*0008*/
};

struct IAgileReference : IUnknown {
	/*0018*/ virtual HRESULT Resolve( _GUID const & , void * * ) = 0;
	void IAgileReference( IAgileReference && );
	void IAgileReference( IAgileReference const & );
	void IAgileReference();
	IAgileReference & operator=( IAgileReference && );
	IAgileReference & operator=( IAgileReference const & );
	/*0008*/
};

struct IAllowAstaToAstaDeadlockRisk : IUnknown {
	void IAllowAstaToAstaDeadlockRisk( IAllowAstaToAstaDeadlockRisk && );
	void IAllowAstaToAstaDeadlockRisk( IAllowAstaToAstaDeadlockRisk const & );
	void IAllowAstaToAstaDeadlockRisk();
	IAllowAstaToAstaDeadlockRisk & operator=( IAllowAstaToAstaDeadlockRisk && );
	IAllowAstaToAstaDeadlockRisk & operator=( IAllowAstaToAstaDeadlockRisk const & );
	/*0008*/
};

struct IApartmentShutdown : IUnknown {
	/*0018*/ virtual void OnUninitialize( ULONGLONG ) = 0;
	void IApartmentShutdown( IApartmentShutdown && );
	void IApartmentShutdown( IApartmentShutdown const & );
	void IApartmentShutdown();
	IApartmentShutdown & operator=( IApartmentShutdown && );
	IApartmentShutdown & operator=( IApartmentShutdown const & );
	/*0008*/
};

struct IAppActivationUIInfo : IUnknown {
	/*0018*/ virtual HRESULT GetMonitor( HMONITOR__ * * ) = 0;
	/*0020*/ virtual HRESULT GetInvokePoint( tagPOINT * ) = 0;
	/*0028*/ virtual HRESULT GetShowCommand( INT * ) = 0;
	/*0030*/ virtual HRESULT GetShowUI( INT * ) = 0;
	/*0038*/ virtual HRESULT GetKeyState( ULONG * ) = 0;
	void IAppActivationUIInfo( IAppActivationUIInfo && );
	void IAppActivationUIInfo( IAppActivationUIInfo const & );
	void IAppActivationUIInfo();
	IAppActivationUIInfo & operator=( IAppActivationUIInfo && );
	IAppActivationUIInfo & operator=( IAppActivationUIInfo const & );
	/*0008*/
};

struct IAppVisibility : IUnknown {
	/*0018*/ virtual HRESULT GetAppVisibilityOnMonitor( HMONITOR__ * , MONITOR_APP_VISIBILITY * ) = 0;
	/*0020*/ virtual HRESULT IsLauncherVisible( INT * ) = 0;
	/*0028*/ virtual HRESULT Advise( IAppVisibilityEvents * , ULONG * ) = 0;
	/*0030*/ virtual HRESULT Unadvise( ULONG ) = 0;
	void IAppVisibility( IAppVisibility && );
	void IAppVisibility( IAppVisibility const & );
	void IAppVisibility();
	IAppVisibility & operator=( IAppVisibility && );
	IAppVisibility & operator=( IAppVisibility const & );
	/*0008*/
};

struct IAppVisibilityEvents : IUnknown {
	/*0018*/ virtual HRESULT AppVisibilityOnMonitorChanged( HMONITOR__ * , MONITOR_APP_VISIBILITY , MONITOR_APP_VISIBILITY ) = 0;
	/*0020*/ virtual HRESULT LauncherVisibilityChange( INT ) = 0;
	void IAppVisibilityEvents( IAppVisibilityEvents && );
	void IAppVisibilityEvents( IAppVisibilityEvents const & );
	void IAppVisibilityEvents();
	IAppVisibilityEvents & operator=( IAppVisibilityEvents && );
	IAppVisibilityEvents & operator=( IAppVisibilityEvents const & );
	/*0008*/
};

struct IApplicationActivationManager : IUnknown {
	/*0018*/ virtual HRESULT ActivateApplication( WCHAR const * , WCHAR const * , ACTIVATEOPTIONS , ULONG * ) = 0;
	/*0020*/ virtual HRESULT ActivateForFile( WCHAR const * , IShellItemArray * , WCHAR const * , ULONG * ) = 0;
	/*0028*/ virtual HRESULT ActivateForProtocol( WCHAR const * , IShellItemArray * , ULONG * ) = 0;
	void IApplicationActivationManager( IApplicationActivationManager && );
	void IApplicationActivationManager( IApplicationActivationManager const & );
	void IApplicationActivationManager();
	IApplicationActivationManager & operator=( IApplicationActivationManager && );
	IApplicationActivationManager & operator=( IApplicationActivationManager const & );
	/*0008*/
};

struct IApplicationAssociationRegistration : IUnknown {
	/*0018*/ virtual HRESULT QueryCurrentDefault( WCHAR const * , ASSOCIATIONTYPE , ASSOCIATIONLEVEL , WCHAR * * ) = 0;
	/*0020*/ virtual HRESULT QueryAppIsDefault( WCHAR const * , ASSOCIATIONTYPE , ASSOCIATIONLEVEL , WCHAR const * , INT * ) = 0;
	/*0028*/ virtual HRESULT QueryAppIsDefaultAll( ASSOCIATIONLEVEL , WCHAR const * , INT * ) = 0;
	/*0030*/ virtual HRESULT SetAppAsDefault( WCHAR const * , WCHAR const * , ASSOCIATIONTYPE ) = 0;
	/*0038*/ virtual HRESULT SetAppAsDefaultAll( WCHAR const * ) = 0;
	/*0040*/ virtual HRESULT ClearUserAssociations() = 0;
	void IApplicationAssociationRegistration( IApplicationAssociationRegistration && );
	void IApplicationAssociationRegistration( IApplicationAssociationRegistration const & );
	void IApplicationAssociationRegistration();
	IApplicationAssociationRegistration & operator=( IApplicationAssociationRegistration && );
	IApplicationAssociationRegistration & operator=( IApplicationAssociationRegistration const & );
	/*0008*/
};

struct IApplicationDesignModeSettings : IUnknown {
	/*0018*/ virtual HRESULT SetNativeDisplaySize( tagSIZE ) = 0;
	/*0020*/ virtual HRESULT SetScaleFactor( DEVICE_SCALE_FACTOR ) = 0;
	/*0028*/ virtual HRESULT SetApplicationViewState( APPLICATION_VIEW_STATE ) = 0;
	/*0030*/ virtual HRESULT ComputeApplicationSize( tagSIZE * ) = 0;
	/*0038*/ virtual HRESULT IsApplicationViewStateSupported( APPLICATION_VIEW_STATE , tagSIZE , DEVICE_SCALE_FACTOR , INT * ) = 0;
	/*0040*/ virtual HRESULT TriggerEdgeGesture( EDGE_GESTURE_KIND ) = 0;
	void IApplicationDesignModeSettings( IApplicationDesignModeSettings && );
	void IApplicationDesignModeSettings( IApplicationDesignModeSettings const & );
	void IApplicationDesignModeSettings();
	IApplicationDesignModeSettings & operator=( IApplicationDesignModeSettings && );
	IApplicationDesignModeSettings & operator=( IApplicationDesignModeSettings const & );
	/*0008*/
};

struct IApplicationDesignModeSettings2 : IApplicationDesignModeSettings {
	/*0048*/ virtual HRESULT SetNativeDisplayOrientation( NATIVE_DISPLAY_ORIENTATION ) = 0;
	/*0050*/ virtual HRESULT SetApplicationViewOrientation( APPLICATION_VIEW_ORIENTATION ) = 0;
	/*0058*/ virtual HRESULT SetAdjacentDisplayEdges( ADJACENT_DISPLAY_EDGES ) = 0;
	/*0060*/ virtual HRESULT SetIsOnLockScreen( INT ) = 0;
	/*0068*/ virtual HRESULT SetApplicationViewMinWidth( APPLICATION_VIEW_MIN_WIDTH ) = 0;
	/*0070*/ virtual HRESULT GetApplicationSizeBounds( tagSIZE * , tagSIZE * ) = 0;
	/*0078*/ virtual HRESULT GetApplicationViewOrientation( tagSIZE , APPLICATION_VIEW_ORIENTATION * ) = 0;
	void IApplicationDesignModeSettings2( IApplicationDesignModeSettings2 && );
	void IApplicationDesignModeSettings2( IApplicationDesignModeSettings2 const & );
	void IApplicationDesignModeSettings2();
	IApplicationDesignModeSettings2 & operator=( IApplicationDesignModeSettings2 && );
	IApplicationDesignModeSettings2 & operator=( IApplicationDesignModeSettings2 const & );
	/*0008*/
};

struct IApplicationDestinations : IUnknown {
	/*0018*/ virtual HRESULT SetAppID( WCHAR const * ) = 0;
	/*0020*/ virtual HRESULT RemoveDestination( IUnknown * ) = 0;
	/*0028*/ virtual HRESULT RemoveAllDestinations() = 0;
	void IApplicationDestinations( IApplicationDestinations && );
	void IApplicationDestinations( IApplicationDestinations const & );
	void IApplicationDestinations();
	IApplicationDestinations & operator=( IApplicationDestinations && );
	IApplicationDestinations & operator=( IApplicationDestinations const & );
	/*0008*/
};

struct IApplicationDocumentLists : IUnknown {
	/*0018*/ virtual HRESULT SetAppID( WCHAR const * ) = 0;
	/*0020*/ virtual HRESULT GetList( APPDOCLISTTYPE , UINT , _GUID const & , void * * ) = 0;
	void IApplicationDocumentLists( IApplicationDocumentLists && );
	void IApplicationDocumentLists( IApplicationDocumentLists const & );
	void IApplicationDocumentLists();
	IApplicationDocumentLists & operator=( IApplicationDocumentLists && );
	IApplicationDocumentLists & operator=( IApplicationDocumentLists const & );
	/*0008*/
};

struct IAssocHandler : IUnknown {
	/*0018*/ virtual HRESULT GetName( WCHAR * * ) = 0;
	/*0020*/ virtual HRESULT GetUIName( WCHAR * * ) = 0;
	/*0028*/ virtual HRESULT GetIconLocation( WCHAR * * , INT * ) = 0;
	/*0030*/ virtual HRESULT IsRecommended() = 0;
	/*0038*/ virtual HRESULT MakeDefault( WCHAR const * ) = 0;
	/*0040*/ virtual HRESULT Invoke( IDataObject * ) = 0;
	/*0048*/ virtual HRESULT CreateInvoker( IDataObject * , IAssocHandlerInvoker * * ) = 0;
	void IAssocHandler( IAssocHandler && );
	void IAssocHandler( IAssocHandler const & );
	void IAssocHandler();
	IAssocHandler & operator=( IAssocHandler && );
	IAssocHandler & operator=( IAssocHandler const & );
	/*0008*/
};

struct IAssocHandlerInvoker : IUnknown {
	/*0018*/ virtual HRESULT SupportsSelection() = 0;
	/*0020*/ virtual HRESULT Invoke() = 0;
	void IAssocHandlerInvoker( IAssocHandlerInvoker && );
	void IAssocHandlerInvoker( IAssocHandlerInvoker const & );
	void IAssocHandlerInvoker();
	IAssocHandlerInvoker & operator=( IAssocHandlerInvoker && );
	IAssocHandlerInvoker & operator=( IAssocHandlerInvoker const & );
	/*0008*/
};

struct IAsyncInfo : IInspectable {
	/*0030*/ virtual HRESULT get_Id( UINT * ) = 0;
	/*0038*/ virtual HRESULT get_Status( AsyncStatus * ) = 0;
	/*0040*/ virtual HRESULT get_ErrorCode( HRESULT * ) = 0;
	/*0048*/ virtual HRESULT Cancel() = 0;
	/*0050*/ virtual HRESULT Close() = 0;
	void IAsyncInfo( IAsyncInfo && );
	void IAsyncInfo( IAsyncInfo const & );
	void IAsyncInfo();
	IAsyncInfo & operator=( IAsyncInfo && );
	IAsyncInfo & operator=( IAsyncInfo const & );
	/*0008*/
};

struct IAsyncManager : IUnknown {
	/*0018*/ virtual HRESULT CompleteCall( HRESULT ) = 0;
	/*0020*/ virtual HRESULT GetCallContext( _GUID const & , void * * ) = 0;
	/*0028*/ virtual HRESULT GetState( ULONG * ) = 0;
	void IAsyncManager( IAsyncManager && );
	void IAsyncManager( IAsyncManager const & );
	void IAsyncManager();
	IAsyncManager & operator=( IAsyncManager && );
	IAsyncManager & operator=( IAsyncManager const & );
	/*0008*/
};

class IAsyncOperationEventProvider {
public:
	/*0000*/ virtual void AsyncOperationStarted( UINT , IAsyncInfo * ) = 0;
	/*0008*/ virtual void AsyncOperationStartFailure( UINT , IAsyncInfo * , HRESULT ) = 0;
	/*0010*/ virtual void AsyncOperationCompleted( UINT , IAsyncInfo * ) = 0;
	/*0018*/ virtual void AsyncOperationFailure( UINT , IAsyncInfo * , HRESULT ) = 0;
	/*0020*/ virtual void AsyncOperationCancelled( UINT , IAsyncInfo * ) = 0;
	/*0028*/ virtual void AsyncOperationClosed( UINT , IAsyncInfo * ) = 0;
	/*0030*/ virtual void FireCompletion( UINT , IAsyncInfo * , void * ) = 0;
	/*0038*/ virtual void FireProgress( UINT , IAsyncInfo * , void * ) = 0;
	/*0040*/ virtual void RevokeHandlerFailure( UINT , IAsyncInfo * , HRESULT ) = 0;
	/*0048*/ virtual void RegisterHandlerFailure( UINT , IAsyncInfo * , HRESULT ) = 0;
	/*0050*/ virtual void RetrieveHandlerFailure( UINT , IAsyncInfo * , HRESULT ) = 0;
	void IAsyncOperationEventProvider( IAsyncOperationEventProvider && );
	void IAsyncOperationEventProvider( IAsyncOperationEventProvider const & );
	void IAsyncOperationEventProvider();
	IAsyncOperationEventProvider & operator=( IAsyncOperationEventProvider && );
	IAsyncOperationEventProvider & operator=( IAsyncOperationEventProvider const & );
	/*0008*/
};

struct IAsyncRpcChannelBuffer : IRpcChannelBuffer2 {
	/*0048*/ virtual HRESULT Send( tagRPCOLEMESSAGE * , ISynchronize * , ULONG * ) = 0;
	/*0050*/ virtual HRESULT Receive( tagRPCOLEMESSAGE * , ULONG * ) = 0;
	/*0058*/ virtual HRESULT GetDestCtxEx( tagRPCOLEMESSAGE * , ULONG * , void * * ) = 0;
	void IAsyncRpcChannelBuffer( IAsyncRpcChannelBuffer && );
	void IAsyncRpcChannelBuffer( IAsyncRpcChannelBuffer const & );
	void IAsyncRpcChannelBuffer();
	IAsyncRpcChannelBuffer & operator=( IAsyncRpcChannelBuffer && );
	IAsyncRpcChannelBuffer & operator=( IAsyncRpcChannelBuffer const & );
	/*0008*/
};

struct IAttach : IMAPIProp {
	/*    */ virtual HRESULT QueryInterface( _GUID const & , void * * ) = 0;
	/*    */ virtual ULONG AddRef() = 0;
	/*    */ virtual ULONG Release() = 0;
	/*    */ virtual HRESULT GetLastError( HRESULT , ULONG , _MAPIERROR * * ) = 0;
	/*    */ virtual HRESULT SaveChanges( ULONG ) = 0;
	/*    */ virtual HRESULT GetProps( _SPropTagArray * , ULONG , ULONG * , _SPropValue * * ) = 0;
	/*    */ virtual HRESULT GetPropList( ULONG , _SPropTagArray * * ) = 0;
	/*    */ virtual HRESULT OpenProperty( ULONG , _GUID const * , ULONG , ULONG , IUnknown * * ) = 0;
	/*    */ virtual HRESULT SetProps( ULONG , _SPropValue * , _SPropProblemArray * * ) = 0;
	/*    */ virtual HRESULT DeleteProps( _SPropTagArray * , _SPropProblemArray * * ) = 0;
	/*    */ virtual HRESULT CopyTo( ULONG , _GUID const * , _SPropTagArray * , ULONG , IMAPIProgress * , _GUID const * , void * , ULONG , _SPropProblemArray * * ) = 0;
	/*    */ virtual HRESULT CopyProps( _SPropTagArray * , ULONG , IMAPIProgress * , _GUID const * , void * , ULONG , _SPropProblemArray * * ) = 0;
	/*    */ virtual HRESULT GetNamesFromIDs( _SPropTagArray * * , _GUID * , ULONG , ULONG * , _MAPINAMEID * * * ) = 0;
	/*    */ virtual HRESULT GetIDsFromNames( ULONG , _MAPINAMEID * * , ULONG , _SPropTagArray * * ) = 0;
	void IAttach( IAttach && );
	void IAttach( IAttach const & );
	void IAttach();
	IAttach & operator=( IAttach && );
	IAttach & operator=( IAttach const & );
	/*0008*/
};

struct IAttachmentExecute : IUnknown {
	/*0018*/ virtual HRESULT SetClientTitle( WCHAR const * ) = 0;
	/*0020*/ virtual HRESULT SetClientGuid( _GUID const & ) = 0;
	/*0028*/ virtual HRESULT SetLocalPath( WCHAR const * ) = 0;
	/*0030*/ virtual HRESULT SetFileName( WCHAR const * ) = 0;
	/*0038*/ virtual HRESULT SetSource( WCHAR const * ) = 0;
	/*0040*/ virtual HRESULT SetReferrer( WCHAR const * ) = 0;
	/*0048*/ virtual HRESULT CheckPolicy() = 0;
	/*0050*/ virtual HRESULT Prompt( HWND__ * , ATTACHMENT_PROMPT , ATTACHMENT_ACTION * ) = 0;
	/*0058*/ virtual HRESULT Save() = 0;
	/*0060*/ virtual HRESULT Execute( HWND__ * , WCHAR const * , void * * ) = 0;
	/*0068*/ virtual HRESULT SaveWithUI( HWND__ * ) = 0;
	/*0070*/ virtual HRESULT ClearClientState() = 0;
	void IAttachmentExecute( IAttachmentExecute && );
	void IAttachmentExecute( IAttachmentExecute const & );
	void IAttachmentExecute();
	IAttachmentExecute & operator=( IAttachmentExecute && );
	IAttachmentExecute & operator=( IAttachmentExecute const & );
	/*0008*/
};

struct IAuthenticate : IUnknown {
	/*0018*/ virtual HRESULT Authenticate( HWND__ * * , WCHAR * * , WCHAR * * ) = 0;
	void IAuthenticate( IAuthenticate && );
	void IAuthenticate( IAuthenticate const & );
	void IAuthenticate();
	IAuthenticate & operator=( IAuthenticate && );
	IAuthenticate & operator=( IAuthenticate const & );
	/*0008*/
};

struct IAuthenticateEx : IAuthenticate {
	/*0020*/ virtual HRESULT AuthenticateEx( HWND__ * * , WCHAR * * , WCHAR * * , _tagAUTHENTICATEINFO * ) = 0;
	void IAuthenticateEx( IAuthenticateEx && );
	void IAuthenticateEx( IAuthenticateEx const & );
	void IAuthenticateEx();
	IAuthenticateEx & operator=( IAuthenticateEx && );
	IAuthenticateEx & operator=( IAuthenticateEx const & );
	/*0008*/
};

struct IAxWinAmbientDispatch : IDispatch {
	/*0038*/ virtual HRESULT put_AllowWindowlessActivation( SHORT ) = 0;
	/*0040*/ virtual HRESULT get_AllowWindowlessActivation( SHORT * ) = 0;
	/*0048*/ virtual HRESULT put_BackColor( ULONG ) = 0;
	/*0050*/ virtual HRESULT get_BackColor( ULONG * ) = 0;
	/*0058*/ virtual HRESULT put_ForeColor( ULONG ) = 0;
	/*0060*/ virtual HRESULT get_ForeColor( ULONG * ) = 0;
	/*0068*/ virtual HRESULT put_LocaleID( ULONG ) = 0;
	/*0070*/ virtual HRESULT get_LocaleID( ULONG * ) = 0;
	/*0078*/ virtual HRESULT put_UserMode( SHORT ) = 0;
	/*0080*/ virtual HRESULT get_UserMode( SHORT * ) = 0;
	/*0088*/ virtual HRESULT put_DisplayAsDefault( SHORT ) = 0;
	/*0090*/ virtual HRESULT get_DisplayAsDefault( SHORT * ) = 0;
	/*0098*/ virtual HRESULT put_Font( IFontDisp * ) = 0;
	/*00a0*/ virtual HRESULT get_Font( IFontDisp * * ) = 0;
	/*00a8*/ virtual HRESULT put_MessageReflect( SHORT ) = 0;
	/*00b0*/ virtual HRESULT get_MessageReflect( SHORT * ) = 0;
	/*00b8*/ virtual HRESULT get_ShowGrabHandles( SHORT * ) = 0;
	/*00c0*/ virtual HRESULT get_ShowHatching( SHORT * ) = 0;
	/*00c8*/ virtual HRESULT put_DocHostFlags( ULONG ) = 0;
	/*00d0*/ virtual HRESULT get_DocHostFlags( ULONG * ) = 0;
	/*00d8*/ virtual HRESULT put_DocHostDoubleClickFlags( ULONG ) = 0;
	/*00e0*/ virtual HRESULT get_DocHostDoubleClickFlags( ULONG * ) = 0;
	/*00e8*/ virtual HRESULT put_AllowContextMenu( SHORT ) = 0;
	/*00f0*/ virtual HRESULT get_AllowContextMenu( SHORT * ) = 0;
	/*00f8*/ virtual HRESULT put_AllowShowUI( SHORT ) = 0;
	/*0100*/ virtual HRESULT get_AllowShowUI( SHORT * ) = 0;
	/*0108*/ virtual HRESULT put_OptionKeyPath( WCHAR * ) = 0;
	/*0110*/ virtual HRESULT get_OptionKeyPath( WCHAR * * ) = 0;
	void IAxWinAmbientDispatch( IAxWinAmbientDispatch && );
	void IAxWinAmbientDispatch( IAxWinAmbientDispatch const & );
	void IAxWinAmbientDispatch();
	IAxWinAmbientDispatch & operator=( IAxWinAmbientDispatch && );
	IAxWinAmbientDispatch & operator=( IAxWinAmbientDispatch const & );
	/*0008*/
};

struct IAxWinAmbientDispatchEx : IAxWinAmbientDispatch {
	/*0118*/ virtual HRESULT SetAmbientDispatch( IDispatch * ) = 0;
	void IAxWinAmbientDispatchEx( IAxWinAmbientDispatchEx && );
	void IAxWinAmbientDispatchEx( IAxWinAmbientDispatchEx const & );
	void IAxWinAmbientDispatchEx();
	IAxWinAmbientDispatchEx & operator=( IAxWinAmbientDispatchEx && );
	IAxWinAmbientDispatchEx & operator=( IAxWinAmbientDispatchEx const & );
	/*0008*/
};

struct IAxWinHostWindow : IUnknown {
	/*0018*/ virtual HRESULT CreateControl( WCHAR const * , HWND__ * , IStream * ) = 0;
	/*0020*/ virtual HRESULT CreateControlEx( WCHAR const * , HWND__ * , IStream * , IUnknown * * , _GUID const & , IUnknown * ) = 0;
	/*0028*/ virtual HRESULT AttachControl( IUnknown * , HWND__ * ) = 0;
	/*0030*/ virtual HRESULT QueryControl( _GUID const & , void * * ) = 0;
	/*0038*/ virtual HRESULT SetExternalDispatch( IDispatch * ) = 0;
	/*0040*/ virtual HRESULT SetExternalUIHandler( IDocHostUIHandlerDispatch * ) = 0;
	void IAxWinHostWindow( IAxWinHostWindow && );
	void IAxWinHostWindow( IAxWinHostWindow const & );
	void IAxWinHostWindow();
	IAxWinHostWindow & operator=( IAxWinHostWindow && );
	IAxWinHostWindow & operator=( IAxWinHostWindow const & );
	/*0008*/
};

struct IAxWinHostWindowLic : IAxWinHostWindow {
	/*0048*/ virtual HRESULT CreateControlLic( WCHAR const * , HWND__ * , IStream * , WCHAR * ) = 0;
	/*0050*/ virtual HRESULT CreateControlLicEx( WCHAR const * , HWND__ * , IStream * , IUnknown * * , _GUID const & , IUnknown * , WCHAR * ) = 0;
	void IAxWinHostWindowLic( IAxWinHostWindowLic && );
	void IAxWinHostWindowLic( IAxWinHostWindowLic const & );
	void IAxWinHostWindowLic();
	IAxWinHostWindowLic & operator=( IAxWinHostWindowLic && );
	IAxWinHostWindowLic & operator=( IAxWinHostWindowLic const & );
	/*0008*/
};

struct IBackgroundEventDetailsFactory : IUnknown {
	/*0018*/ virtual HRESULT CreateEventDetailsInstance( ULONG , UCHAR * , IUnknown * , _GUID const & , void * * ) = 0;
	void IBackgroundEventDetailsFactory( IBackgroundEventDetailsFactory && );
	void IBackgroundEventDetailsFactory( IBackgroundEventDetailsFactory const & );
	void IBackgroundEventDetailsFactory();
	IBackgroundEventDetailsFactory & operator=( IBackgroundEventDetailsFactory && );
	IBackgroundEventDetailsFactory & operator=( IBackgroundEventDetailsFactory const & );
	/*0008*/
};

struct IBandSite : IUnknown {
	/*0018*/ virtual HRESULT AddBand( IUnknown * ) = 0;
	/*0020*/ virtual HRESULT EnumBands( UINT , ULONG * ) = 0;
	/*0028*/ virtual HRESULT QueryBand( ULONG , IDeskBand * * , ULONG * , WCHAR * , INT ) = 0;
	/*0030*/ virtual HRESULT SetBandState( ULONG , ULONG , ULONG ) = 0;
	/*0038*/ virtual HRESULT RemoveBand( ULONG ) = 0;
	/*0040*/ virtual HRESULT GetBandObject( ULONG , _GUID const & , void * * ) = 0;
	/*0048*/ virtual HRESULT SetBandSiteInfo( tagBANDSITEINFO const * ) = 0;
	/*0050*/ virtual HRESULT GetBandSiteInfo( tagBANDSITEINFO * ) = 0;
	void IBandSite( IBandSite && );
	void IBandSite( IBandSite const & );
	void IBandSite();
	IBandSite & operator=( IBandSite && );
	IBandSite & operator=( IBandSite const & );
	/*0008*/
};

struct IBandwidthEstimationPrivate : IUnknown {
	/*0018*/ virtual HRESULT Begin( ULONG , tagBANDWIDTH_PARAMS const * ) = 0;
	/*0020*/ virtual HRESULT Get( _GUID const * , _GUID const * , ULONG * , tagBANDWIDTH_DATA * * ) = 0;
	/*0028*/ virtual HRESULT End() = 0;
	void IBandwidthEstimationPrivate( IBandwidthEstimationPrivate && );
	void IBandwidthEstimationPrivate( IBandwidthEstimationPrivate const & );
	void IBandwidthEstimationPrivate();
	IBandwidthEstimationPrivate & operator=( IBandwidthEstimationPrivate && );
	IBandwidthEstimationPrivate & operator=( IBandwidthEstimationPrivate const & );
	/*0008*/
};

struct IBannerNotificationHandler : IUnknown {
	/*0018*/ virtual HRESULT OnBannerEvent( BANNER_NOTIFICATION const * ) = 0;
	void IBannerNotificationHandler( IBannerNotificationHandler && );
	void IBannerNotificationHandler( IBannerNotificationHandler const & );
	void IBannerNotificationHandler();
	IBannerNotificationHandler & operator=( IBannerNotificationHandler && );
	IBannerNotificationHandler & operator=( IBannerNotificationHandler const & );
	/*0008*/
};

struct IBindCallbackRedirect : IUnknown {
	/*0018*/ virtual HRESULT Redirect( WCHAR const * , SHORT * ) = 0;
	void IBindCallbackRedirect( IBindCallbackRedirect && );
	void IBindCallbackRedirect( IBindCallbackRedirect const & );
	void IBindCallbackRedirect();
	IBindCallbackRedirect & operator=( IBindCallbackRedirect && );
	IBindCallbackRedirect & operator=( IBindCallbackRedirect const & );
	/*0008*/
};

struct IBindCtx : IUnknown {
	/*0018*/ virtual HRESULT RegisterObjectBound( IUnknown * ) = 0;
	/*0020*/ virtual HRESULT RevokeObjectBound( IUnknown * ) = 0;
	/*0028*/ virtual HRESULT ReleaseBoundObjects() = 0;
	/*0030*/ virtual HRESULT SetBindOptions( tagBIND_OPTS * ) = 0;
	/*0038*/ virtual HRESULT GetBindOptions( tagBIND_OPTS * ) = 0;
	/*0040*/ virtual HRESULT GetRunningObjectTable( IRunningObjectTable * * ) = 0;
	/*0048*/ virtual HRESULT RegisterObjectParam( WCHAR * , IUnknown * ) = 0;
	/*0050*/ virtual HRESULT GetObjectParam( WCHAR * , IUnknown * * ) = 0;
	/*0058*/ virtual HRESULT EnumObjectParam( IEnumString * * ) = 0;
	/*0060*/ virtual HRESULT RevokeObjectParam( WCHAR * ) = 0;
	void IBindCtx( IBindCtx && );
	void IBindCtx( IBindCtx const & );
	void IBindCtx();
	IBindCtx & operator=( IBindCtx && );
	IBindCtx & operator=( IBindCtx const & );
	/*0008*/
};

struct IBindHost : IUnknown {
	/*0018*/ virtual HRESULT CreateMoniker( WCHAR * , IBindCtx * , IMoniker * * , ULONG ) = 0;
	/*0020*/ virtual HRESULT MonikerBindToStorage( IMoniker * , IBindCtx * , IBindStatusCallback * , _GUID const & , void * * ) = 0;
	/*0028*/ virtual HRESULT MonikerBindToObject( IMoniker * , IBindCtx * , IBindStatusCallback * , _GUID const & , void * * ) = 0;
	void IBindHost( IBindHost && );
	void IBindHost( IBindHost const & );
	void IBindHost();
	IBindHost & operator=( IBindHost && );
	IBindHost & operator=( IBindHost const & );
	/*0008*/
};

struct IBindHttpSecurity : IUnknown {
	/*0018*/ virtual HRESULT GetIgnoreCertMask( ULONG * ) = 0;
	void IBindHttpSecurity( IBindHttpSecurity && );
	void IBindHttpSecurity( IBindHttpSecurity const & );
	void IBindHttpSecurity();
	IBindHttpSecurity & operator=( IBindHttpSecurity && );
	IBindHttpSecurity & operator=( IBindHttpSecurity const & );
	/*0008*/
};

struct IBindProtocol : IUnknown {
	/*0018*/ virtual HRESULT CreateBinding( WCHAR const * , IBindCtx * , IBinding * * ) = 0;
	void IBindProtocol( IBindProtocol && );
	void IBindProtocol( IBindProtocol const & );
	void IBindProtocol();
	IBindProtocol & operator=( IBindProtocol && );
	IBindProtocol & operator=( IBindProtocol const & );
	/*0008*/
};

struct IBindStatusCallback : IUnknown {
	/*0018*/ virtual HRESULT OnStartBinding( ULONG , IBinding * ) = 0;
	/*0020*/ virtual HRESULT GetPriority( LONG * ) = 0;
	/*0028*/ virtual HRESULT OnLowResource( ULONG ) = 0;
	/*0030*/ virtual HRESULT OnProgress( ULONG , ULONG , ULONG , WCHAR const * ) = 0;
	/*0038*/ virtual HRESULT OnStopBinding( HRESULT , WCHAR const * ) = 0;
	/*0040*/ virtual HRESULT GetBindInfo( ULONG * , _tagBINDINFO * ) = 0;
	/*0048*/ virtual HRESULT OnDataAvailable( ULONG , ULONG , tagFORMATETC * , tagSTGMEDIUM * ) = 0;
	/*0050*/ virtual HRESULT OnObjectAvailable( _GUID const & , IUnknown * ) = 0;
	void IBindStatusCallback( IBindStatusCallback && );
	void IBindStatusCallback( IBindStatusCallback const & );
	void IBindStatusCallback();
	IBindStatusCallback & operator=( IBindStatusCallback && );
	IBindStatusCallback & operator=( IBindStatusCallback const & );
	/*0008*/
};

struct IBindStatusCallbackEx : IBindStatusCallback {
	/*0058*/ virtual HRESULT GetBindInfoEx( ULONG * , _tagBINDINFO * , ULONG * , ULONG * ) = 0;
	void IBindStatusCallbackEx( IBindStatusCallbackEx && );
	void IBindStatusCallbackEx( IBindStatusCallbackEx const & );
	void IBindStatusCallbackEx();
	IBindStatusCallbackEx & operator=( IBindStatusCallbackEx && );
	IBindStatusCallbackEx & operator=( IBindStatusCallbackEx const & );
	/*0008*/
};

struct IBinding : IUnknown {
	/*0018*/ virtual HRESULT Abort() = 0;
	/*0020*/ virtual HRESULT Suspend() = 0;
	/*0028*/ virtual HRESULT Resume() = 0;
	/*0030*/ virtual HRESULT SetPriority( LONG ) = 0;
	/*0038*/ virtual HRESULT GetPriority( LONG * ) = 0;
	/*0040*/ virtual HRESULT GetBindResult( _GUID * , ULONG * , WCHAR * * , ULONG * ) = 0;
	void IBinding( IBinding && );
	void IBinding( IBinding const & );
	void IBinding();
	IBinding & operator=( IBinding && );
	IBinding & operator=( IBinding const & );
	/*0008*/
};

struct IBlockingLock : IUnknown {
	/*0018*/ virtual HRESULT Lock( ULONG ) = 0;
	/*0020*/ virtual HRESULT Unlock() = 0;
	void IBlockingLock( IBlockingLock && );
	void IBlockingLock( IBlockingLock const & );
	void IBlockingLock();
	IBlockingLock & operator=( IBlockingLock && );
	IBlockingLock & operator=( IBlockingLock const & );
	/*0008*/
};

struct IBrowserFrameOptions : IUnknown {
	/*0018*/ virtual HRESULT GetFrameOptions( ULONG , ULONG * ) = 0;
	void IBrowserFrameOptions( IBrowserFrameOptions && );
	void IBrowserFrameOptions( IBrowserFrameOptions const & );
	void IBrowserFrameOptions();
	IBrowserFrameOptions & operator=( IBrowserFrameOptions && );
	IBrowserFrameOptions & operator=( IBrowserFrameOptions const & );
	/*0008*/
};

enum ICMP4_TYPE {
	ICMP4_ECHO_REPLY = 0x0,
	ICMP4_DST_UNREACH = 0x3,
	ICMP4_SOURCE_QUENCH = 0x4,
	ICMP4_REDIRECT = 0x5,
	ICMP4_ECHO_REQUEST = 0x8,
	ICMP4_ROUTER_ADVERT = 0x9,
	ICMP4_ROUTER_SOLICIT = 0xa,
	ICMP4_TIME_EXCEEDED = 0xb,
	ICMP4_PARAM_PROB = 0xc,
	ICMP4_TIMESTAMP_REQUEST = 0xd,
	ICMP4_TIMESTAMP_REPLY = 0xe,
	ICMP4_MASK_REQUEST = 0x11,
	ICMP4_MASK_REPLY = 0x12
};

enum ICMP6_TYPE {
	ICMP6_DST_UNREACH = 0x1,
	ICMP6_PACKET_TOO_BIG = 0x2,
	ICMP6_TIME_EXCEEDED = 0x3,
	ICMP6_PARAM_PROB = 0x4,
	ICMP6_ECHO_REQUEST = 0x80,
	ICMP6_ECHO_REPLY = 0x81,
	ICMP6_MEMBERSHIP_QUERY = 0x82,
	ICMP6_MEMBERSHIP_REPORT = 0x83,
	ICMP6_MEMBERSHIP_REDUCTION = 0x84,
	ND_ROUTER_SOLICIT = 0x85,
	ND_ROUTER_ADVERT = 0x86,
	ND_NEIGHBOR_SOLICIT = 0x87,
	ND_NEIGHBOR_ADVERT = 0x88,
	ND_REDIRECT = 0x89,
	ICMP6_V2_MEMBERSHIP_REPORT = 0x8f
};

struct ICallFactory : IUnknown {
	/*0018*/ virtual HRESULT CreateCall( _GUID const & , IUnknown * , _GUID const & , IUnknown * * ) = 0;
	void ICallFactory( ICallFactory && );
	void ICallFactory( ICallFactory const & );
	void ICallFactory();
	ICallFactory & operator=( ICallFactory && );
	ICallFactory & operator=( ICallFactory const & );
	/*0008*/
};

struct ICallingProcessInfo : IUnknown {
	/*0018*/ virtual HRESULT OpenCallerProcessHandle( ULONG , void * * ) = 0;
	void ICallingProcessInfo( ICallingProcessInfo && );
	void ICallingProcessInfo( ICallingProcessInfo const & );
	void ICallingProcessInfo();
	ICallingProcessInfo & operator=( ICallingProcessInfo && );
	ICallingProcessInfo & operator=( ICallingProcessInfo const & );
	/*0008*/
};

struct ICancelMethodCalls : IUnknown {
	/*0018*/ virtual HRESULT Cancel( ULONG ) = 0;
	/*0020*/ virtual HRESULT TestCancel() = 0;
	void ICancelMethodCalls( ICancelMethodCalls && );
	void ICancelMethodCalls( ICancelMethodCalls const & );
	void ICancelMethodCalls();
	ICancelMethodCalls & operator=( ICancelMethodCalls && );
	ICancelMethodCalls & operator=( ICancelMethodCalls const & );
	/*0008*/
};

struct ICatInformation : IUnknown {
	/*0018*/ virtual HRESULT EnumCategories( ULONG , IEnumCATEGORYINFO * * ) = 0;
	/*0020*/ virtual HRESULT GetCategoryDesc( _GUID const & , ULONG , WCHAR * * ) = 0;
	/*0028*/ virtual HRESULT EnumClassesOfCategories( ULONG , _GUID const * , ULONG , _GUID const * , IEnumGUID * * ) = 0;
	/*0030*/ virtual HRESULT IsClassOfCategories( _GUID const & , ULONG , _GUID const * , ULONG , _GUID const * ) = 0;
	/*0038*/ virtual HRESULT EnumImplCategoriesOfClass( _GUID const & , IEnumGUID * * ) = 0;
	/*0040*/ virtual HRESULT EnumReqCategoriesOfClass( _GUID const & , IEnumGUID * * ) = 0;
	void ICatInformation( ICatInformation && );
	void ICatInformation( ICatInformation const & );
	void ICatInformation();
	ICatInformation & operator=( ICatInformation && );
	ICatInformation & operator=( ICatInformation const & );
	/*0008*/
};

struct ICatRegister : IUnknown {
	/*0018*/ virtual HRESULT RegisterCategories( ULONG , tagCATEGORYINFO * ) = 0;
	/*0020*/ virtual HRESULT UnRegisterCategories( ULONG , _GUID * ) = 0;
	/*0028*/ virtual HRESULT RegisterClassImplCategories( _GUID const & , ULONG , _GUID * ) = 0;
	/*0030*/ virtual HRESULT UnRegisterClassImplCategories( _GUID const & , ULONG , _GUID * ) = 0;
	/*0038*/ virtual HRESULT RegisterClassReqCategories( _GUID const & , ULONG , _GUID * ) = 0;
	/*0040*/ virtual HRESULT UnRegisterClassReqCategories( _GUID const & , ULONG , _GUID * ) = 0;
	void ICatRegister( ICatRegister && );
	void ICatRegister( ICatRegister const & );
	void ICatRegister();
	ICatRegister & operator=( ICatRegister && );
	ICatRegister & operator=( ICatRegister const & );
	/*0008*/
};

struct ICatalogFileInfo : IUnknown {
	/*0018*/ virtual HRESULT GetCatalogFile( CHAR * * ) = 0;
	/*0020*/ virtual HRESULT GetJavaTrust( void * * ) = 0;
	void ICatalogFileInfo( ICatalogFileInfo && );
	void ICatalogFileInfo( ICatalogFileInfo const & );
	void ICatalogFileInfo();
	ICatalogFileInfo & operator=( ICatalogFileInfo && );
	ICatalogFileInfo & operator=( ICatalogFileInfo const & );
	/*0008*/
};

struct ICategorizer : IUnknown {
	/*0018*/ virtual HRESULT GetDescription( WCHAR * , UINT ) = 0;
	/*0020*/ virtual HRESULT GetCategory( UINT , _ITEMIDLIST const __unaligned * * , ULONG * ) = 0;
	/*0028*/ virtual HRESULT GetCategoryInfo( ULONG , CATEGORY_INFO * ) = 0;
	/*0030*/ virtual HRESULT CompareCategory( CATSORT_FLAGS , ULONG , ULONG ) = 0;
	void ICategorizer( ICategorizer && );
	void ICategorizer( ICategorizer const & );
	void ICategorizer();
	ICategorizer & operator=( ICategorizer && );
	ICategorizer & operator=( ICategorizer const & );
	/*0008*/
};

struct ICategoryProvider : IUnknown {
	/*0018*/ virtual HRESULT CanCategorizeOnSCID( _tagpropertykey const * ) = 0;
	/*0020*/ virtual HRESULT GetDefaultCategory( _GUID * , _tagpropertykey * ) = 0;
	/*0028*/ virtual HRESULT GetCategoryForSCID( _tagpropertykey const * , _GUID * ) = 0;
	/*0030*/ virtual HRESULT EnumCategories( IEnumGUID * * ) = 0;
	/*0038*/ virtual HRESULT GetCategoryName( _GUID const * , WCHAR * , UINT ) = 0;
	/*0040*/ virtual HRESULT CreateCategory( _GUID const * , _GUID const & , void * * ) = 0;
	void ICategoryProvider( ICategoryProvider && );
	void ICategoryProvider( ICategoryProvider const & );
	void ICategoryProvider();
	ICategoryProvider & operator=( ICategoryProvider && );
	ICategoryProvider & operator=( ICategoryProvider const & );
	/*0008*/
};

struct IChannelHook : IUnknown {
	/*0018*/ virtual void ClientGetSize( _GUID const & , _GUID const & , ULONG * ) = 0;
	/*0020*/ virtual void ClientFillBuffer( _GUID const & , _GUID const & , ULONG * , void * ) = 0;
	/*0028*/ virtual void ClientNotify( _GUID const & , _GUID const & , ULONG , void * , ULONG , HRESULT ) = 0;
	/*0030*/ virtual void ServerNotify( _GUID const & , _GUID const & , ULONG , void * , ULONG ) = 0;
	/*0038*/ virtual void ServerGetSize( _GUID const & , _GUID const & , HRESULT , ULONG * ) = 0;
	/*0040*/ virtual void ServerFillBuffer( _GUID const & , _GUID const & , ULONG * , void * , HRESULT ) = 0;
	void IChannelHook( IChannelHook && );
	void IChannelHook( IChannelHook const & );
	void IChannelHook();
	IChannelHook & operator=( IChannelHook && );
	IChannelHook & operator=( IChannelHook const & );
	/*0008*/
};

struct IClassActivator : IUnknown {
	/*0018*/ virtual HRESULT GetClassObject( _GUID const & , ULONG , ULONG , _GUID const & , void * * ) = 0;
	void IClassActivator( IClassActivator && );
	void IClassActivator( IClassActivator const & );
	void IClassActivator();
	IClassActivator & operator=( IClassActivator && );
	IClassActivator & operator=( IClassActivator const & );
	/*0008*/
};

struct IClassFactory : IUnknown {
	/*0018*/ virtual HRESULT CreateInstance( IUnknown * , _GUID const & , void * * ) = 0;
	/*0020*/ virtual HRESULT LockServer( INT ) = 0;
	void IClassFactory( IClassFactory && );
	void IClassFactory( IClassFactory const & );
	void IClassFactory();
	IClassFactory & operator=( IClassFactory && );
	IClassFactory & operator=( IClassFactory const & );
	/*0008*/
};

struct IClassFactory2 : IClassFactory {
	/*0028*/ virtual HRESULT GetLicInfo( tagLICINFO * ) = 0;
	/*0030*/ virtual HRESULT RequestLicKey( ULONG , WCHAR * * ) = 0;
	/*0038*/ virtual HRESULT CreateInstanceLic( IUnknown * , IUnknown * , _GUID const & , WCHAR * , void * * ) = 0;
	void IClassFactory2( IClassFactory2 && );
	void IClassFactory2( IClassFactory2 const & );
	void IClassFactory2();
	IClassFactory2 & operator=( IClassFactory2 && );
	IClassFactory2 & operator=( IClassFactory2 const & );
	/*0008*/
};

struct IClientSecurity : IUnknown {
	/*0018*/ virtual HRESULT QueryBlanket( IUnknown * , ULONG * , ULONG * , WCHAR * * , ULONG * , ULONG * , void * * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT SetBlanket( IUnknown * , ULONG , ULONG , WCHAR * , ULONG , ULONG , void * , ULONG ) = 0;
	/*0028*/ virtual HRESULT CopyProxy( IUnknown * , IUnknown * * ) = 0;
	void IClientSecurity( IClientSecurity && );
	void IClientSecurity( IClientSecurity const & );
	void IClientSecurity();
	IClientSecurity & operator=( IClientSecurity && );
	IClientSecurity & operator=( IClientSecurity const & );
	/*0008*/
};

struct ICodeInstall : IWindowForBindingUI {
	/*0020*/ virtual HRESULT OnCodeInstallProblem( ULONG , WCHAR const * , WCHAR const * , ULONG ) = 0;
	void ICodeInstall( ICodeInstall && );
	void ICodeInstall( ICodeInstall const & );
	void ICodeInstall();
	ICodeInstall & operator=( ICodeInstall && );
	ICodeInstall & operator=( ICodeInstall const & );
	/*0008*/
};

struct IColumnManager : IUnknown {
	/*0018*/ virtual HRESULT SetColumnInfo( _tagpropertykey const & , CM_COLUMNINFO const * ) = 0;
	/*0020*/ virtual HRESULT GetColumnInfo( _tagpropertykey const & , CM_COLUMNINFO * ) = 0;
	/*0028*/ virtual HRESULT GetColumnCount( CM_ENUM_FLAGS , UINT * ) = 0;
	/*0030*/ virtual HRESULT GetColumns( CM_ENUM_FLAGS , _tagpropertykey * , UINT ) = 0;
	/*0038*/ virtual HRESULT SetColumns( _tagpropertykey const * , UINT ) = 0;
	void IColumnManager( IColumnManager && );
	void IColumnManager( IColumnManager const & );
	void IColumnManager();
	IColumnManager & operator=( IColumnManager && );
	IColumnManager & operator=( IColumnManager const & );
	/*0008*/
};

struct IComThreadingInfo : IUnknown {
	/*0018*/ virtual HRESULT GetCurrentApartmentType( _APTTYPE * ) = 0;
	/*0020*/ virtual HRESULT GetCurrentThreadType( _THDTYPE * ) = 0;
	/*0028*/ virtual HRESULT GetCurrentLogicalThreadId( _GUID * ) = 0;
	/*0030*/ virtual HRESULT SetCurrentLogicalThreadId( _GUID const & ) = 0;
	void IComThreadingInfo( IComThreadingInfo && );
	void IComThreadingInfo( IComThreadingInfo const & );
	void IComThreadingInfo();
	IComThreadingInfo & operator=( IComThreadingInfo && );
	IComThreadingInfo & operator=( IComThreadingInfo const & );
	/*0008*/
};

struct ICommDlgBrowser : IUnknown {
	/*0018*/ virtual HRESULT OnDefaultCommand( IShellView * ) = 0;
	/*0020*/ virtual HRESULT OnStateChange( IShellView * , ULONG ) = 0;
	/*0028*/ virtual HRESULT IncludeObject( IShellView * , _ITEMIDLIST const __unaligned * ) = 0;
	void ICommDlgBrowser( ICommDlgBrowser && );
	void ICommDlgBrowser( ICommDlgBrowser const & );
	void ICommDlgBrowser();
	ICommDlgBrowser & operator=( ICommDlgBrowser && );
	ICommDlgBrowser & operator=( ICommDlgBrowser const & );
	/*0008*/
};

struct ICommDlgBrowser2 : ICommDlgBrowser {
	/*0030*/ virtual HRESULT Notify( IShellView * , ULONG ) = 0;
	/*0038*/ virtual HRESULT GetDefaultMenuText( IShellView * , WCHAR * , INT ) = 0;
	/*0040*/ virtual HRESULT GetViewFlags( ULONG * ) = 0;
	void ICommDlgBrowser2( ICommDlgBrowser2 && );
	void ICommDlgBrowser2( ICommDlgBrowser2 const & );
	void ICommDlgBrowser2();
	ICommDlgBrowser2 & operator=( ICommDlgBrowser2 && );
	ICommDlgBrowser2 & operator=( ICommDlgBrowser2 const & );
	/*0008*/
};

struct ICondition : IPersistStream {
	/*0040*/ virtual HRESULT GetConditionType( tagCONDITION_TYPE * ) = 0;
	/*0048*/ virtual HRESULT GetSubConditions( _GUID const & , void * * ) = 0;
	/*0050*/ virtual HRESULT GetComparisonInfo( WCHAR * * , tagCONDITION_OPERATION * , tagPROPVARIANT * ) = 0;
	/*0058*/ virtual HRESULT GetValueType( WCHAR * * ) = 0;
	/*0060*/ virtual HRESULT GetValueNormalization( WCHAR * * ) = 0;
	/*0068*/ virtual HRESULT GetInputTerms( IRichChunk * * , IRichChunk * * , IRichChunk * * ) = 0;
	/*0070*/ virtual HRESULT Clone( ICondition * * ) = 0;
	void ICondition( ICondition && );
	void ICondition( ICondition const & );
	void ICondition();
	ICondition & operator=( ICondition && );
	ICondition & operator=( ICondition const & );
	/*0008*/
};

struct ICondition2 : ICondition {
	/*0078*/ virtual HRESULT GetLocale( WCHAR * * ) = 0;
	/*0080*/ virtual HRESULT GetLeafConditionInfo( _tagpropertykey * , tagCONDITION_OPERATION * , tagPROPVARIANT * ) = 0;
	void ICondition2( ICondition2 && );
	void ICondition2( ICondition2 const & );
	void ICondition2();
	ICondition2 & operator=( ICondition2 && );
	ICondition2 & operator=( ICondition2 const & );
	/*0008*/
};

struct IConnectableCredentialProviderCredential : ICredentialProviderCredential {
	/*00a0*/ virtual HRESULT Connect( IQueryContinueWithStatus * ) = 0;
	/*00a8*/ virtual HRESULT Disconnect() = 0;
	void IConnectableCredentialProviderCredential( IConnectableCredentialProviderCredential && );
	void IConnectableCredentialProviderCredential( IConnectableCredentialProviderCredential const & );
	void IConnectableCredentialProviderCredential();
	IConnectableCredentialProviderCredential & operator=( IConnectableCredentialProviderCredential && );
	IConnectableCredentialProviderCredential & operator=( IConnectableCredentialProviderCredential const & );
	/*0008*/
};

struct IConnectionPoint : IUnknown {
	/*0018*/ virtual HRESULT GetConnectionInterface( _GUID * ) = 0;
	/*0020*/ virtual HRESULT GetConnectionPointContainer( IConnectionPointContainer * * ) = 0;
	/*0028*/ virtual HRESULT Advise( IUnknown * , ULONG * ) = 0;
	/*0030*/ virtual HRESULT Unadvise( ULONG ) = 0;
	/*0038*/ virtual HRESULT EnumConnections( IEnumConnections * * ) = 0;
	void IConnectionPoint( IConnectionPoint && );
	void IConnectionPoint( IConnectionPoint const & );
	void IConnectionPoint();
	IConnectionPoint & operator=( IConnectionPoint && );
	IConnectionPoint & operator=( IConnectionPoint const & );
	/*0008*/
};

struct IConnectionPointContainer : IUnknown {
	/*0018*/ virtual HRESULT EnumConnectionPoints( IEnumConnectionPoints * * ) = 0;
	/*0020*/ virtual HRESULT FindConnectionPoint( _GUID const & , IConnectionPoint * * ) = 0;
	void IConnectionPointContainer( IConnectionPointContainer && );
	void IConnectionPointContainer( IConnectionPointContainer const & );
	void IConnectionPointContainer();
	IConnectionPointContainer & operator=( IConnectionPointContainer && );
	IConnectionPointContainer & operator=( IConnectionPointContainer const & );
	/*0008*/
};

struct IContactManagerInterop : IUnknown {
	/*0018*/ virtual HRESULT ShowContactCardForWindow( HWND__ * , IUnknown * , tagRECT const * , FLYOUT_PLACEMENT ) = 0;
	void IContactManagerInterop( IContactManagerInterop && );
	void IContactManagerInterop( IContactManagerInterop const & );
	void IContactManagerInterop();
	IContactManagerInterop & operator=( IContactManagerInterop && );
	IContactManagerInterop & operator=( IContactManagerInterop const & );
	/*0008*/
};

struct IContextMenu : IUnknown {
	/*0018*/ virtual HRESULT QueryContextMenu( HMENU__ * , UINT , UINT , UINT , UINT ) = 0;
	/*0020*/ virtual HRESULT InvokeCommand( _CMINVOKECOMMANDINFO * ) = 0;
	/*0028*/ virtual HRESULT GetCommandString( ULONGLONG , UINT , UINT * , CHAR * , UINT ) = 0;
	void IContextMenu( IContextMenu && );
	void IContextMenu( IContextMenu const & );
	void IContextMenu();
	IContextMenu & operator=( IContextMenu && );
	IContextMenu & operator=( IContextMenu const & );
	/*0008*/
};

struct IContextMenu2 : IContextMenu {
	/*0030*/ virtual HRESULT HandleMenuMsg( UINT , ULONGLONG , LONGLONG ) = 0;
	void IContextMenu2( IContextMenu2 && );
	void IContextMenu2( IContextMenu2 const & );
	void IContextMenu2();
	IContextMenu2 & operator=( IContextMenu2 && );
	IContextMenu2 & operator=( IContextMenu2 const & );
	/*0008*/
};

struct IContextMenu3 : IContextMenu2 {
	/*0038*/ virtual HRESULT HandleMenuMsg2( UINT , ULONGLONG , LONGLONG , LONGLONG * ) = 0;
	void IContextMenu3( IContextMenu3 && );
	void IContextMenu3( IContextMenu3 const & );
	void IContextMenu3();
	IContextMenu3 & operator=( IContextMenu3 && );
	IContextMenu3 & operator=( IContextMenu3 const & );
	/*0008*/
};

struct IContextMenuCB : IUnknown {
	/*0018*/ virtual HRESULT CallBack( IShellFolder * , HWND__ * , IDataObject * , UINT , ULONGLONG , LONGLONG ) = 0;
	void IContextMenuCB( IContextMenuCB && );
	void IContextMenuCB( IContextMenuCB const & );
	void IContextMenuCB();
	IContextMenuCB & operator=( IContextMenuCB && );
	IContextMenuCB & operator=( IContextMenuCB const & );
	/*0008*/
};

struct IContextMenuSite : IUnknown {
	/*0018*/ virtual HRESULT DoContextMenuPopup( IUnknown * , UINT , tagPOINT ) = 0;
	void IContextMenuSite( IContextMenuSite && );
	void IContextMenuSite( IContextMenuSite const & );
	void IContextMenuSite();
	IContextMenuSite & operator=( IContextMenuSite && );
	IContextMenuSite & operator=( IContextMenuSite const & );
	/*0008*/
};

struct IContinue : IUnknown {
	/*0018*/ virtual HRESULT FContinue() = 0;
	void IContinue( IContinue && );
	void IContinue( IContinue const & );
	void IContinue();
	IContinue & operator=( IContinue && );
	IContinue & operator=( IContinue const & );
	/*0008*/
};

struct ICreateErrorInfo : IUnknown {
	/*0018*/ virtual HRESULT SetGUID( _GUID const & ) = 0;
	/*0020*/ virtual HRESULT SetSource( WCHAR * ) = 0;
	/*0028*/ virtual HRESULT SetDescription( WCHAR * ) = 0;
	/*0030*/ virtual HRESULT SetHelpFile( WCHAR * ) = 0;
	/*0038*/ virtual HRESULT SetHelpContext( ULONG ) = 0;
	void ICreateErrorInfo( ICreateErrorInfo && );
	void ICreateErrorInfo( ICreateErrorInfo const & );
	void ICreateErrorInfo();
	ICreateErrorInfo & operator=( ICreateErrorInfo && );
	ICreateErrorInfo & operator=( ICreateErrorInfo const & );
	/*0008*/
};

struct ICreateObject : IUnknown {
	/*0018*/ virtual HRESULT CreateObject( _GUID const & , IUnknown * , _GUID const & , void * * ) = 0;
	void ICreateObject( ICreateObject && );
	void ICreateObject( ICreateObject const & );
	void ICreateObject();
	ICreateObject & operator=( ICreateObject && );
	ICreateObject & operator=( ICreateObject const & );
	/*0008*/
};

struct ICreateProcessInputs : IUnknown {
	/*0018*/ virtual HRESULT GetCreateFlags( ULONG * ) = 0;
	/*0020*/ virtual HRESULT SetCreateFlags( ULONG ) = 0;
	/*0028*/ virtual HRESULT AddCreateFlags( ULONG ) = 0;
	/*0030*/ virtual HRESULT SetHotKey( USHORT ) = 0;
	/*0038*/ virtual HRESULT AddStartupFlags( ULONG ) = 0;
	/*0040*/ virtual HRESULT SetTitle( WCHAR const * ) = 0;
	/*0048*/ virtual HRESULT SetEnvironmentVariableW( WCHAR const * , WCHAR const * ) = 0;
	void ICreateProcessInputs( ICreateProcessInputs && );
	void ICreateProcessInputs( ICreateProcessInputs const & );
	void ICreateProcessInputs();
	ICreateProcessInputs & operator=( ICreateProcessInputs && );
	ICreateProcessInputs & operator=( ICreateProcessInputs const & );
	/*0008*/
};

struct ICreateTypeInfo : IUnknown {
	/*0018*/ virtual HRESULT SetGuid( _GUID const & ) = 0;
	/*0020*/ virtual HRESULT SetTypeFlags( UINT ) = 0;
	/*0028*/ virtual HRESULT SetDocString( WCHAR * ) = 0;
	/*0030*/ virtual HRESULT SetHelpContext( ULONG ) = 0;
	/*0038*/ virtual HRESULT SetVersion( USHORT , USHORT ) = 0;
	/*0040*/ virtual HRESULT AddRefTypeInfo( ITypeInfo * , ULONG * ) = 0;
	/*0048*/ virtual HRESULT AddFuncDesc( UINT , tagFUNCDESC * ) = 0;
	/*0050*/ virtual HRESULT AddImplType( UINT , ULONG ) = 0;
	/*0058*/ virtual HRESULT SetImplTypeFlags( UINT , INT ) = 0;
	/*0060*/ virtual HRESULT SetAlignment( USHORT ) = 0;
	/*0068*/ virtual HRESULT SetSchema( WCHAR * ) = 0;
	/*0070*/ virtual HRESULT AddVarDesc( UINT , tagVARDESC * ) = 0;
	/*0078*/ virtual HRESULT SetFuncAndParamNames( UINT , WCHAR * * , UINT ) = 0;
	/*0080*/ virtual HRESULT SetVarName( UINT , WCHAR * ) = 0;
	/*0088*/ virtual HRESULT SetTypeDescAlias( tagTYPEDESC * ) = 0;
	/*0090*/ virtual HRESULT DefineFuncAsDllEntry( UINT , WCHAR * , WCHAR * ) = 0;
	/*0098*/ virtual HRESULT SetFuncDocString( UINT , WCHAR * ) = 0;
	/*00a0*/ virtual HRESULT SetVarDocString( UINT , WCHAR * ) = 0;
	/*00a8*/ virtual HRESULT SetFuncHelpContext( UINT , ULONG ) = 0;
	/*00b0*/ virtual HRESULT SetVarHelpContext( UINT , ULONG ) = 0;
	/*00b8*/ virtual HRESULT SetMops( UINT , WCHAR * ) = 0;
	/*00c0*/ virtual HRESULT SetTypeIdldesc( tagIDLDESC * ) = 0;
	/*00c8*/ virtual HRESULT LayOut() = 0;
	void ICreateTypeInfo( ICreateTypeInfo && );
	void ICreateTypeInfo( ICreateTypeInfo const & );
	void ICreateTypeInfo();
	ICreateTypeInfo & operator=( ICreateTypeInfo && );
	ICreateTypeInfo & operator=( ICreateTypeInfo const & );
	/*0008*/
};

struct ICreateTypeInfo2 : ICreateTypeInfo {
	/*00d0*/ virtual HRESULT DeleteFuncDesc( UINT ) = 0;
	/*00d8*/ virtual HRESULT DeleteFuncDescByMemId( LONG , tagINVOKEKIND ) = 0;
	/*00e0*/ virtual HRESULT DeleteVarDesc( UINT ) = 0;
	/*00e8*/ virtual HRESULT DeleteVarDescByMemId( LONG ) = 0;
	/*00f0*/ virtual HRESULT DeleteImplType( UINT ) = 0;
	/*00f8*/ virtual HRESULT SetCustData( _GUID const & , tagVARIANT * ) = 0;
	/*0100*/ virtual HRESULT SetFuncCustData( UINT , _GUID const & , tagVARIANT * ) = 0;
	/*0108*/ virtual HRESULT SetParamCustData( UINT , UINT , _GUID const & , tagVARIANT * ) = 0;
	/*0110*/ virtual HRESULT SetVarCustData( UINT , _GUID const & , tagVARIANT * ) = 0;
	/*0118*/ virtual HRESULT SetImplTypeCustData( UINT , _GUID const & , tagVARIANT * ) = 0;
	/*0120*/ virtual HRESULT SetHelpStringContext( ULONG ) = 0;
	/*0128*/ virtual HRESULT SetFuncHelpStringContext( UINT , ULONG ) = 0;
	/*0130*/ virtual HRESULT SetVarHelpStringContext( UINT , ULONG ) = 0;
	/*0138*/ virtual HRESULT Invalidate() = 0;
	/*0140*/ virtual HRESULT SetName( WCHAR * ) = 0;
	void ICreateTypeInfo2( ICreateTypeInfo2 && );
	void ICreateTypeInfo2( ICreateTypeInfo2 const & );
	void ICreateTypeInfo2();
	ICreateTypeInfo2 & operator=( ICreateTypeInfo2 && );
	ICreateTypeInfo2 & operator=( ICreateTypeInfo2 const & );
	/*0008*/
};

struct ICreateTypeLib : IUnknown {
	/*0018*/ virtual HRESULT CreateTypeInfo( WCHAR * , tagTYPEKIND , ICreateTypeInfo * * ) = 0;
	/*0020*/ virtual HRESULT SetName( WCHAR * ) = 0;
	/*0028*/ virtual HRESULT SetVersion( USHORT , USHORT ) = 0;
	/*0030*/ virtual HRESULT SetGuid( _GUID const & ) = 0;
	/*0038*/ virtual HRESULT SetDocString( WCHAR * ) = 0;
	/*0040*/ virtual HRESULT SetHelpFileName( WCHAR * ) = 0;
	/*0048*/ virtual HRESULT SetHelpContext( ULONG ) = 0;
	/*0050*/ virtual HRESULT SetLcid( ULONG ) = 0;
	/*0058*/ virtual HRESULT SetLibFlags( UINT ) = 0;
	/*0060*/ virtual HRESULT SaveAllChanges() = 0;
	void ICreateTypeLib( ICreateTypeLib && );
	void ICreateTypeLib( ICreateTypeLib const & );
	void ICreateTypeLib();
	ICreateTypeLib & operator=( ICreateTypeLib && );
	ICreateTypeLib & operator=( ICreateTypeLib const & );
	/*0008*/
};

struct ICreateTypeLib2 : ICreateTypeLib {
	/*0068*/ virtual HRESULT DeleteTypeInfo( WCHAR * ) = 0;
	/*0070*/ virtual HRESULT SetCustData( _GUID const & , tagVARIANT * ) = 0;
	/*0078*/ virtual HRESULT SetHelpStringContext( ULONG ) = 0;
	/*0080*/ virtual HRESULT SetHelpStringDll( WCHAR * ) = 0;
	void ICreateTypeLib2( ICreateTypeLib2 && );
	void ICreateTypeLib2( ICreateTypeLib2 const & );
	void ICreateTypeLib2();
	ICreateTypeLib2 & operator=( ICreateTypeLib2 && );
	ICreateTypeLib2 & operator=( ICreateTypeLib2 const & );
	/*0008*/
};

struct ICreatingProcess : IUnknown {
	/*0018*/ virtual HRESULT OnCreating( ICreateProcessInputs * ) = 0;
	void ICreatingProcess( ICreatingProcess && );
	void ICreatingProcess( ICreatingProcess const & );
	void ICreatingProcess();
	ICreatingProcess & operator=( ICreatingProcess && );
	ICreatingProcess & operator=( ICreatingProcess const & );
	/*0008*/
};

struct ICredentialProvider : IUnknown {
	/*0018*/ virtual HRESULT SetUsageScenario( _CREDENTIAL_PROVIDER_USAGE_SCENARIO , ULONG ) = 0;
	/*0020*/ virtual HRESULT SetSerialization( _CREDENTIAL_PROVIDER_CREDENTIAL_SERIALIZATION const * ) = 0;
	/*0028*/ virtual HRESULT Advise( ICredentialProviderEvents * , ULONGLONG ) = 0;
	/*0030*/ virtual HRESULT UnAdvise() = 0;
	/*0038*/ virtual HRESULT GetFieldDescriptorCount( ULONG * ) = 0;
	/*0040*/ virtual HRESULT GetFieldDescriptorAt( ULONG , _CREDENTIAL_PROVIDER_FIELD_DESCRIPTOR * * ) = 0;
	/*0048*/ virtual HRESULT GetCredentialCount( ULONG * , ULONG * , INT * ) = 0;
	/*0050*/ virtual HRESULT GetCredentialAt( ULONG , ICredentialProviderCredential * * ) = 0;
	void ICredentialProvider( ICredentialProvider && );
	void ICredentialProvider( ICredentialProvider const & );
	void ICredentialProvider();
	ICredentialProvider & operator=( ICredentialProvider && );
	ICredentialProvider & operator=( ICredentialProvider const & );
	/*0008*/
};

struct ICredentialProviderCredential : IUnknown {
	/*0018*/ virtual HRESULT Advise( ICredentialProviderCredentialEvents * ) = 0;
	/*0020*/ virtual HRESULT UnAdvise() = 0;
	/*0028*/ virtual HRESULT SetSelected( INT * ) = 0;
	/*0030*/ virtual HRESULT SetDeselected() = 0;
	/*0038*/ virtual HRESULT GetFieldState( ULONG , _CREDENTIAL_PROVIDER_FIELD_STATE * , _CREDENTIAL_PROVIDER_FIELD_INTERACTIVE_STATE * ) = 0;
	/*0040*/ virtual HRESULT GetStringValue( ULONG , WCHAR * * ) = 0;
	/*0048*/ virtual HRESULT GetBitmapValue( ULONG , HBITMAP__ * * ) = 0;
	/*0050*/ virtual HRESULT GetCheckboxValue( ULONG , INT * , WCHAR * * ) = 0;
	/*0058*/ virtual HRESULT GetSubmitButtonValue( ULONG , ULONG * ) = 0;
	/*0060*/ virtual HRESULT GetComboBoxValueCount( ULONG , ULONG * , ULONG * ) = 0;
	/*0068*/ virtual HRESULT GetComboBoxValueAt( ULONG , ULONG , WCHAR * * ) = 0;
	/*0070*/ virtual HRESULT SetStringValue( ULONG , WCHAR const * ) = 0;
	/*0078*/ virtual HRESULT SetCheckboxValue( ULONG , INT ) = 0;
	/*0080*/ virtual HRESULT SetComboBoxSelectedValue( ULONG , ULONG ) = 0;
	/*0088*/ virtual HRESULT CommandLinkClicked( ULONG ) = 0;
	/*0090*/ virtual HRESULT GetSerialization( _CREDENTIAL_PROVIDER_GET_SERIALIZATION_RESPONSE * , _CREDENTIAL_PROVIDER_CREDENTIAL_SERIALIZATION * , WCHAR * * , _CREDENTIAL_PROVIDER_STATUS_ICON * ) = 0;
	/*0098*/ virtual HRESULT ReportResult( LONG , LONG , WCHAR * * , _CREDENTIAL_PROVIDER_STATUS_ICON * ) = 0;
	void ICredentialProviderCredential( ICredentialProviderCredential && );
	void ICredentialProviderCredential( ICredentialProviderCredential const & );
	void ICredentialProviderCredential();
	ICredentialProviderCredential & operator=( ICredentialProviderCredential && );
	ICredentialProviderCredential & operator=( ICredentialProviderCredential const & );
	/*0008*/
};

struct ICredentialProviderCredential2 : ICredentialProviderCredential {
	/*00a0*/ virtual HRESULT GetUserSid( WCHAR * * ) = 0;
	void ICredentialProviderCredential2( ICredentialProviderCredential2 && );
	void ICredentialProviderCredential2( ICredentialProviderCredential2 const & );
	void ICredentialProviderCredential2();
	ICredentialProviderCredential2 & operator=( ICredentialProviderCredential2 && );
	ICredentialProviderCredential2 & operator=( ICredentialProviderCredential2 const & );
	/*0008*/
};

struct ICredentialProviderCredentialEvents : IUnknown {
	/*0018*/ virtual HRESULT SetFieldState( ICredentialProviderCredential * , ULONG , _CREDENTIAL_PROVIDER_FIELD_STATE ) = 0;
	/*0020*/ virtual HRESULT SetFieldInteractiveState( ICredentialProviderCredential * , ULONG , _CREDENTIAL_PROVIDER_FIELD_INTERACTIVE_STATE ) = 0;
	/*0028*/ virtual HRESULT SetFieldString( ICredentialProviderCredential * , ULONG , WCHAR const * ) = 0;
	/*0030*/ virtual HRESULT SetFieldCheckbox( ICredentialProviderCredential * , ULONG , INT , WCHAR const * ) = 0;
	/*0038*/ virtual HRESULT SetFieldBitmap( ICredentialProviderCredential * , ULONG , HBITMAP__ * ) = 0;
	/*0040*/ virtual HRESULT SetFieldComboBoxSelectedItem( ICredentialProviderCredential * , ULONG , ULONG ) = 0;
	/*0048*/ virtual HRESULT DeleteFieldComboBoxItem( ICredentialProviderCredential * , ULONG , ULONG ) = 0;
	/*0050*/ virtual HRESULT AppendFieldComboBoxItem( ICredentialProviderCredential * , ULONG , WCHAR const * ) = 0;
	/*0058*/ virtual HRESULT SetFieldSubmitButton( ICredentialProviderCredential * , ULONG , ULONG ) = 0;
	/*0060*/ virtual HRESULT OnCreatingWindow( HWND__ * * ) = 0;
	void ICredentialProviderCredentialEvents( ICredentialProviderCredentialEvents && );
	void ICredentialProviderCredentialEvents( ICredentialProviderCredentialEvents const & );
	void ICredentialProviderCredentialEvents();
	ICredentialProviderCredentialEvents & operator=( ICredentialProviderCredentialEvents && );
	ICredentialProviderCredentialEvents & operator=( ICredentialProviderCredentialEvents const & );
	/*0008*/
};

struct ICredentialProviderCredentialEvents2 : ICredentialProviderCredentialEvents {
	/*0068*/ virtual HRESULT BeginFieldUpdates() = 0;
	/*0070*/ virtual HRESULT EndFieldUpdates() = 0;
	/*0078*/ virtual HRESULT SetFieldOptions( ICredentialProviderCredential * , ULONG , CREDENTIAL_PROVIDER_CREDENTIAL_FIELD_OPTIONS ) = 0;
	void ICredentialProviderCredentialEvents2( ICredentialProviderCredentialEvents2 && );
	void ICredentialProviderCredentialEvents2( ICredentialProviderCredentialEvents2 const & );
	void ICredentialProviderCredentialEvents2();
	ICredentialProviderCredentialEvents2 & operator=( ICredentialProviderCredentialEvents2 && );
	ICredentialProviderCredentialEvents2 & operator=( ICredentialProviderCredentialEvents2 const & );
	/*0008*/
};

struct ICredentialProviderCredentialWithFieldOptions : IUnknown {
	/*0018*/ virtual HRESULT GetFieldOptions( ULONG , CREDENTIAL_PROVIDER_CREDENTIAL_FIELD_OPTIONS * ) = 0;
	void ICredentialProviderCredentialWithFieldOptions( ICredentialProviderCredentialWithFieldOptions && );
	void ICredentialProviderCredentialWithFieldOptions( ICredentialProviderCredentialWithFieldOptions const & );
	void ICredentialProviderCredentialWithFieldOptions();
	ICredentialProviderCredentialWithFieldOptions & operator=( ICredentialProviderCredentialWithFieldOptions && );
	ICredentialProviderCredentialWithFieldOptions & operator=( ICredentialProviderCredentialWithFieldOptions const & );
	/*0008*/
};

struct ICredentialProviderEvents : IUnknown {
	/*0018*/ virtual HRESULT CredentialsChanged( ULONGLONG ) = 0;
	void ICredentialProviderEvents( ICredentialProviderEvents && );
	void ICredentialProviderEvents( ICredentialProviderEvents const & );
	void ICredentialProviderEvents();
	ICredentialProviderEvents & operator=( ICredentialProviderEvents && );
	ICredentialProviderEvents & operator=( ICredentialProviderEvents const & );
	/*0008*/
};

struct ICredentialProviderFilter : IUnknown {
	/*0018*/ virtual HRESULT Filter( _CREDENTIAL_PROVIDER_USAGE_SCENARIO , ULONG , _GUID * , INT * , ULONG ) = 0;
	/*0020*/ virtual HRESULT UpdateRemoteCredential( _CREDENTIAL_PROVIDER_CREDENTIAL_SERIALIZATION const * , _CREDENTIAL_PROVIDER_CREDENTIAL_SERIALIZATION * ) = 0;
	void ICredentialProviderFilter( ICredentialProviderFilter && );
	void ICredentialProviderFilter( ICredentialProviderFilter const & );
	void ICredentialProviderFilter();
	ICredentialProviderFilter & operator=( ICredentialProviderFilter && );
	ICredentialProviderFilter & operator=( ICredentialProviderFilter const & );
	/*0008*/
};

struct ICredentialProviderSetUserArray : IUnknown {
	/*0018*/ virtual HRESULT SetUserArray( ICredentialProviderUserArray * ) = 0;
	void ICredentialProviderSetUserArray( ICredentialProviderSetUserArray && );
	void ICredentialProviderSetUserArray( ICredentialProviderSetUserArray const & );
	void ICredentialProviderSetUserArray();
	ICredentialProviderSetUserArray & operator=( ICredentialProviderSetUserArray && );
	ICredentialProviderSetUserArray & operator=( ICredentialProviderSetUserArray const & );
	/*0008*/
};

struct ICredentialProviderUser : IUnknown {
	/*0018*/ virtual HRESULT GetSid( WCHAR * * ) = 0;
	/*0020*/ virtual HRESULT GetProviderID( _GUID * ) = 0;
	/*0028*/ virtual HRESULT GetStringValue( _tagpropertykey const & , WCHAR * * ) = 0;
	/*0030*/ virtual HRESULT GetValue( _tagpropertykey const & , tagPROPVARIANT * ) = 0;
	void ICredentialProviderUser( ICredentialProviderUser && );
	void ICredentialProviderUser( ICredentialProviderUser const & );
	void ICredentialProviderUser();
	ICredentialProviderUser & operator=( ICredentialProviderUser && );
	ICredentialProviderUser & operator=( ICredentialProviderUser const & );
	/*0008*/
};

struct ICredentialProviderUserArray : IUnknown {
	/*0018*/ virtual HRESULT SetProviderFilter( _GUID const & ) = 0;
	/*0020*/ virtual HRESULT GetAccountOptions( CREDENTIAL_PROVIDER_ACCOUNT_OPTIONS * ) = 0;
	/*0028*/ virtual HRESULT GetCount( ULONG * ) = 0;
	/*0030*/ virtual HRESULT GetAt( ULONG , ICredentialProviderUser * * ) = 0;
	void ICredentialProviderUserArray( ICredentialProviderUserArray && );
	void ICredentialProviderUserArray( ICredentialProviderUserArray const & );
	void ICredentialProviderUserArray();
	ICredentialProviderUserArray & operator=( ICredentialProviderUserArray && );
	ICredentialProviderUserArray & operator=( ICredentialProviderUserArray const & );
	/*0008*/
};

struct ICurrentItem : IRelatedItem {
	void ICurrentItem( ICurrentItem && );
	void ICurrentItem( ICurrentItem const & );
	void ICurrentItem();
	ICurrentItem & operator=( ICurrentItem && );
	ICurrentItem & operator=( ICurrentItem const & );
	/*0008*/
};

struct ICustomDestinationList : IUnknown {
	/*0018*/ virtual HRESULT SetAppID( WCHAR const * ) = 0;
	/*0020*/ virtual HRESULT BeginList( UINT * , _GUID const & , void * * ) = 0;
	/*0028*/ virtual HRESULT AppendCategory( WCHAR const * , IObjectArray * ) = 0;
	/*0030*/ virtual HRESULT AppendKnownCategory( KNOWNDESTCATEGORY ) = 0;
	/*0038*/ virtual HRESULT AddUserTasks( IObjectArray * ) = 0;
	/*0040*/ virtual HRESULT CommitList() = 0;
	/*0048*/ virtual HRESULT GetRemovedDestinations( _GUID const & , void * * ) = 0;
	/*0050*/ virtual HRESULT DeleteList( WCHAR const * ) = 0;
	/*0058*/ virtual HRESULT AbortList() = 0;
	void ICustomDestinationList( ICustomDestinationList && );
	void ICustomDestinationList( ICustomDestinationList const & );
	void ICustomDestinationList();
	ICustomDestinationList & operator=( ICustomDestinationList && );
	ICustomDestinationList & operator=( ICustomDestinationList const & );
	/*0008*/
};

struct IDataAdviseHolder : IUnknown {
	/*0018*/ virtual HRESULT Advise( IDataObject * , tagFORMATETC * , ULONG , IAdviseSink * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Unadvise( ULONG ) = 0;
	/*0028*/ virtual HRESULT EnumAdvise( IEnumSTATDATA * * ) = 0;
	/*0030*/ virtual HRESULT SendOnDataChange( IDataObject * , ULONG , ULONG ) = 0;
	void IDataAdviseHolder( IDataAdviseHolder && );
	void IDataAdviseHolder( IDataAdviseHolder const & );
	void IDataAdviseHolder();
	IDataAdviseHolder & operator=( IDataAdviseHolder && );
	IDataAdviseHolder & operator=( IDataAdviseHolder const & );
	/*0008*/
};

struct IDataFilter : IUnknown {
	/*0018*/ virtual HRESULT DoEncode( ULONG , LONG , UCHAR * , LONG , UCHAR * , LONG , LONG * , LONG * , ULONG ) = 0;
	/*0020*/ virtual HRESULT DoDecode( ULONG , LONG , UCHAR * , LONG , UCHAR * , LONG , LONG * , LONG * , ULONG ) = 0;
	/*0028*/ virtual HRESULT SetEncodingLevel( ULONG ) = 0;
	void IDataFilter( IDataFilter && );
	void IDataFilter( IDataFilter const & );
	void IDataFilter();
	IDataFilter & operator=( IDataFilter && );
	IDataFilter & operator=( IDataFilter const & );
	/*0008*/
};

struct IDataObject : IUnknown {
	/*0018*/ virtual HRESULT GetData( tagFORMATETC * , tagSTGMEDIUM * ) = 0;
	/*0020*/ virtual HRESULT GetDataHere( tagFORMATETC * , tagSTGMEDIUM * ) = 0;
	/*0028*/ virtual HRESULT QueryGetData( tagFORMATETC * ) = 0;
	/*0030*/ virtual HRESULT GetCanonicalFormatEtc( tagFORMATETC * , tagFORMATETC * ) = 0;
	/*0038*/ virtual HRESULT SetData( tagFORMATETC * , tagSTGMEDIUM * , INT ) = 0;
	/*0040*/ virtual HRESULT EnumFormatEtc( ULONG , IEnumFORMATETC * * ) = 0;
	/*0048*/ virtual HRESULT DAdvise( tagFORMATETC * , ULONG , IAdviseSink * , ULONG * ) = 0;
	/*0050*/ virtual HRESULT DUnadvise( ULONG ) = 0;
	/*0058*/ virtual HRESULT EnumDAdvise( IEnumSTATDATA * * ) = 0;
	void IDataObject( IDataObject && );
	void IDataObject( IDataObject const & );
	void IDataObject();
	IDataObject & operator=( IDataObject && );
	IDataObject & operator=( IDataObject const & );
	/*0008*/
};

struct IDataObjectProvider : IUnknown {
	/*0018*/ virtual HRESULT GetDataObject( IDataObject * * ) = 0;
	/*0020*/ virtual HRESULT SetDataObject( IDataObject * ) = 0;
	void IDataObjectProvider( IDataObjectProvider && );
	void IDataObjectProvider( IDataObjectProvider const & );
	void IDataObjectProvider();
	IDataObjectProvider & operator=( IDataObjectProvider && );
	IDataObjectProvider & operator=( IDataObjectProvider const & );
	/*0008*/
};

struct IDataTransferManagerInterop : IUnknown {
	/*0018*/ virtual HRESULT GetForWindow( HWND__ * , _GUID const & , void * * ) = 0;
	/*0020*/ virtual HRESULT ShowShareUIForWindow( HWND__ * ) = 0;
	void IDataTransferManagerInterop( IDataTransferManagerInterop && );
	void IDataTransferManagerInterop( IDataTransferManagerInterop const & );
	void IDataTransferManagerInterop();
	IDataTransferManagerInterop & operator=( IDataTransferManagerInterop && );
	IDataTransferManagerInterop & operator=( IDataTransferManagerInterop const & );
	/*0008*/
};

struct IDefaultExtractIconInit : IUnknown {
	/*0018*/ virtual HRESULT SetFlags( UINT ) = 0;
	/*0020*/ virtual HRESULT SetKey( HKEY__ * ) = 0;
	/*0028*/ virtual HRESULT SetNormalIcon( WCHAR const * , INT ) = 0;
	/*0030*/ virtual HRESULT SetOpenIcon( WCHAR const * , INT ) = 0;
	/*0038*/ virtual HRESULT SetShortcutIcon( WCHAR const * , INT ) = 0;
	/*0040*/ virtual HRESULT SetDefaultIcon( WCHAR const * , INT ) = 0;
	void IDefaultExtractIconInit( IDefaultExtractIconInit && );
	void IDefaultExtractIconInit( IDefaultExtractIconInit const & );
	void IDefaultExtractIconInit();
	IDefaultExtractIconInit & operator=( IDefaultExtractIconInit && );
	IDefaultExtractIconInit & operator=( IDefaultExtractIconInit const & );
	/*0008*/
};

struct IDefaultFolderMenuInitialize : IUnknown {
	/*0018*/ virtual HRESULT Initialize( HWND__ * , IContextMenuCB * , _ITEMIDLIST const __unaligned * , IShellFolder * , UINT , _ITEMIDLIST const __unaligned * * , IUnknown * , UINT , HKEY__ * const * ) = 0;
	/*0020*/ virtual HRESULT SetMenuRestrictions( DEFAULT_FOLDER_MENU_RESTRICTIONS ) = 0;
	/*0028*/ virtual HRESULT GetMenuRestrictions( DEFAULT_FOLDER_MENU_RESTRICTIONS , DEFAULT_FOLDER_MENU_RESTRICTIONS * ) = 0;
	/*0030*/ virtual HRESULT SetHandlerClsid( _GUID const & ) = 0;
	void IDefaultFolderMenuInitialize( IDefaultFolderMenuInitialize && );
	void IDefaultFolderMenuInitialize( IDefaultFolderMenuInitialize const & );
	void IDefaultFolderMenuInitialize();
	IDefaultFolderMenuInitialize & operator=( IDefaultFolderMenuInitialize && );
	IDefaultFolderMenuInitialize & operator=( IDefaultFolderMenuInitialize const & );
	/*0008*/
};

struct IDelayedPropertyStoreFactory : IPropertyStoreFactory {
	/*0028*/ virtual HRESULT GetDelayedPropertyStore( GETPROPERTYSTOREFLAGS , ULONG , _GUID const & , void * * ) = 0;
	void IDelayedPropertyStoreFactory( IDelayedPropertyStoreFactory && );
	void IDelayedPropertyStoreFactory( IDelayedPropertyStoreFactory const & );
	void IDelayedPropertyStoreFactory();
	IDelayedPropertyStoreFactory & operator=( IDelayedPropertyStoreFactory && );
	IDelayedPropertyStoreFactory & operator=( IDelayedPropertyStoreFactory const & );
	/*0008*/
};

struct IDelegateFolder : IUnknown {
	/*0018*/ virtual HRESULT SetItemAlloc( IMalloc * ) = 0;
	void IDelegateFolder( IDelegateFolder && );
	void IDelegateFolder( IDelegateFolder const & );
	void IDelegateFolder();
	IDelegateFolder & operator=( IDelegateFolder && );
	IDelegateFolder & operator=( IDelegateFolder const & );
	/*0008*/
};

struct IDelegateItem : IRelatedItem {
	void IDelegateItem( IDelegateItem && );
	void IDelegateItem( IDelegateItem const & );
	void IDelegateItem();
	IDelegateItem & operator=( IDelegateItem && );
	IDelegateItem & operator=( IDelegateItem const & );
	/*0008*/
};

struct IDeskBand : IDockingWindow {
	/*0040*/ virtual HRESULT GetBandInfo( ULONG , ULONG , DESKBANDINFO * ) = 0;
	void IDeskBand( IDeskBand && );
	void IDeskBand( IDeskBand const & );
	void IDeskBand();
	IDeskBand & operator=( IDeskBand && );
	IDeskBand & operator=( IDeskBand const & );
	/*0008*/
};

struct IDeskBandInfo : IUnknown {
	/*0018*/ virtual HRESULT GetDefaultBandWidth( ULONG , ULONG , INT * ) = 0;
	void IDeskBandInfo( IDeskBandInfo && );
	void IDeskBandInfo( IDeskBandInfo const & );
	void IDeskBandInfo();
	IDeskBandInfo & operator=( IDeskBandInfo && );
	IDeskBandInfo & operator=( IDeskBandInfo const & );
	/*0008*/
};

struct IDeskBar : IOleWindow {
	/*0028*/ virtual HRESULT SetClient( IUnknown * ) = 0;
	/*0030*/ virtual HRESULT GetClient( IUnknown * * ) = 0;
	/*0038*/ virtual HRESULT OnPosRectChangeDB( tagRECT * ) = 0;
	void IDeskBar( IDeskBar && );
	void IDeskBar( IDeskBar const & );
	void IDeskBar();
	IDeskBar & operator=( IDeskBar && );
	IDeskBar & operator=( IDeskBar const & );
	/*0008*/
};

struct IDesktopWallpaper : IUnknown {
	/*0018*/ virtual HRESULT SetWallpaper( WCHAR const * , WCHAR const * ) = 0;
	/*0020*/ virtual HRESULT GetWallpaper( WCHAR const * , WCHAR * * ) = 0;
	/*0028*/ virtual HRESULT GetMonitorDevicePathAt( UINT , WCHAR * * ) = 0;
	/*0030*/ virtual HRESULT GetMonitorDevicePathCount( UINT * ) = 0;
	/*0038*/ virtual HRESULT GetMonitorRECT( WCHAR const * , tagRECT * ) = 0;
	/*0040*/ virtual HRESULT SetBackgroundColor( ULONG ) = 0;
	/*0048*/ virtual HRESULT GetBackgroundColor( ULONG * ) = 0;
	/*0050*/ virtual HRESULT SetPosition( DESKTOP_WALLPAPER_POSITION ) = 0;
	/*0058*/ virtual HRESULT GetPosition( DESKTOP_WALLPAPER_POSITION * ) = 0;
	/*0060*/ virtual HRESULT SetSlideshow( IShellItemArray * ) = 0;
	/*0068*/ virtual HRESULT GetSlideshow( IShellItemArray * * ) = 0;
	/*0070*/ virtual HRESULT SetSlideshowOptions( DESKTOP_SLIDESHOW_OPTIONS , UINT ) = 0;
	/*0078*/ virtual HRESULT GetSlideshowOptions( DESKTOP_SLIDESHOW_OPTIONS * , UINT * ) = 0;
	/*0080*/ virtual HRESULT AdvanceSlideshow( WCHAR const * , DESKTOP_SLIDESHOW_DIRECTION ) = 0;
	/*0088*/ virtual HRESULT GetStatus( DESKTOP_SLIDESHOW_STATE * ) = 0;
	/*0090*/ virtual HRESULT Enable( INT ) = 0;
	void IDesktopWallpaper( IDesktopWallpaper && );
	void IDesktopWallpaper( IDesktopWallpaper const & );
	void IDesktopWallpaper();
	IDesktopWallpaper & operator=( IDesktopWallpaper && );
	IDesktopWallpaper & operator=( IDesktopWallpaper const & );
	/*0008*/
};

struct IDestinationStreamFactory : IUnknown {
	/*0018*/ virtual HRESULT GetDestinationStream( IStream * * ) = 0;
	void IDestinationStreamFactory( IDestinationStreamFactory && );
	void IDestinationStreamFactory( IDestinationStreamFactory const & );
	void IDestinationStreamFactory();
	IDestinationStreamFactory & operator=( IDestinationStreamFactory && );
	IDestinationStreamFactory & operator=( IDestinationStreamFactory const & );
	/*0008*/
};

struct IDirectWriterLock : IUnknown {
	/*0018*/ virtual HRESULT WaitForWriteAccess( ULONG ) = 0;
	/*0020*/ virtual HRESULT ReleaseWriteAccess() = 0;
	/*0028*/ virtual HRESULT HaveWriteAccess() = 0;
	void IDirectWriterLock( IDirectWriterLock && );
	void IDirectWriterLock( IDirectWriterLock const & );
	void IDirectWriterLock();
	IDirectWriterLock & operator=( IDirectWriterLock && );
	IDirectWriterLock & operator=( IDirectWriterLock const & );
	/*0008*/
};

struct IDisableAsyncRemotingForWinrtAsync : IUnknown {
	void IDisableAsyncRemotingForWinrtAsync( IDisableAsyncRemotingForWinrtAsync && );
	void IDisableAsyncRemotingForWinrtAsync( IDisableAsyncRemotingForWinrtAsync const & );
	void IDisableAsyncRemotingForWinrtAsync();
	IDisableAsyncRemotingForWinrtAsync & operator=( IDisableAsyncRemotingForWinrtAsync && );
	IDisableAsyncRemotingForWinrtAsync & operator=( IDisableAsyncRemotingForWinrtAsync const & );
	/*0008*/
};

struct IDisableFastRundown : IUnknown {
	void IDisableFastRundown( IDisableFastRundown && );
	void IDisableFastRundown( IDisableFastRundown const & );
	void IDisableFastRundown();
	IDisableFastRundown & operator=( IDisableFastRundown && );
	IDisableFastRundown & operator=( IDisableFastRundown const & );
	/*0008*/
};

struct IDispatch : IUnknown {
	/*0018*/ virtual HRESULT GetTypeInfoCount( UINT * ) = 0;
	/*0020*/ virtual HRESULT GetTypeInfo( UINT , ULONG , ITypeInfo * * ) = 0;
	/*0028*/ virtual HRESULT GetIDsOfNames( _GUID const & , WCHAR * * , UINT , ULONG , LONG * ) = 0;
	/*0030*/ virtual HRESULT Invoke( LONG , _GUID const & , ULONG , USHORT , tagDISPPARAMS * , tagVARIANT * , tagEXCEPINFO * , UINT * ) = 0;
	void IDispatch( IDispatch && );
	void IDispatch( IDispatch const & );
	void IDispatch();
	IDispatch & operator=( IDispatch && );
	IDispatch & operator=( IDispatch const & );
	/*0008*/
};

struct IDisplayItem : IRelatedItem {
	void IDisplayItem( IDisplayItem && );
	void IDisplayItem( IDisplayItem const & );
	void IDisplayItem();
	IDisplayItem & operator=( IDisplayItem && );
	IDisplayItem & operator=( IDisplayItem const & );
	/*0008*/
};

struct IDistList : IMAPIContainer {
	/*    */ virtual HRESULT QueryInterface( _GUID const & , void * * ) = 0;
	/*    */ virtual ULONG AddRef() = 0;
	/*    */ virtual ULONG Release() = 0;
	/*    */ virtual HRESULT GetLastError( HRESULT , ULONG , _MAPIERROR * * ) = 0;
	/*    */ virtual HRESULT SaveChanges( ULONG ) = 0;
	/*    */ virtual HRESULT GetProps( _SPropTagArray * , ULONG , ULONG * , _SPropValue * * ) = 0;
	/*    */ virtual HRESULT GetPropList( ULONG , _SPropTagArray * * ) = 0;
	/*    */ virtual HRESULT OpenProperty( ULONG , _GUID const * , ULONG , ULONG , IUnknown * * ) = 0;
	/*    */ virtual HRESULT SetProps( ULONG , _SPropValue * , _SPropProblemArray * * ) = 0;
	/*    */ virtual HRESULT DeleteProps( _SPropTagArray * , _SPropProblemArray * * ) = 0;
	/*    */ virtual HRESULT CopyTo( ULONG , _GUID const * , _SPropTagArray * , ULONG , IMAPIProgress * , _GUID const * , void * , ULONG , _SPropProblemArray * * ) = 0;
	/*    */ virtual HRESULT CopyProps( _SPropTagArray * , ULONG , IMAPIProgress * , _GUID const * , void * , ULONG , _SPropProblemArray * * ) = 0;
	/*    */ virtual HRESULT GetNamesFromIDs( _SPropTagArray * * , _GUID * , ULONG , ULONG * , _MAPINAMEID * * * ) = 0;
	/*    */ virtual HRESULT GetIDsFromNames( ULONG , _MAPINAMEID * * , ULONG , _SPropTagArray * * ) = 0;
	/*    */ virtual HRESULT GetContentsTable( ULONG , IMAPITable * * ) = 0;
	/*    */ virtual HRESULT GetHierarchyTable( ULONG , IMAPITable * * ) = 0;
	/*    */ virtual HRESULT OpenEntry( ULONG , ENTRYID * , _GUID const * , ULONG , ULONG * , IUnknown * * ) = 0;
	/*    */ virtual HRESULT SetSearchCriteria( _SRestriction * , _SBinaryArray * , ULONG ) = 0;
	/*    */ virtual HRESULT GetSearchCriteria( ULONG , _SRestriction * * , _SBinaryArray * * , ULONG * ) = 0;
	/*0098*/ virtual HRESULT CreateEntry( ULONG , ENTRYID * , ULONG , IMAPIProp * * ) = 0;
	/*00a0*/ virtual HRESULT CopyEntries( _SBinaryArray * , ULONG , IMAPIProgress * , ULONG ) = 0;
	/*00a8*/ virtual HRESULT DeleteEntries( _SBinaryArray * , ULONG ) = 0;
	/*00b0*/ virtual HRESULT ResolveNames( _SPropTagArray * , ULONG , _ADRLIST * , _flaglist * ) = 0;
	void IDistList( IDistList && );
	void IDistList( IDistList const & );
	void IDistList();
	IDistList & operator=( IDistList && );
	IDistList & operator=( IDistList const & );
	/*0008*/
};

struct IDocHostUIHandlerDispatch : IDispatch {
	/*0038*/ virtual HRESULT ShowContextMenu( ULONG , ULONG , ULONG , IUnknown * , IDispatch * , HRESULT * ) = 0;
	/*0040*/ virtual HRESULT GetHostInfo( ULONG * , ULONG * ) = 0;
	/*0048*/ virtual HRESULT ShowUI( ULONG , IUnknown * , IUnknown * , IUnknown * , IUnknown * , HRESULT * ) = 0;
	/*0050*/ virtual HRESULT HideUI() = 0;
	/*0058*/ virtual HRESULT UpdateUI() = 0;
	/*0060*/ virtual HRESULT EnableModeless( SHORT ) = 0;
	/*0068*/ virtual HRESULT OnDocWindowActivate( SHORT ) = 0;
	/*0070*/ virtual HRESULT OnFrameWindowActivate( SHORT ) = 0;
	/*0078*/ virtual HRESULT ResizeBorder( LONG , LONG , LONG , LONG , IUnknown * , SHORT ) = 0;
	/*0080*/ virtual HRESULT TranslateAcceleratorW( ULONGLONG , ULONG , ULONGLONG , ULONGLONG , WCHAR * , ULONG , HRESULT * ) = 0;
	/*0088*/ virtual HRESULT GetOptionKeyPath( WCHAR * * , ULONG ) = 0;
	/*0090*/ virtual HRESULT GetDropTarget( IUnknown * , IUnknown * * ) = 0;
	/*0098*/ virtual HRESULT GetExternal( IDispatch * * ) = 0;
	/*00a0*/ virtual HRESULT TranslateUrl( ULONG , WCHAR * , WCHAR * * ) = 0;
	/*00a8*/ virtual HRESULT FilterDataObject( IUnknown * , IUnknown * * ) = 0;
	void IDocHostUIHandlerDispatch( IDocHostUIHandlerDispatch && );
	void IDocHostUIHandlerDispatch( IDocHostUIHandlerDispatch const & );
	void IDocHostUIHandlerDispatch();
	IDocHostUIHandlerDispatch & operator=( IDocHostUIHandlerDispatch && );
	IDocHostUIHandlerDispatch & operator=( IDocHostUIHandlerDispatch const & );
	/*0008*/
};

struct IDockingWindow : IOleWindow {
	/*0028*/ virtual HRESULT ShowDW( INT ) = 0;
	/*0030*/ virtual HRESULT CloseDW( ULONG ) = 0;
	/*0038*/ virtual HRESULT ResizeBorderDW( tagRECT const * , IUnknown * , INT ) = 0;
	void IDockingWindow( IDockingWindow && );
	void IDockingWindow( IDockingWindow const & );
	void IDockingWindow();
	IDockingWindow & operator=( IDockingWindow && );
	IDockingWindow & operator=( IDockingWindow const & );
	/*0008*/
};

struct IDragSourceHelper : IUnknown {
	/*0018*/ virtual HRESULT InitializeFromBitmap( SHDRAGIMAGE * , IDataObject * ) = 0;
	/*0020*/ virtual HRESULT InitializeFromWindow( HWND__ * , tagPOINT * , IDataObject * ) = 0;
	void IDragSourceHelper( IDragSourceHelper && );
	void IDragSourceHelper( IDragSourceHelper const & );
	void IDragSourceHelper();
	IDragSourceHelper & operator=( IDragSourceHelper && );
	IDragSourceHelper & operator=( IDragSourceHelper const & );
	/*0008*/
};

struct IDropSource : IUnknown {
	/*0018*/ virtual HRESULT QueryContinueDrag( INT , ULONG ) = 0;
	/*0020*/ virtual HRESULT GiveFeedback( ULONG ) = 0;
	void IDropSource( IDropSource && );
	void IDropSource( IDropSource const & );
	void IDropSource();
	IDropSource & operator=( IDropSource && );
	IDropSource & operator=( IDropSource const & );
	/*0008*/
};

struct IDropSourceNotify : IUnknown {
	/*0018*/ virtual HRESULT DragEnterTarget( HWND__ * ) = 0;
	/*0020*/ virtual HRESULT DragLeaveTarget() = 0;
	void IDropSourceNotify( IDropSourceNotify && );
	void IDropSourceNotify( IDropSourceNotify const & );
	void IDropSourceNotify();
	IDropSourceNotify & operator=( IDropSourceNotify && );
	IDropSourceNotify & operator=( IDropSourceNotify const & );
	/*0008*/
};

struct IDropTarget : IUnknown {
	/*0018*/ virtual HRESULT DragEnter( IDataObject * , ULONG , _POINTL , ULONG * ) = 0;
	/*0020*/ virtual HRESULT DragOver( ULONG , _POINTL , ULONG * ) = 0;
	/*0028*/ virtual HRESULT DragLeave() = 0;
	/*0030*/ virtual HRESULT Drop( IDataObject * , ULONG , _POINTL , ULONG * ) = 0;
	void IDropTarget( IDropTarget && );
	void IDropTarget( IDropTarget const & );
	void IDropTarget();
	IDropTarget & operator=( IDropTarget && );
	IDropTarget & operator=( IDropTarget const & );
	/*0008*/
};

struct IDropTargetHelper : IUnknown {
	/*0018*/ virtual HRESULT DragEnter( HWND__ * , IDataObject * , tagPOINT * , ULONG ) = 0;
	/*0020*/ virtual HRESULT DragLeave() = 0;
	/*0028*/ virtual HRESULT DragOver( tagPOINT * , ULONG ) = 0;
	/*0030*/ virtual HRESULT Drop( IDataObject * , tagPOINT * , ULONG ) = 0;
	/*0038*/ virtual HRESULT Show( INT ) = 0;
	void IDropTargetHelper( IDropTargetHelper && );
	void IDropTargetHelper( IDropTargetHelper const & );
	void IDropTargetHelper();
	IDropTargetHelper & operator=( IDropTargetHelper && );
	IDropTargetHelper & operator=( IDropTargetHelper const & );
	/*0008*/
};

struct IDummyHICONIncluder : IUnknown {
	/*0018*/ virtual HRESULT Dummy( HICON__ * , HDC__ * ) = 0;
	void IDummyHICONIncluder( IDummyHICONIncluder && );
	void IDummyHICONIncluder( IDummyHICONIncluder const & );
	void IDummyHICONIncluder();
	IDummyHICONIncluder & operator=( IDummyHICONIncluder && );
	IDummyHICONIncluder & operator=( IDummyHICONIncluder const & );
	/*0008*/
};

enum IEObjectType {
	IE_EPM_OBJECT_EVENT = 0x0,
	IE_EPM_OBJECT_MUTEX = 0x1,
	IE_EPM_OBJECT_SEMAPHORE = 0x2,
	IE_EPM_OBJECT_SHARED_MEMORY = 0x3,
	IE_EPM_OBJECT_WAITABLE_TIMER = 0x4,
	IE_EPM_OBJECT_FILE = 0x5,
	IE_EPM_OBJECT_NAMED_PIPE = 0x6,
	IE_EPM_OBJECT_REGISTRY = 0x7
};

struct IEncodingFilterFactory : IUnknown {
	/*0018*/ virtual HRESULT FindBestFilter( WCHAR const * , WCHAR const * , _tagDATAINFO , IDataFilter * * ) = 0;
	/*0020*/ virtual HRESULT GetDefaultFilter( WCHAR const * , WCHAR const * , IDataFilter * * ) = 0;
	void IEncodingFilterFactory( IEncodingFilterFactory && );
	void IEncodingFilterFactory( IEncodingFilterFactory const & );
	void IEncodingFilterFactory();
	IEncodingFilterFactory & operator=( IEncodingFilterFactory && );
	IEncodingFilterFactory & operator=( IEncodingFilterFactory const & );
	/*0008*/
};

struct IEnterpriseDropTarget : IUnknown {
	/*0018*/ virtual HRESULT SetDropSourceEnterpriseId( WCHAR const * ) = 0;
	/*0020*/ virtual HRESULT IsEvaluatingEdpPolicy( INT * ) = 0;
	void IEnterpriseDropTarget( IEnterpriseDropTarget && );
	void IEnterpriseDropTarget( IEnterpriseDropTarget const & );
	void IEnterpriseDropTarget();
	IEnterpriseDropTarget & operator=( IEnterpriseDropTarget && );
	IEnterpriseDropTarget & operator=( IEnterpriseDropTarget const & );
	/*0008*/
};

struct IEnumAssocHandlers : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , IAssocHandler * * , ULONG * ) = 0;
	void IEnumAssocHandlers( IEnumAssocHandlers && );
	void IEnumAssocHandlers( IEnumAssocHandlers const & );
	void IEnumAssocHandlers();
	IEnumAssocHandlers & operator=( IEnumAssocHandlers && );
	IEnumAssocHandlers & operator=( IEnumAssocHandlers const & );
	/*0008*/
};

struct IEnumCATEGORYINFO : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , tagCATEGORYINFO * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumCATEGORYINFO * * ) = 0;
	void IEnumCATEGORYINFO( IEnumCATEGORYINFO && );
	void IEnumCATEGORYINFO( IEnumCATEGORYINFO const & );
	void IEnumCATEGORYINFO();
	IEnumCATEGORYINFO & operator=( IEnumCATEGORYINFO && );
	IEnumCATEGORYINFO & operator=( IEnumCATEGORYINFO const & );
	/*0008*/
};

struct IEnumConnectionPoints : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , IConnectionPoint * * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumConnectionPoints * * ) = 0;
	void IEnumConnectionPoints( IEnumConnectionPoints && );
	void IEnumConnectionPoints( IEnumConnectionPoints const & );
	void IEnumConnectionPoints();
	IEnumConnectionPoints & operator=( IEnumConnectionPoints && );
	IEnumConnectionPoints & operator=( IEnumConnectionPoints const & );
	/*0008*/
};

struct IEnumConnections : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , tagCONNECTDATA * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumConnections * * ) = 0;
	void IEnumConnections( IEnumConnections && );
	void IEnumConnections( IEnumConnections const & );
	void IEnumConnections();
	IEnumConnections & operator=( IEnumConnections && );
	IEnumConnections & operator=( IEnumConnections const & );
	/*0008*/
};

struct IEnumExplorerCommand : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , IExplorerCommand * * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumExplorerCommand * * ) = 0;
	void IEnumExplorerCommand( IEnumExplorerCommand && );
	void IEnumExplorerCommand( IEnumExplorerCommand const & );
	void IEnumExplorerCommand();
	IEnumExplorerCommand & operator=( IEnumExplorerCommand && );
	IEnumExplorerCommand & operator=( IEnumExplorerCommand const & );
	/*0008*/
};

struct IEnumExtraSearch : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , EXTRASEARCH * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumExtraSearch * * ) = 0;
	void IEnumExtraSearch( IEnumExtraSearch && );
	void IEnumExtraSearch( IEnumExtraSearch const & );
	void IEnumExtraSearch();
	IEnumExtraSearch & operator=( IEnumExtraSearch && );
	IEnumExtraSearch & operator=( IEnumExtraSearch const & );
	/*0008*/
};

struct IEnumFORMATETC : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , tagFORMATETC * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumFORMATETC * * ) = 0;
	void IEnumFORMATETC( IEnumFORMATETC && );
	void IEnumFORMATETC( IEnumFORMATETC const & );
	void IEnumFORMATETC();
	IEnumFORMATETC & operator=( IEnumFORMATETC && );
	IEnumFORMATETC & operator=( IEnumFORMATETC const & );
	/*0008*/
};

struct IEnumFullIDList : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , _ITEMIDLIST __unaligned * * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumFullIDList * * ) = 0;
	void IEnumFullIDList( IEnumFullIDList && );
	void IEnumFullIDList( IEnumFullIDList const & );
	void IEnumFullIDList();
	IEnumFullIDList & operator=( IEnumFullIDList && );
	IEnumFullIDList & operator=( IEnumFullIDList const & );
	/*0008*/
};

struct IEnumGUID : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , _GUID * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumGUID * * ) = 0;
	void IEnumGUID( IEnumGUID && );
	void IEnumGUID( IEnumGUID const & );
	void IEnumGUID();
	IEnumGUID & operator=( IEnumGUID && );
	IEnumGUID & operator=( IEnumGUID const & );
	/*0008*/
};

struct IEnumIDList : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , _ITEMIDLIST __unaligned * * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumIDList * * ) = 0;
	void IEnumIDList( IEnumIDList && );
	void IEnumIDList( IEnumIDList const & );
	void IEnumIDList();
	IEnumIDList & operator=( IEnumIDList && );
	IEnumIDList & operator=( IEnumIDList const & );
	/*0008*/
};

struct IEnumMoniker : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , IMoniker * * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumMoniker * * ) = 0;
	void IEnumMoniker( IEnumMoniker && );
	void IEnumMoniker( IEnumMoniker const & );
	void IEnumMoniker();
	IEnumMoniker & operator=( IEnumMoniker && );
	IEnumMoniker & operator=( IEnumMoniker const & );
	/*0008*/
};

struct IEnumNetCfgBindingInterface : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , INetCfgBindingInterface * * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumNetCfgBindingInterface * * ) = 0;
	void IEnumNetCfgBindingInterface( IEnumNetCfgBindingInterface && );
	void IEnumNetCfgBindingInterface( IEnumNetCfgBindingInterface const & );
	void IEnumNetCfgBindingInterface();
	IEnumNetCfgBindingInterface & operator=( IEnumNetCfgBindingInterface && );
	IEnumNetCfgBindingInterface & operator=( IEnumNetCfgBindingInterface const & );
	/*0008*/
};

struct IEnumNetCfgBindingPath : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , INetCfgBindingPath * * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumNetCfgBindingPath * * ) = 0;
	void IEnumNetCfgBindingPath( IEnumNetCfgBindingPath && );
	void IEnumNetCfgBindingPath( IEnumNetCfgBindingPath const & );
	void IEnumNetCfgBindingPath();
	IEnumNetCfgBindingPath & operator=( IEnumNetCfgBindingPath && );
	IEnumNetCfgBindingPath & operator=( IEnumNetCfgBindingPath const & );
	/*0008*/
};

struct IEnumNetCfgComponent : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , INetCfgComponent * * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumNetCfgComponent * * ) = 0;
	void IEnumNetCfgComponent( IEnumNetCfgComponent && );
	void IEnumNetCfgComponent( IEnumNetCfgComponent const & );
	void IEnumNetCfgComponent();
	IEnumNetCfgComponent & operator=( IEnumNetCfgComponent && );
	IEnumNetCfgComponent & operator=( IEnumNetCfgComponent const & );
	/*0008*/
};

struct IEnumNetConnection : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , INetConnection * * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumNetConnection * * ) = 0;
	void IEnumNetConnection( IEnumNetConnection && );
	void IEnumNetConnection( IEnumNetConnection const & );
	void IEnumNetConnection();
	IEnumNetConnection & operator=( IEnumNetConnection && );
	IEnumNetConnection & operator=( IEnumNetConnection const & );
	/*0008*/
};

struct IEnumNetSharingEveryConnection : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , tagVARIANT * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumNetSharingEveryConnection * * ) = 0;
	void IEnumNetSharingEveryConnection( IEnumNetSharingEveryConnection && );
	void IEnumNetSharingEveryConnection( IEnumNetSharingEveryConnection const & );
	void IEnumNetSharingEveryConnection();
	IEnumNetSharingEveryConnection & operator=( IEnumNetSharingEveryConnection && );
	IEnumNetSharingEveryConnection & operator=( IEnumNetSharingEveryConnection const & );
	/*0008*/
};

struct IEnumNetSharingPortMapping : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , tagVARIANT * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumNetSharingPortMapping * * ) = 0;
	void IEnumNetSharingPortMapping( IEnumNetSharingPortMapping && );
	void IEnumNetSharingPortMapping( IEnumNetSharingPortMapping const & );
	void IEnumNetSharingPortMapping();
	IEnumNetSharingPortMapping & operator=( IEnumNetSharingPortMapping && );
	IEnumNetSharingPortMapping & operator=( IEnumNetSharingPortMapping const & );
	/*0008*/
};

struct IEnumNetSharingPrivateConnection : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , tagVARIANT * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumNetSharingPrivateConnection * * ) = 0;
	void IEnumNetSharingPrivateConnection( IEnumNetSharingPrivateConnection && );
	void IEnumNetSharingPrivateConnection( IEnumNetSharingPrivateConnection const & );
	void IEnumNetSharingPrivateConnection();
	IEnumNetSharingPrivateConnection & operator=( IEnumNetSharingPrivateConnection && );
	IEnumNetSharingPrivateConnection & operator=( IEnumNetSharingPrivateConnection const & );
	/*0008*/
};

struct IEnumNetSharingPublicConnection : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , tagVARIANT * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumNetSharingPublicConnection * * ) = 0;
	void IEnumNetSharingPublicConnection( IEnumNetSharingPublicConnection && );
	void IEnumNetSharingPublicConnection( IEnumNetSharingPublicConnection const & );
	void IEnumNetSharingPublicConnection();
	IEnumNetSharingPublicConnection & operator=( IEnumNetSharingPublicConnection && );
	IEnumNetSharingPublicConnection & operator=( IEnumNetSharingPublicConnection const & );
	/*0008*/
};

struct IEnumNetworkConnectionProfilePrivate : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , INetworkConnectionProfilePrivate * * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumNetworkConnectionProfilePrivate * * ) = 0;
	void IEnumNetworkConnectionProfilePrivate( IEnumNetworkConnectionProfilePrivate && );
	void IEnumNetworkConnectionProfilePrivate( IEnumNetworkConnectionProfilePrivate const & );
	void IEnumNetworkConnectionProfilePrivate();
	IEnumNetworkConnectionProfilePrivate & operator=( IEnumNetworkConnectionProfilePrivate && );
	IEnumNetworkConnectionProfilePrivate & operator=( IEnumNetworkConnectionProfilePrivate const & );
	/*0008*/
};

struct IEnumNetworkConnections : IDispatch {
	/*0038*/ virtual HRESULT get__NewEnum( IEnumVARIANT * * ) = 0;
	/*0040*/ virtual HRESULT Next( ULONG , INetworkConnection * * , ULONG * ) = 0;
	/*0048*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0050*/ virtual HRESULT Reset() = 0;
	/*0058*/ virtual HRESULT Clone( IEnumNetworkConnections * * ) = 0;
	void IEnumNetworkConnections( IEnumNetworkConnections && );
	void IEnumNetworkConnections( IEnumNetworkConnections const & );
	void IEnumNetworkConnections();
	IEnumNetworkConnections & operator=( IEnumNetworkConnections && );
	IEnumNetworkConnections & operator=( IEnumNetworkConnections const & );
	/*0008*/
};

struct IEnumNetworkInterfacePrivate : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , INetworkInterfacePrivate * * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumNetworkInterfacePrivate * * ) = 0;
	void IEnumNetworkInterfacePrivate( IEnumNetworkInterfacePrivate && );
	void IEnumNetworkInterfacePrivate( IEnumNetworkInterfacePrivate const & );
	void IEnumNetworkInterfacePrivate();
	IEnumNetworkInterfacePrivate & operator=( IEnumNetworkInterfacePrivate && );
	IEnumNetworkInterfacePrivate & operator=( IEnumNetworkInterfacePrivate const & );
	/*0008*/
};

struct IEnumNetworkPrivate : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , INetworkPrivate * * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumNetworkPrivate * * ) = 0;
	void IEnumNetworkPrivate( IEnumNetworkPrivate && );
	void IEnumNetworkPrivate( IEnumNetworkPrivate const & );
	void IEnumNetworkPrivate();
	IEnumNetworkPrivate & operator=( IEnumNetworkPrivate && );
	IEnumNetworkPrivate & operator=( IEnumNetworkPrivate const & );
	/*0008*/
};

struct IEnumNetworkSignaturePrivate : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , INetworkSignaturePrivate * * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumNetworkSignaturePrivate * * ) = 0;
	void IEnumNetworkSignaturePrivate( IEnumNetworkSignaturePrivate && );
	void IEnumNetworkSignaturePrivate( IEnumNetworkSignaturePrivate const & );
	void IEnumNetworkSignaturePrivate();
	IEnumNetworkSignaturePrivate & operator=( IEnumNetworkSignaturePrivate && );
	IEnumNetworkSignaturePrivate & operator=( IEnumNetworkSignaturePrivate const & );
	/*0008*/
};

struct IEnumNetworks : IDispatch {
	/*0038*/ virtual HRESULT get__NewEnum( IEnumVARIANT * * ) = 0;
	/*0040*/ virtual HRESULT Next( ULONG , INetwork * * , ULONG * ) = 0;
	/*0048*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0050*/ virtual HRESULT Reset() = 0;
	/*0058*/ virtual HRESULT Clone( IEnumNetworks * * ) = 0;
	void IEnumNetworks( IEnumNetworks && );
	void IEnumNetworks( IEnumNetworks const & );
	void IEnumNetworks();
	IEnumNetworks & operator=( IEnumNetworks && );
	IEnumNetworks & operator=( IEnumNetworks const & );
	/*0008*/
};

struct IEnumOLEVERB : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , tagOLEVERB * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumOLEVERB * * ) = 0;
	void IEnumOLEVERB( IEnumOLEVERB && );
	void IEnumOLEVERB( IEnumOLEVERB const & );
	void IEnumOLEVERB();
	IEnumOLEVERB & operator=( IEnumOLEVERB && );
	IEnumOLEVERB & operator=( IEnumOLEVERB const & );
	/*0008*/
};

struct IEnumObjects : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , _GUID const & , void * * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumObjects * * ) = 0;
	void IEnumObjects( IEnumObjects && );
	void IEnumObjects( IEnumObjects const & );
	void IEnumObjects();
	IEnumObjects & operator=( IEnumObjects && );
	IEnumObjects & operator=( IEnumObjects const & );
	/*0008*/
};

struct IEnumOleUndoUnits : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , IOleUndoUnit * * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumOleUndoUnits * * ) = 0;
	void IEnumOleUndoUnits( IEnumOleUndoUnits && );
	void IEnumOleUndoUnits( IEnumOleUndoUnits const & );
	void IEnumOleUndoUnits();
	IEnumOleUndoUnits & operator=( IEnumOleUndoUnits && );
	IEnumOleUndoUnits & operator=( IEnumOleUndoUnits const & );
	/*0008*/
};

struct IEnumResources : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , SHELL_ITEM_RESOURCE * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumResources * * ) = 0;
	void IEnumResources( IEnumResources && );
	void IEnumResources( IEnumResources const & );
	void IEnumResources();
	IEnumResources & operator=( IEnumResources && );
	IEnumResources & operator=( IEnumResources const & );
	/*0008*/
};

struct IEnumSTATDATA : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , tagSTATDATA * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumSTATDATA * * ) = 0;
	void IEnumSTATDATA( IEnumSTATDATA && );
	void IEnumSTATDATA( IEnumSTATDATA const & );
	void IEnumSTATDATA();
	IEnumSTATDATA & operator=( IEnumSTATDATA && );
	IEnumSTATDATA & operator=( IEnumSTATDATA const & );
	/*0008*/
};

struct IEnumSTATPROPSETSTG : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , tagSTATPROPSETSTG * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumSTATPROPSETSTG * * ) = 0;
	void IEnumSTATPROPSETSTG( IEnumSTATPROPSETSTG && );
	void IEnumSTATPROPSETSTG( IEnumSTATPROPSETSTG const & );
	void IEnumSTATPROPSETSTG();
	IEnumSTATPROPSETSTG & operator=( IEnumSTATPROPSETSTG && );
	IEnumSTATPROPSETSTG & operator=( IEnumSTATPROPSETSTG const & );
	/*0008*/
};

struct IEnumSTATPROPSTG : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , tagSTATPROPSTG * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumSTATPROPSTG * * ) = 0;
	void IEnumSTATPROPSTG( IEnumSTATPROPSTG && );
	void IEnumSTATPROPSTG( IEnumSTATPROPSTG const & );
	void IEnumSTATPROPSTG();
	IEnumSTATPROPSTG & operator=( IEnumSTATPROPSTG && );
	IEnumSTATPROPSTG & operator=( IEnumSTATPROPSTG const & );
	/*0008*/
};

struct IEnumSTATSTG : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , tagSTATSTG * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumSTATSTG * * ) = 0;
	void IEnumSTATSTG( IEnumSTATSTG && );
	void IEnumSTATSTG( IEnumSTATSTG const & );
	void IEnumSTATSTG();
	IEnumSTATSTG & operator=( IEnumSTATSTG && );
	IEnumSTATSTG & operator=( IEnumSTATSTG const & );
	/*0008*/
};

struct IEnumShellItems : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , IShellItem * * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumShellItems * * ) = 0;
	void IEnumShellItems( IEnumShellItems && );
	void IEnumShellItems( IEnumShellItems const & );
	void IEnumShellItems();
	IEnumShellItems & operator=( IEnumShellItems && );
	IEnumShellItems & operator=( IEnumShellItems const & );
	/*0008*/
};

struct IEnumString : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , WCHAR * * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumString * * ) = 0;
	void IEnumString( IEnumString && );
	void IEnumString( IEnumString const & );
	void IEnumString();
	IEnumString & operator=( IEnumString && );
	IEnumString & operator=( IEnumString const & );
	/*0008*/
};

struct IEnumUnknown : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , IUnknown * * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumUnknown * * ) = 0;
	void IEnumUnknown( IEnumUnknown && );
	void IEnumUnknown( IEnumUnknown const & );
	void IEnumUnknown();
	IEnumUnknown & operator=( IEnumUnknown && );
	IEnumUnknown & operator=( IEnumUnknown const & );
	/*0008*/
};

struct IEnumVARIANT : IUnknown {
	/*0018*/ virtual HRESULT Next( ULONG , tagVARIANT * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Skip( ULONG ) = 0;
	/*0028*/ virtual HRESULT Reset() = 0;
	/*0030*/ virtual HRESULT Clone( IEnumVARIANT * * ) = 0;
	void IEnumVARIANT( IEnumVARIANT && );
	void IEnumVARIANT( IEnumVARIANT const & );
	void IEnumVARIANT();
	IEnumVARIANT & operator=( IEnumVARIANT && );
	IEnumVARIANT & operator=( IEnumVARIANT const & );
	/*0008*/
};

struct IErrorInfo : IUnknown {
	/*0018*/ virtual HRESULT GetGUID( _GUID * ) = 0;
	/*0020*/ virtual HRESULT GetSource( WCHAR * * ) = 0;
	/*0028*/ virtual HRESULT GetDescription( WCHAR * * ) = 0;
	/*0030*/ virtual HRESULT GetHelpFile( WCHAR * * ) = 0;
	/*0038*/ virtual HRESULT GetHelpContext( ULONG * ) = 0;
	void IErrorInfo( IErrorInfo && );
	void IErrorInfo( IErrorInfo const & );
	void IErrorInfo();
	IErrorInfo & operator=( IErrorInfo && );
	IErrorInfo & operator=( IErrorInfo const & );
	/*0008*/
};

struct IErrorLog : IUnknown {
	/*0018*/ virtual HRESULT AddError( WCHAR const * , tagEXCEPINFO * ) = 0;
	void IErrorLog( IErrorLog && );
	void IErrorLog( IErrorLog const & );
	void IErrorLog();
	IErrorLog & operator=( IErrorLog && );
	IErrorLog & operator=( IErrorLog const & );
	/*0008*/
};

struct IExecuteCommand : IUnknown {
	/*0018*/ virtual HRESULT SetKeyState( ULONG ) = 0;
	/*0020*/ virtual HRESULT SetParameters( WCHAR const * ) = 0;
	/*0028*/ virtual HRESULT SetPosition( tagPOINT ) = 0;
	/*0030*/ virtual HRESULT SetShowWindow( INT ) = 0;
	/*0038*/ virtual HRESULT SetNoShowUI( INT ) = 0;
	/*0040*/ virtual HRESULT SetDirectory( WCHAR const * ) = 0;
	/*0048*/ virtual HRESULT Execute() = 0;
	void IExecuteCommand( IExecuteCommand && );
	void IExecuteCommand( IExecuteCommand const & );
	void IExecuteCommand();
	IExecuteCommand & operator=( IExecuteCommand && );
	IExecuteCommand & operator=( IExecuteCommand const & );
	/*0008*/
};

struct IExecuteCommandApplicationHostEnvironment : IUnknown {
	/*0018*/ virtual HRESULT GetValue( AHE_TYPE * ) = 0;
	void IExecuteCommandApplicationHostEnvironment( IExecuteCommandApplicationHostEnvironment && );
	void IExecuteCommandApplicationHostEnvironment( IExecuteCommandApplicationHostEnvironment const & );
	void IExecuteCommandApplicationHostEnvironment();
	IExecuteCommandApplicationHostEnvironment & operator=( IExecuteCommandApplicationHostEnvironment && );
	IExecuteCommandApplicationHostEnvironment & operator=( IExecuteCommandApplicationHostEnvironment const & );
	/*0008*/
};

struct IExecuteCommandHost : IUnknown {
	/*0018*/ virtual HRESULT GetUIMode( EC_HOST_UI_MODE * ) = 0;
	void IExecuteCommandHost( IExecuteCommandHost && );
	void IExecuteCommandHost( IExecuteCommandHost const & );
	void IExecuteCommandHost();
	IExecuteCommandHost & operator=( IExecuteCommandHost && );
	IExecuteCommandHost & operator=( IExecuteCommandHost const & );
	/*0008*/
};

struct IExplorerBrowser : IUnknown {
	/*0018*/ virtual HRESULT Initialize( HWND__ * , tagRECT const * , FOLDERSETTINGS const * ) = 0;
	/*0020*/ virtual HRESULT Destroy() = 0;
	/*0028*/ virtual HRESULT SetRect( void * * , tagRECT ) = 0;
	/*0030*/ virtual HRESULT SetPropertyBag( WCHAR const * ) = 0;
	/*0038*/ virtual HRESULT SetEmptyText( WCHAR const * ) = 0;
	/*0040*/ virtual HRESULT SetFolderSettings( FOLDERSETTINGS const * ) = 0;
	/*0048*/ virtual HRESULT Advise( IExplorerBrowserEvents * , ULONG * ) = 0;
	/*0050*/ virtual HRESULT Unadvise( ULONG ) = 0;
	/*0058*/ virtual HRESULT SetOptions( EXPLORER_BROWSER_OPTIONS ) = 0;
	/*0060*/ virtual HRESULT GetOptions( EXPLORER_BROWSER_OPTIONS * ) = 0;
	/*0068*/ virtual HRESULT BrowseToIDList( _ITEMIDLIST const __unaligned * , UINT ) = 0;
	/*0070*/ virtual HRESULT BrowseToObject( IUnknown * , UINT ) = 0;
	/*0078*/ virtual HRESULT FillFromObject( IUnknown * , EXPLORER_BROWSER_FILL_FLAGS ) = 0;
	/*0080*/ virtual HRESULT RemoveAll() = 0;
	/*0088*/ virtual HRESULT GetCurrentView( _GUID const & , void * * ) = 0;
	void IExplorerBrowser( IExplorerBrowser && );
	void IExplorerBrowser( IExplorerBrowser const & );
	void IExplorerBrowser();
	IExplorerBrowser & operator=( IExplorerBrowser && );
	IExplorerBrowser & operator=( IExplorerBrowser const & );
	/*0008*/
};

struct IExplorerBrowserEvents : IUnknown {
	/*0018*/ virtual HRESULT OnNavigationPending( _ITEMIDLIST const __unaligned * ) = 0;
	/*0020*/ virtual HRESULT OnViewCreated( IShellView * ) = 0;
	/*0028*/ virtual HRESULT OnNavigationComplete( _ITEMIDLIST const __unaligned * ) = 0;
	/*0030*/ virtual HRESULT OnNavigationFailed( _ITEMIDLIST const __unaligned * ) = 0;
	void IExplorerBrowserEvents( IExplorerBrowserEvents && );
	void IExplorerBrowserEvents( IExplorerBrowserEvents const & );
	void IExplorerBrowserEvents();
	IExplorerBrowserEvents & operator=( IExplorerBrowserEvents && );
	IExplorerBrowserEvents & operator=( IExplorerBrowserEvents const & );
	/*0008*/
};

struct IExplorerCommand : IUnknown {
	/*0018*/ virtual HRESULT GetTitle( IShellItemArray * , WCHAR * * ) = 0;
	/*0020*/ virtual HRESULT GetIcon( IShellItemArray * , WCHAR * * ) = 0;
	/*0028*/ virtual HRESULT GetToolTip( IShellItemArray * , WCHAR * * ) = 0;
	/*0030*/ virtual HRESULT GetCanonicalName( _GUID * ) = 0;
	/*0038*/ virtual HRESULT GetState( IShellItemArray * , INT , ULONG * ) = 0;
	/*0040*/ virtual HRESULT Invoke( IShellItemArray * , IBindCtx * ) = 0;
	/*0048*/ virtual HRESULT GetFlags( ULONG * ) = 0;
	/*0050*/ virtual HRESULT EnumSubCommands( IEnumExplorerCommand * * ) = 0;
	void IExplorerCommand( IExplorerCommand && );
	void IExplorerCommand( IExplorerCommand const & );
	void IExplorerCommand();
	IExplorerCommand & operator=( IExplorerCommand && );
	IExplorerCommand & operator=( IExplorerCommand const & );
	/*0008*/
};

struct IExplorerCommandProvider : IUnknown {
	/*0018*/ virtual HRESULT GetCommands( IUnknown * , _GUID const & , void * * ) = 0;
	/*0020*/ virtual HRESULT GetCommand( _GUID const & , _GUID const & , void * * ) = 0;
	void IExplorerCommandProvider( IExplorerCommandProvider && );
	void IExplorerCommandProvider( IExplorerCommandProvider const & );
	void IExplorerCommandProvider();
	IExplorerCommandProvider & operator=( IExplorerCommandProvider && );
	IExplorerCommandProvider & operator=( IExplorerCommandProvider const & );
	/*0008*/
};

struct IExplorerCommandState : IUnknown {
	/*0018*/ virtual HRESULT GetState( IShellItemArray * , INT , ULONG * ) = 0;
	void IExplorerCommandState( IExplorerCommandState && );
	void IExplorerCommandState( IExplorerCommandState const & );
	void IExplorerCommandState();
	IExplorerCommandState & operator=( IExplorerCommandState && );
	IExplorerCommandState & operator=( IExplorerCommandState const & );
	/*0008*/
};

struct IExplorerPaneVisibility : IUnknown {
	/*0018*/ virtual HRESULT GetPaneState( _GUID const & , ULONG * ) = 0;
	void IExplorerPaneVisibility( IExplorerPaneVisibility && );
	void IExplorerPaneVisibility( IExplorerPaneVisibility const & );
	void IExplorerPaneVisibility();
	IExplorerPaneVisibility & operator=( IExplorerPaneVisibility && );
	IExplorerPaneVisibility & operator=( IExplorerPaneVisibility const & );
	/*0008*/
};

struct IExternalConnection : IUnknown {
	/*0018*/ virtual ULONG AddConnection( ULONG , ULONG ) = 0;
	/*0020*/ virtual ULONG ReleaseConnection( ULONG , ULONG , INT ) = 0;
	void IExternalConnection( IExternalConnection && );
	void IExternalConnection( IExternalConnection const & );
	void IExternalConnection();
	IExternalConnection & operator=( IExternalConnection && );
	IExternalConnection & operator=( IExternalConnection const & );
	/*0008*/
};

struct IExtractImage : IUnknown {
	/*0018*/ virtual HRESULT GetLocation( WCHAR * , ULONG , ULONG * , tagSIZE const * , ULONG , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Extract( HBITMAP__ * * ) = 0;
	void IExtractImage( IExtractImage && );
	void IExtractImage( IExtractImage const & );
	void IExtractImage();
	IExtractImage & operator=( IExtractImage && );
	IExtractImage & operator=( IExtractImage const & );
	/*0008*/
};

struct IExtractImage2 : IExtractImage {
	/*0028*/ virtual HRESULT GetDateStamp( _FILETIME * ) = 0;
	void IExtractImage2( IExtractImage2 && );
	void IExtractImage2( IExtractImage2 const & );
	void IExtractImage2();
	IExtractImage2 & operator=( IExtractImage2 && );
	IExtractImage2 & operator=( IExtractImage2 const & );
	/*0008*/
};

enum IF_OPER_STATUS {
	IfOperStatusUp = 0x1,
	IfOperStatusDown = 0x2,
	IfOperStatusTesting = 0x3,
	IfOperStatusUnknown = 0x4,
	IfOperStatusDormant = 0x5,
	IfOperStatusNotPresent = 0x6,
	IfOperStatusLowerLayerDown = 0x7
};

struct IFastRundown : IUnknown {
	void IFastRundown( IFastRundown && );
	void IFastRundown( IFastRundown const & );
	void IFastRundown();
	IFastRundown & operator=( IFastRundown && );
	IFastRundown & operator=( IFastRundown const & );
	/*0008*/
};

struct IFileDialog : IModalWindow {
	/*0020*/ virtual HRESULT SetFileTypes( UINT , _COMDLG_FILTERSPEC const * ) = 0;
	/*0028*/ virtual HRESULT SetFileTypeIndex( UINT ) = 0;
	/*0030*/ virtual HRESULT GetFileTypeIndex( UINT * ) = 0;
	/*0038*/ virtual HRESULT Advise( IFileDialogEvents * , ULONG * ) = 0;
	/*0040*/ virtual HRESULT Unadvise( ULONG ) = 0;
	/*0048*/ virtual HRESULT SetOptions( ULONG ) = 0;
	/*0050*/ virtual HRESULT GetOptions( ULONG * ) = 0;
	/*0058*/ virtual HRESULT SetDefaultFolder( IShellItem * ) = 0;
	/*0060*/ virtual HRESULT SetFolder( IShellItem * ) = 0;
	/*0068*/ virtual HRESULT GetFolder( IShellItem * * ) = 0;
	/*0070*/ virtual HRESULT GetCurrentSelection( IShellItem * * ) = 0;
	/*0078*/ virtual HRESULT SetFileName( WCHAR const * ) = 0;
	/*0080*/ virtual HRESULT GetFileName( WCHAR * * ) = 0;
	/*0088*/ virtual HRESULT SetTitle( WCHAR const * ) = 0;
	/*0090*/ virtual HRESULT SetOkButtonLabel( WCHAR const * ) = 0;
	/*0098*/ virtual HRESULT SetFileNameLabel( WCHAR const * ) = 0;
	/*00a0*/ virtual HRESULT GetResult( IShellItem * * ) = 0;
	/*00a8*/ virtual HRESULT AddPlace( IShellItem * , FDAP ) = 0;
	/*00b0*/ virtual HRESULT SetDefaultExtension( WCHAR const * ) = 0;
	/*00b8*/ virtual HRESULT Close( HRESULT ) = 0;
	/*00c0*/ virtual HRESULT SetClientGuid( _GUID const & ) = 0;
	/*00c8*/ virtual HRESULT ClearClientData() = 0;
	/*00d0*/ virtual HRESULT SetFilter( IShellItemFilter * ) = 0;
	void IFileDialog( IFileDialog && );
	void IFileDialog( IFileDialog const & );
	void IFileDialog();
	IFileDialog & operator=( IFileDialog && );
	IFileDialog & operator=( IFileDialog const & );
	/*0008*/
};

struct IFileDialogCustomize : IUnknown {
	/*0018*/ virtual HRESULT EnableOpenDropDown( ULONG ) = 0;
	/*0020*/ virtual HRESULT AddMenu( ULONG , WCHAR const * ) = 0;
	/*0028*/ virtual HRESULT AddPushButton( ULONG , WCHAR const * ) = 0;
	/*0030*/ virtual HRESULT AddComboBox( ULONG ) = 0;
	/*0038*/ virtual HRESULT AddRadioButtonList( ULONG ) = 0;
	/*0040*/ virtual HRESULT AddCheckButton( ULONG , WCHAR const * , INT ) = 0;
	/*0048*/ virtual HRESULT AddEditBox( ULONG , WCHAR const * ) = 0;
	/*0050*/ virtual HRESULT AddSeparator( ULONG ) = 0;
	/*0058*/ virtual HRESULT AddText( ULONG , WCHAR const * ) = 0;
	/*0060*/ virtual HRESULT SetControlLabel( ULONG , WCHAR const * ) = 0;
	/*0068*/ virtual HRESULT GetControlState( ULONG , CDCONTROLSTATEF * ) = 0;
	/*0070*/ virtual HRESULT SetControlState( ULONG , CDCONTROLSTATEF ) = 0;
	/*0078*/ virtual HRESULT GetEditBoxText( ULONG , WCHAR * * ) = 0;
	/*0080*/ virtual HRESULT SetEditBoxText( ULONG , WCHAR const * ) = 0;
	/*0088*/ virtual HRESULT GetCheckButtonState( ULONG , INT * ) = 0;
	/*0090*/ virtual HRESULT SetCheckButtonState( ULONG , INT ) = 0;
	/*0098*/ virtual HRESULT AddControlItem( ULONG , ULONG , WCHAR const * ) = 0;
	/*00a0*/ virtual HRESULT RemoveControlItem( ULONG , ULONG ) = 0;
	/*00a8*/ virtual HRESULT RemoveAllControlItems( ULONG ) = 0;
	/*00b0*/ virtual HRESULT GetControlItemState( ULONG , ULONG , CDCONTROLSTATEF * ) = 0;
	/*00b8*/ virtual HRESULT SetControlItemState( ULONG , ULONG , CDCONTROLSTATEF ) = 0;
	/*00c0*/ virtual HRESULT GetSelectedControlItem( ULONG , ULONG * ) = 0;
	/*00c8*/ virtual HRESULT SetSelectedControlItem( ULONG , ULONG ) = 0;
	/*00d0*/ virtual HRESULT StartVisualGroup( ULONG , WCHAR const * ) = 0;
	/*00d8*/ virtual HRESULT EndVisualGroup() = 0;
	/*00e0*/ virtual HRESULT MakeProminent( ULONG ) = 0;
	/*00e8*/ virtual HRESULT SetControlItemText( ULONG , ULONG , WCHAR const * ) = 0;
	void IFileDialogCustomize( IFileDialogCustomize && );
	void IFileDialogCustomize( IFileDialogCustomize const & );
	void IFileDialogCustomize();
	IFileDialogCustomize & operator=( IFileDialogCustomize && );
	IFileDialogCustomize & operator=( IFileDialogCustomize const & );
	/*0008*/
};

struct IFileDialogEvents : IUnknown {
	/*0018*/ virtual HRESULT OnFileOk( IFileDialog * ) = 0;
	/*0020*/ virtual HRESULT OnFolderChanging( IFileDialog * , IShellItem * ) = 0;
	/*0028*/ virtual HRESULT OnFolderChange( IFileDialog * ) = 0;
	/*0030*/ virtual HRESULT OnSelectionChange( IFileDialog * ) = 0;
	/*0038*/ virtual HRESULT OnShareViolation( IFileDialog * , IShellItem * , FDE_SHAREVIOLATION_RESPONSE * ) = 0;
	/*0040*/ virtual HRESULT OnTypeChange( IFileDialog * ) = 0;
	/*0048*/ virtual HRESULT OnOverwrite( IFileDialog * , IShellItem * , FDE_OVERWRITE_RESPONSE * ) = 0;
	void IFileDialogEvents( IFileDialogEvents && );
	void IFileDialogEvents( IFileDialogEvents const & );
	void IFileDialogEvents();
	IFileDialogEvents & operator=( IFileDialogEvents && );
	IFileDialogEvents & operator=( IFileDialogEvents const & );
	/*0008*/
};

struct IFileIsInUse : IUnknown {
	/*0018*/ virtual HRESULT GetAppName( WCHAR * * ) = 0;
	/*0020*/ virtual HRESULT GetUsage( FILE_USAGE_TYPE * ) = 0;
	/*0028*/ virtual HRESULT GetCapabilities( ULONG * ) = 0;
	/*0030*/ virtual HRESULT GetSwitchToHWND( HWND__ * * ) = 0;
	/*0038*/ virtual HRESULT CloseFile() = 0;
	void IFileIsInUse( IFileIsInUse && );
	void IFileIsInUse( IFileIsInUse const & );
	void IFileIsInUse();
	IFileIsInUse & operator=( IFileIsInUse && );
	IFileIsInUse & operator=( IFileIsInUse const & );
	/*0008*/
};

struct IFileOpenDialog : IFileDialog {
	/*00d8*/ virtual HRESULT GetResults( IShellItemArray * * ) = 0;
	/*00e0*/ virtual HRESULT GetSelectedItems( IShellItemArray * * ) = 0;
	void IFileOpenDialog( IFileOpenDialog && );
	void IFileOpenDialog( IFileOpenDialog const & );
	void IFileOpenDialog();
	IFileOpenDialog & operator=( IFileOpenDialog && );
	IFileOpenDialog & operator=( IFileOpenDialog const & );
	/*0008*/
};

struct IFileOperation : IUnknown {
	/*0018*/ virtual HRESULT Advise( IFileOperationProgressSink * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT Unadvise( ULONG ) = 0;
	/*0028*/ virtual HRESULT SetOperationFlags( ULONG ) = 0;
	/*0030*/ virtual HRESULT SetProgressMessage( WCHAR const * ) = 0;
	/*0038*/ virtual HRESULT SetProgressDialog( IOperationsProgressDialog * ) = 0;
	/*0040*/ virtual HRESULT SetProperties( IPropertyChangeArray * ) = 0;
	/*0048*/ virtual HRESULT SetOwnerWindow( HWND__ * ) = 0;
	/*0050*/ virtual HRESULT ApplyPropertiesToItem( IShellItem * ) = 0;
	/*0058*/ virtual HRESULT ApplyPropertiesToItems( IUnknown * ) = 0;
	/*0060*/ virtual HRESULT RenameItem( IShellItem * , WCHAR const * , IFileOperationProgressSink * ) = 0;
	/*0068*/ virtual HRESULT RenameItems( IUnknown * , WCHAR const * ) = 0;
	/*0070*/ virtual HRESULT MoveItem( IShellItem * , IShellItem * , WCHAR const * , IFileOperationProgressSink * ) = 0;
	/*0078*/ virtual HRESULT MoveItems( IUnknown * , IShellItem * ) = 0;
	/*0080*/ virtual HRESULT CopyItem( IShellItem * , IShellItem * , WCHAR const * , IFileOperationProgressSink * ) = 0;
	/*0088*/ virtual HRESULT CopyItems( IUnknown * , IShellItem * ) = 0;
	/*0090*/ virtual HRESULT DeleteItem( IShellItem * , IFileOperationProgressSink * ) = 0;
	/*0098*/ virtual HRESULT DeleteItems( IUnknown * ) = 0;
	/*00a0*/ virtual HRESULT NewItem( IShellItem * , ULONG , WCHAR const * , WCHAR const * , IFileOperationProgressSink * ) = 0;
	/*00a8*/ virtual HRESULT PerformOperations() = 0;
	/*00b0*/ virtual HRESULT GetAnyOperationsAborted( INT * ) = 0;
	void IFileOperation( IFileOperation && );
	void IFileOperation( IFileOperation const & );
	void IFileOperation();
	IFileOperation & operator=( IFileOperation && );
	IFileOperation & operator=( IFileOperation const & );
	/*0008*/
};

struct IFileOperation2 : IFileOperation {
	/*00b8*/ virtual HRESULT SetOperationFlags2( FILE_OPERATION_FLAGS2 ) = 0;
	void IFileOperation2( IFileOperation2 && );
	void IFileOperation2( IFileOperation2 const & );
	void IFileOperation2();
	IFileOperation2 & operator=( IFileOperation2 && );
	IFileOperation2 & operator=( IFileOperation2 const & );
	/*0008*/
};

struct IFileOperationProgressSink : IUnknown {
	/*0018*/ virtual HRESULT StartOperations() = 0;
	/*0020*/ virtual HRESULT FinishOperations( HRESULT ) = 0;
	/*0028*/ virtual HRESULT PreRenameItem( ULONG , IShellItem * , WCHAR const * ) = 0;
	/*0030*/ virtual HRESULT PostRenameItem( ULONG , IShellItem * , WCHAR const * , HRESULT , IShellItem * ) = 0;
	/*0038*/ virtual HRESULT PreMoveItem( ULONG , IShellItem * , IShellItem * , WCHAR const * ) = 0;
	/*0040*/ virtual HRESULT PostMoveItem( ULONG , IShellItem * , IShellItem * , WCHAR const * , HRESULT , IShellItem * ) = 0;
	/*0048*/ virtual HRESULT PreCopyItem( ULONG , IShellItem * , IShellItem * , WCHAR const * ) = 0;
	/*0050*/ virtual HRESULT PostCopyItem( ULONG , IShellItem * , IShellItem * , WCHAR const * , HRESULT , IShellItem * ) = 0;
	/*0058*/ virtual HRESULT PreDeleteItem( ULONG , IShellItem * ) = 0;
	/*0060*/ virtual HRESULT PostDeleteItem( ULONG , IShellItem * , HRESULT , IShellItem * ) = 0;
	/*0068*/ virtual HRESULT PreNewItem( ULONG , IShellItem * , WCHAR const * ) = 0;
	/*0070*/ virtual HRESULT PostNewItem( ULONG , IShellItem * , WCHAR const * , WCHAR const * , ULONG , HRESULT , IShellItem * ) = 0;
	/*0078*/ virtual HRESULT UpdateProgress( UINT , UINT ) = 0;
	/*0080*/ virtual HRESULT ResetTimer() = 0;
	/*0088*/ virtual HRESULT PauseTimer() = 0;
	/*0090*/ virtual HRESULT ResumeTimer() = 0;
	void IFileOperationProgressSink( IFileOperationProgressSink && );
	void IFileOperationProgressSink( IFileOperationProgressSink const & );
	void IFileOperationProgressSink();
	IFileOperationProgressSink & operator=( IFileOperationProgressSink && );
	IFileOperationProgressSink & operator=( IFileOperationProgressSink const & );
	/*0008*/
};

struct IFileSaveDialog : IFileDialog {
	/*00d8*/ virtual HRESULT SetSaveAsItem( IShellItem * ) = 0;
	/*00e0*/ virtual HRESULT SetProperties( IPropertyStore * ) = 0;
	/*00e8*/ virtual HRESULT SetCollectedProperties( IPropertyDescriptionList * , INT ) = 0;
	/*00f0*/ virtual HRESULT GetProperties( IPropertyStore * * ) = 0;
	/*00f8*/ virtual HRESULT ApplyProperties( IShellItem * , IPropertyStore * , HWND__ * , IFileOperationProgressSink * ) = 0;
	void IFileSaveDialog( IFileSaveDialog && );
	void IFileSaveDialog( IFileSaveDialog const & );
	void IFileSaveDialog();
	IFileSaveDialog & operator=( IFileSaveDialog && );
	IFileSaveDialog & operator=( IFileSaveDialog const & );
	/*0008*/
};

struct IFileSyncMergeHandler : IUnknown {
	/*0018*/ virtual HRESULT Merge( WCHAR const * , WCHAR const * , MERGE_UPDATE_STATUS * ) = 0;
	/*0020*/ virtual HRESULT ShowResolveConflictUIAsync( WCHAR const * , HMONITOR__ * ) = 0;
	void IFileSyncMergeHandler( IFileSyncMergeHandler && );
	void IFileSyncMergeHandler( IFileSyncMergeHandler const & );
	void IFileSyncMergeHandler();
	IFileSyncMergeHandler & operator=( IFileSyncMergeHandler && );
	IFileSyncMergeHandler & operator=( IFileSyncMergeHandler const & );
	/*0008*/
};

struct IFileSystemBindData : IUnknown {
	/*0018*/ virtual HRESULT SetFindData( _WIN32_FIND_DATAW const * ) = 0;
	/*0020*/ virtual HRESULT GetFindData( _WIN32_FIND_DATAW * ) = 0;
	void IFileSystemBindData( IFileSystemBindData && );
	void IFileSystemBindData( IFileSystemBindData const & );
	void IFileSystemBindData();
	IFileSystemBindData & operator=( IFileSystemBindData && );
	IFileSystemBindData & operator=( IFileSystemBindData const & );
	/*0008*/
};

struct IFileSystemBindData2 : IFileSystemBindData {
	/*0028*/ virtual HRESULT SetFileID( _LARGE_INTEGER ) = 0;
	/*0030*/ virtual HRESULT GetFileID( _LARGE_INTEGER * ) = 0;
	/*0038*/ virtual HRESULT SetJunctionCLSID( _GUID const & ) = 0;
	/*0040*/ virtual HRESULT GetJunctionCLSID( _GUID * ) = 0;
	void IFileSystemBindData2( IFileSystemBindData2 && );
	void IFileSystemBindData2( IFileSystemBindData2 const & );
	void IFileSystemBindData2();
	IFileSystemBindData2 & operator=( IFileSystemBindData2 && );
	IFileSystemBindData2 & operator=( IFileSystemBindData2 const & );
	/*0008*/
};

struct IFillLockBytes : IUnknown {
	/*0018*/ virtual HRESULT FillAppend( void const * , ULONG , ULONG * ) = 0;
	/*0020*/ virtual HRESULT FillAt( _ULARGE_INTEGER , void const * , ULONG , ULONG * ) = 0;
	/*0028*/ virtual HRESULT SetFillSize( _ULARGE_INTEGER ) = 0;
	/*0030*/ virtual HRESULT Terminate( INT ) = 0;
	void IFillLockBytes( IFillLockBytes && );
	void IFillLockBytes( IFillLockBytes const & );
	void IFillLockBytes();
	IFillLockBytes & operator=( IFillLockBytes && );
	IFillLockBytes & operator=( IFillLockBytes const & );
	/*0008*/
};

struct IFolderFilter : IUnknown {
	/*0018*/ virtual HRESULT ShouldShow( IShellFolder * , _ITEMIDLIST const __unaligned * , _ITEMIDLIST const __unaligned * ) = 0;
	/*0020*/ virtual HRESULT GetEnumFlags( IShellFolder * , _ITEMIDLIST const __unaligned * , HWND__ * * , ULONG * ) = 0;
	void IFolderFilter( IFolderFilter && );
	void IFolderFilter( IFolderFilter const & );
	void IFolderFilter();
	IFolderFilter & operator=( IFolderFilter && );
	IFolderFilter & operator=( IFolderFilter const & );
	/*0008*/
};

struct IFolderFilterSite : IUnknown {
	/*0018*/ virtual HRESULT SetFilter( IUnknown * ) = 0;
	void IFolderFilterSite( IFolderFilterSite && );
	void IFolderFilterSite( IFolderFilterSite const & );
	void IFolderFilterSite();
	IFolderFilterSite & operator=( IFolderFilterSite && );
	IFolderFilterSite & operator=( IFolderFilterSite const & );
	/*0008*/
};

struct IFolderView : IUnknown {
	/*0018*/ virtual HRESULT GetCurrentViewMode( UINT * ) = 0;
	/*0020*/ virtual HRESULT SetCurrentViewMode( UINT ) = 0;
	/*0028*/ virtual HRESULT GetFolder( _GUID const & , void * * ) = 0;
	/*0030*/ virtual HRESULT Item( INT , _ITEMIDLIST __unaligned * * ) = 0;
	/*0038*/ virtual HRESULT ItemCount( UINT , INT * ) = 0;
	/*0040*/ virtual HRESULT Items( UINT , _GUID const & , void * * ) = 0;
	/*0048*/ virtual HRESULT GetSelectionMarkedItem( INT * ) = 0;
	/*0050*/ virtual HRESULT GetFocusedItem( INT * ) = 0;
	/*0058*/ virtual HRESULT GetItemPosition( _ITEMIDLIST const __unaligned * , tagPOINT * ) = 0;
	/*0060*/ virtual HRESULT GetSpacing( tagPOINT * ) = 0;
	/*0068*/ virtual HRESULT GetDefaultSpacing( tagPOINT * ) = 0;
	/*0070*/ virtual HRESULT GetAutoArrange() = 0;
	/*0078*/ virtual HRESULT SelectItem( INT , ULONG ) = 0;
	/*0080*/ virtual HRESULT SelectAndPositionItems( UINT , _ITEMIDLIST const __unaligned * * , tagPOINT * , ULONG ) = 0;
	void IFolderView( IFolderView && );
	void IFolderView( IFolderView const & );
	void IFolderView();
	IFolderView & operator=( IFolderView && );
	IFolderView & operator=( IFolderView const & );
	/*0008*/
};

struct IFolderView2 : IFolderView {
	/*0088*/ virtual HRESULT SetGroupBy( _tagpropertykey const & , INT ) = 0;
	/*0090*/ virtual HRESULT GetGroupBy( _tagpropertykey * , INT * ) = 0;
	/*0098*/ virtual HRESULT SetViewProperty( _ITEMIDLIST const __unaligned * , _tagpropertykey const & , tagPROPVARIANT const & ) = 0;
	/*00a0*/ virtual HRESULT GetViewProperty( _ITEMIDLIST const __unaligned * , _tagpropertykey const & , tagPROPVARIANT * ) = 0;
	/*00a8*/ virtual HRESULT SetTileViewProperties( _ITEMIDLIST const __unaligned * , WCHAR const * ) = 0;
	/*00b0*/ virtual HRESULT SetExtendedTileViewProperties( _ITEMIDLIST const __unaligned * , WCHAR const * ) = 0;
	/*00b8*/ virtual HRESULT SetText( FVTEXTTYPE , WCHAR const * ) = 0;
	/*00c0*/ virtual HRESULT SetCurrentFolderFlags( ULONG , ULONG ) = 0;
	/*00c8*/ virtual HRESULT GetCurrentFolderFlags( ULONG * ) = 0;
	/*00d0*/ virtual HRESULT GetSortColumnCount( INT * ) = 0;
	/*00d8*/ virtual HRESULT SetSortColumns( SORTCOLUMN const * , INT ) = 0;
	/*00e0*/ virtual HRESULT GetSortColumns( SORTCOLUMN * , INT ) = 0;
	/*00e8*/ virtual HRESULT GetItem( INT , _GUID const & , void * * ) = 0;
	/*00f0*/ virtual HRESULT GetVisibleItem( INT , INT , INT * ) = 0;
	/*00f8*/ virtual HRESULT GetSelectedItem( INT , INT * ) = 0;
	/*0100*/ virtual HRESULT GetSelection( INT , IShellItemArray * * ) = 0;
	/*0108*/ virtual HRESULT GetSelectionState( _ITEMIDLIST const __unaligned * , ULONG * ) = 0;
	/*0110*/ virtual HRESULT InvokeVerbOnSelection( CHAR const * ) = 0;
	/*0118*/ virtual HRESULT SetViewModeAndIconSize( FOLDERVIEWMODE , INT ) = 0;
	/*0120*/ virtual HRESULT GetViewModeAndIconSize( FOLDERVIEWMODE * , INT * ) = 0;
	/*0128*/ virtual HRESULT SetGroupSubsetCount( UINT ) = 0;
	/*0130*/ virtual HRESULT GetGroupSubsetCount( UINT * ) = 0;
	/*0138*/ virtual HRESULT SetRedraw( INT ) = 0;
	/*0140*/ virtual HRESULT IsMoveInSameFolder() = 0;
	/*0148*/ virtual HRESULT DoRename() = 0;
	void IFolderView2( IFolderView2 && );
	void IFolderView2( IFolderView2 const & );
	void IFolderView2();
	IFolderView2 & operator=( IFolderView2 && );
	IFolderView2 & operator=( IFolderView2 const & );
	/*0008*/
};

struct IFolderViewSettings : IUnknown {
	/*0018*/ virtual HRESULT GetColumnPropertyList( _GUID const & , void * * ) = 0;
	/*0020*/ virtual HRESULT GetGroupByProperty( _tagpropertykey * , INT * ) = 0;
	/*0028*/ virtual HRESULT GetViewMode( FOLDERLOGICALVIEWMODE * ) = 0;
	/*0030*/ virtual HRESULT GetIconSize( UINT * ) = 0;
	/*0038*/ virtual HRESULT GetFolderFlags( FOLDERFLAGS * , FOLDERFLAGS * ) = 0;
	/*0040*/ virtual HRESULT GetSortColumns( SORTCOLUMN * , UINT , UINT * ) = 0;
	/*0048*/ virtual HRESULT GetGroupSubsetCount( UINT * ) = 0;
	void IFolderViewSettings( IFolderViewSettings && );
	void IFolderViewSettings( IFolderViewSettings const & );
	void IFolderViewSettings();
	IFolderViewSettings & operator=( IFolderViewSettings && );
	IFolderViewSettings & operator=( IFolderViewSettings const & );
	/*0008*/
};

struct IFont : IUnknown {
	/*0018*/ virtual HRESULT get_Name( WCHAR * * ) = 0;
	/*0020*/ virtual HRESULT put_Name( WCHAR * ) = 0;
	/*0028*/ virtual HRESULT get_Size( tagCY * ) = 0;
	/*0030*/ virtual HRESULT put_Size( tagCY ) = 0;
	/*0038*/ virtual HRESULT get_Bold( INT * ) = 0;
	/*0040*/ virtual HRESULT put_Bold( INT ) = 0;
	/*0048*/ virtual HRESULT get_Italic( INT * ) = 0;
	/*0050*/ virtual HRESULT put_Italic( INT ) = 0;
	/*0058*/ virtual HRESULT get_Underline( INT * ) = 0;
	/*0060*/ virtual HRESULT put_Underline( INT ) = 0;
	/*0068*/ virtual HRESULT get_Strikethrough( INT * ) = 0;
	/*0070*/ virtual HRESULT put_Strikethrough( INT ) = 0;
	/*0078*/ virtual HRESULT get_Weight( SHORT * ) = 0;
	/*0080*/ virtual HRESULT put_Weight( SHORT ) = 0;
	/*0088*/ virtual HRESULT get_Charset( SHORT * ) = 0;
	/*0090*/ virtual HRESULT put_Charset( SHORT ) = 0;
	/*0098*/ virtual HRESULT get_hFont( HFONT__ * * ) = 0;
	/*00a0*/ virtual HRESULT Clone( IFont * * ) = 0;
	/*00a8*/ virtual HRESULT IsEqual( IFont * ) = 0;
	/*00b0*/ virtual HRESULT SetRatio( LONG , LONG ) = 0;
	/*00b8*/ virtual HRESULT QueryTextMetrics( tagTEXTMETRICW * ) = 0;
	/*00c0*/ virtual HRESULT AddRefHfont( HFONT__ * ) = 0;
	/*00c8*/ virtual HRESULT ReleaseHfont( HFONT__ * ) = 0;
	/*00d0*/ virtual HRESULT SetHdc( HDC__ * ) = 0;
	void IFont( IFont && );
	void IFont( IFont const & );
	void IFont();
	IFont & operator=( IFont && );
	IFont & operator=( IFont const & );
	/*0008*/
};

struct IFontDisp : IDispatch {
	void IFontDisp( IFontDisp && );
	void IFontDisp( IFontDisp const & );
	void IFontDisp();
	IFontDisp & operator=( IFontDisp && );
	IFontDisp & operator=( IFontDisp const & );
	/*0008*/
};

struct IFontEventsDisp : IDispatch {
	void IFontEventsDisp( IFontEventsDisp && );
	void IFontEventsDisp( IFontEventsDisp const & );
	void IFontEventsDisp();
	IFontEventsDisp & operator=( IFontEventsDisp && );
	IFontEventsDisp & operator=( IFontEventsDisp const & );
	/*0008*/
};

struct IForegroundTransfer : IUnknown {
	/*0018*/ virtual HRESULT AllowForegroundTransfer( void * ) = 0;
	void IForegroundTransfer( IForegroundTransfer && );
	void IForegroundTransfer( IForegroundTransfer const & );
	void IForegroundTransfer();
	IForegroundTransfer & operator=( IForegroundTransfer && );
	IForegroundTransfer & operator=( IForegroundTransfer const & );
	/*0008*/
};

struct IFrameworkInputPane : IUnknown {
	/*0018*/ virtual HRESULT Advise( IUnknown * , IFrameworkInputPaneHandler * , ULONG * ) = 0;
	/*0020*/ virtual HRESULT AdviseWithHWND( HWND__ * , IFrameworkInputPaneHandler * , ULONG * ) = 0;
	/*0028*/ virtual HRESULT Unadvise( ULONG ) = 0;
	/*0030*/ virtual HRESULT Location( tagRECT * ) = 0;
	void IFrameworkInputPane( IFrameworkInputPane && );
	void IFrameworkInputPane( IFrameworkInputPane const & );
	void IFrameworkInputPane();
	IFrameworkInputPane & operator=( IFrameworkInputPane && );
	IFrameworkInputPane & operator=( IFrameworkInputPane const & );
	/*0008*/
};

struct IFrameworkInputPaneHandler : IUnknown {
	/*0018*/ virtual HRESULT Showing( tagRECT * , INT ) = 0;
	/*0020*/ virtual HRESULT Hiding( INT ) = 0;
	void IFrameworkInputPaneHandler( IFrameworkInputPaneHandler && );
	void IFrameworkInputPaneHandler( IFrameworkInputPaneHandler const & );
	void IFrameworkInputPaneHandler();
	IFrameworkInputPaneHandler & operator=( IFrameworkInputPaneHandler && );
	IFrameworkInputPaneHandler & operator=( IFrameworkInputPaneHandler const & );
	/*0008*/
};

struct IGetBindHandle : IUnknown {
	/*0018*/ virtual HRESULT GetBindHandle( __MIDL_IGetBindHandle_0001 , void * * ) = 0;
	void IGetBindHandle( IGetBindHandle && );
	void IGetBindHandle( IGetBindHandle const & );
	void IGetBindHandle();
	IGetBindHandle & operator=( IGetBindHandle && );
	IGetBindHandle & operator=( IGetBindHandle const & );
	/*0008*/
};

struct IGlobalInterfaceTable : IUnknown {
	/*0018*/ virtual HRESULT RegisterInterfaceInGlobal( IUnknown * , _GUID const & , ULONG * ) = 0;
	/*0020*/ virtual HRESULT RevokeInterfaceFromGlobal( ULONG ) = 0;
	/*0028*/ virtual HRESULT GetInterfaceFromGlobal( ULONG , _GUID const & , void * * ) = 0;
	void IGlobalInterfaceTable( IGlobalInterfaceTable && );
	void IGlobalInterfaceTable( IGlobalInterfaceTable const & );
	void IGlobalInterfaceTable();
	IGlobalInterfaceTable & operator=( IGlobalInterfaceTable && );
	IGlobalInterfaceTable & operator=( IGlobalInterfaceTable const & );
	/*0008*/
};

struct IGlobalOptions : IUnknown {
	/*0018*/ virtual HRESULT Set( tagGLOBALOPT_PROPERTIES , ULONGLONG ) = 0;
	/*0020*/ virtual HRESULT Query( tagGLOBALOPT_PROPERTIES , ULONGLONG * ) = 0;
	void IGlobalOptions( IGlobalOptions && );
	void IGlobalOptions( IGlobalOptions const & );
	void IGlobalOptions();
	IGlobalOptions & operator=( IGlobalOptions && );
	IGlobalOptions & operator=( IGlobalOptions const & );
	/*0008*/
};

enum IHM_DISPLAY_MODE {
	IDM_NONE = 0x0,
	IDM_IMMERSIVE = 0x1,
	IDM_FLOATING = 0x2,
	IDM_DOCKED = 0x3,
	IDM_SPLIT = 0x4
};

struct IHandleManager : IInspectable {
	/*0030*/ virtual HRESULT GetWlanHandle( void * * ) = 0;
	/*0038*/ virtual HRESULT GetWwanHandle( void * * ) = 0;
	/*0040*/ virtual HRESULT GetWcmHandle( void * * ) = 0;
	/*0048*/ virtual HRESULT GetNetworkListManager( ComPtr<INetworkListManagerPrivate> * ) = 0;
	/*0050*/ virtual HRESULT GetNetworkListManager2( ComPtr<INetworkListManagerPrivate2> * ) = 0;
	void IHandleManager( IHandleManager && );
	void IHandleManager( IHandleManager const & );
	void IHandleManager();
	IHandleManager & operator=( IHandleManager && );
	IHandleManager & operator=( IHandleManager const & );
	/*0008*/
};

struct IHandlerActivationHost : IUnknown {
	/*0018*/ virtual HRESULT BeforeCoCreateInstance( _GUID const & , IShellItemArray * , IHandlerInfo * ) = 0;
	/*0020*/ virtual HRESULT BeforeCreateProcess( WCHAR const * , WCHAR const * , IHandlerInfo * ) = 0;
	void IHandlerActivationHost( IHandlerActivationHost && );
	void IHandlerActivationHost( IHandlerActivationHost const & );
	void IHandlerActivationHost();
	IHandlerActivationHost & operator=( IHandlerActivationHost && );
	IHandlerActivationHost & operator=( IHandlerActivationHost const & );
	/*0008*/
};

struct IHandlerInfo : IUnknown {
	/*0018*/ virtual HRESULT GetApplicationDisplayName( WCHAR * * ) = 0;
	/*0020*/ virtual HRESULT GetApplicationPublisher( WCHAR * * ) = 0;
	/*0028*/ virtual HRESULT GetApplicationIconReference( WCHAR * * ) = 0;
	void IHandlerInfo( IHandlerInfo && );
	void IHandlerInfo( IHandlerInfo const & );
	void IHandlerInfo();
	IHandlerInfo & operator=( IHandlerInfo && );
	IHandlerInfo & operator=( IHandlerInfo const & );
	/*0008*/
};

struct IHandlerInfo2 : IHandlerInfo {
	/*0030*/ virtual HRESULT GetApplicationId( WCHAR * * ) = 0;
	void IHandlerInfo2( IHandlerInfo2 && );
	void IHandlerInfo2( IHandlerInfo2 const & );
	void IHandlerInfo2();
	IHandlerInfo2 & operator=( IHandlerInfo2 && );
	IHandlerInfo2 & operator=( IHandlerInfo2 const & );
	/*0008*/
};

struct IHomeGroup : IUnknown {
	/*0018*/ virtual HRESULT IsMember( INT * ) = 0;
	/*0020*/ virtual HRESULT ShowSharingWizard( HWND__ * , HOMEGROUPSHARINGCHOICES * ) = 0;
	void IHomeGroup( IHomeGroup && );
	void IHomeGroup( IHomeGroup const & );
	void IHomeGroup();
	IHomeGroup & operator=( IHomeGroup && );
	IHomeGroup & operator=( IHomeGroup const & );
	/*0008*/
};

struct IHttpNegotiate : IUnknown {
	/*0018*/ virtual HRESULT BeginningTransaction( WCHAR const * , WCHAR const * , ULONG , WCHAR * * ) = 0;
	/*0020*/ virtual HRESULT OnResponse( ULONG , WCHAR const * , WCHAR const * , WCHAR * * ) = 0;
	void IHttpNegotiate( IHttpNegotiate && );
	void IHttpNegotiate( IHttpNegotiate const & );
	void IHttpNegotiate();
	IHttpNegotiate & operator=( IHttpNegotiate && );
	IHttpNegotiate & operator=( IHttpNegotiate const & );
	/*0008*/
};

struct IHttpNegotiate2 : IHttpNegotiate {
	/*0028*/ virtual HRESULT GetRootSecurityId( UCHAR * , ULONG * , ULONGLONG ) = 0;
	void IHttpNegotiate2( IHttpNegotiate2 && );
	void IHttpNegotiate2( IHttpNegotiate2 const & );
	void IHttpNegotiate2();
	IHttpNegotiate2 & operator=( IHttpNegotiate2 && );
	IHttpNegotiate2 & operator=( IHttpNegotiate2 const & );
	/*0008*/
};

struct IHttpNegotiate3 : IHttpNegotiate2 {
	/*0030*/ virtual HRESULT GetSerializedClientCertContext( UCHAR * * , ULONG * ) = 0;
	void IHttpNegotiate3( IHttpNegotiate3 && );
	void IHttpNegotiate3( IHttpNegotiate3 const & );
	void IHttpNegotiate3();
	IHttpNegotiate3 & operator=( IHttpNegotiate3 && );
	IHttpNegotiate3 & operator=( IHttpNegotiate3 const & );
	/*0008*/
};

struct IHttpSecurity : IWindowForBindingUI {
	/*0020*/ virtual HRESULT OnSecurityProblem( ULONG ) = 0;
	void IHttpSecurity( IHttpSecurity && );
	void IHttpSecurity( IHttpSecurity const & );
	void IHttpSecurity();
	IHttpSecurity & operator=( IHttpSecurity && );
	IHttpSecurity & operator=( IHttpSecurity const & );
	/*0008*/
};

struct IIOCancelInformation : IUnknown {
	/*0018*/ virtual HRESULT SetCancelInformation( ULONG , UINT ) = 0;
	/*0020*/ virtual HRESULT GetCancelInformation( ULONG * , UINT * ) = 0;
	void IIOCancelInformation( IIOCancelInformation && );
	void IIOCancelInformation( IIOCancelInformation const & );
	void IIOCancelInformation();
	IIOCancelInformation & operator=( IIOCancelInformation && );
	IIOCancelInformation & operator=( IIOCancelInformation const & );
	/*0008*/
};

struct IIdentityName : IRelatedItem {
	void IIdentityName( IIdentityName && );
	void IIdentityName( IIdentityName const & );
	void IIdentityName();
	IIdentityName & operator=( IIdentityName && );
	IIdentityName & operator=( IIdentityName const & );
	/*0008*/
};

struct IImageList : IUnknown {
	/*0018*/ virtual HRESULT Add( HBITMAP__ * , HBITMAP__ * , INT * ) = 0;
	/*0020*/ virtual HRESULT ReplaceIcon( INT , HICON__ * , INT * ) = 0;
	/*0028*/ virtual HRESULT SetOverlayImage( INT , INT ) = 0;
	/*0030*/ virtual HRESULT Replace( INT , HBITMAP__ * , HBITMAP__ * ) = 0;
	/*0038*/ virtual HRESULT AddMasked( HBITMAP__ * , ULONG , INT * ) = 0;
	/*0040*/ virtual HRESULT Draw( _IMAGELISTDRAWPARAMS * ) = 0;
	/*0048*/ virtual HRESULT Remove( INT ) = 0;
	/*0050*/ virtual HRESULT GetIcon( INT , UINT , HICON__ * * ) = 0;
	/*0058*/ virtual HRESULT GetImageInfo( INT , _IMAGEINFO * ) = 0;
	/*0060*/ virtual HRESULT Copy( INT , IUnknown * , INT , UINT ) = 0;
	/*0068*/ virtual HRESULT Merge( INT , IUnknown * , INT , INT , INT , _GUID const & , void * * ) = 0;
	/*0070*/ virtual HRESULT Clone( _GUID const & , void * * ) = 0;
	/*0078*/ virtual HRESULT GetImageRect( INT , tagRECT * ) = 0;
	/*0080*/ virtual HRESULT GetIconSize( INT * , INT * ) = 0;
	/*0088*/ virtual HRESULT SetIconSize( INT , INT ) = 0;
	/*0090*/ virtual HRESULT GetImageCount( INT * ) = 0;
	/*0098*/ virtual HRESULT SetImageCount( UINT ) = 0;
	/*00a0*/ virtual HRESULT SetBkColor( ULONG , ULONG * ) = 0;
	/*00a8*/ virtual HRESULT GetBkColor( ULONG * ) = 0;
	/*00b0*/ virtual HRESULT BeginDrag( INT , INT , INT ) = 0;
	/*00b8*/ virtual HRESULT EndDrag() = 0;
	/*00c0*/ virtual HRESULT DragEnter( HWND__ * , INT , INT ) = 0;
	/*00c8*/ virtual HRESULT DragLeave( HWND__ * ) = 0;
	/*00d0*/ virtual HRESULT DragMove( INT , INT ) = 0;
	/*00d8*/ virtual HRESULT SetDragCursorImage( IUnknown * , INT , INT , INT ) = 0;
	/*00e0*/ virtual HRESULT DragShowNolock( INT ) = 0;
	/*00e8*/ virtual HRESULT GetDragImage( tagPOINT * , tagPOINT * , _GUID const & , void * * ) = 0;
	/*00f0*/ virtual HRESULT GetItemFlags( INT , ULONG * ) = 0;
	/*00f8*/ virtual HRESULT GetOverlayImage( INT , INT * ) = 0;
	void IImageList( IImageList && );
	void IImageList( IImageList const & );
	void IImageList();
	IImageList & operator=( IImageList && );
	IImageList & operator=( IImageList const & );
	/*0008*/
};

struct IInitializeCommand : IUnknown {
	/*0018*/ virtual HRESULT Initialize( WCHAR const * , IPropertyBag * ) = 0;
	void IInitializeCommand( IInitializeCommand && );
	void IInitializeCommand( IInitializeCommand const & );
	void IInitializeCommand();
	IInitializeCommand & operator=( IInitializeCommand && );
	IInitializeCommand & operator=( IInitializeCommand const & );
	/*0008*/
};

struct IInitializeNetworkFolder : IUnknown {
	/*0018*/ virtual HRESULT Initialize( _ITEMIDLIST const __unaligned * , _ITEMIDLIST const __unaligned * , UINT , WCHAR const * , WCHAR const * ) = 0;
	void IInitializeNetworkFolder( IInitializeNetworkFolder && );
	void IInitializeNetworkFolder( IInitializeNetworkFolder const & );
	void IInitializeNetworkFolder();
	IInitializeNetworkFolder & operator=( IInitializeNetworkFolder && );
	IInitializeNetworkFolder & operator=( IInitializeNetworkFolder const & );
	/*0008*/
};

struct IInitializeSpy : IUnknown {
	/*0018*/ virtual HRESULT PreInitialize( ULONG , ULONG ) = 0;
	/*0020*/ virtual HRESULT PostInitialize( HRESULT , ULONG , ULONG ) = 0;
	/*0028*/ virtual HRESULT PreUninitialize( ULONG ) = 0;
	/*0030*/ virtual HRESULT PostUninitialize( ULONG ) = 0;
	void IInitializeSpy( IInitializeSpy && );
	void IInitializeSpy( IInitializeSpy const & );
	void IInitializeSpy();
	IInitializeSpy & operator=( IInitializeSpy && );
	IInitializeSpy & operator=( IInitializeSpy const & );
	/*0008*/
};

struct IInitializeWithBindCtx : IUnknown {
	/*0018*/ virtual HRESULT Initialize( IBindCtx * ) = 0;
	void IInitializeWithBindCtx( IInitializeWithBindCtx && );
	void IInitializeWithBindCtx( IInitializeWithBindCtx const & );
	void IInitializeWithBindCtx();
	IInitializeWithBindCtx & operator=( IInitializeWithBindCtx && );
	IInitializeWithBindCtx & operator=( IInitializeWithBindCtx const & );
	/*0008*/
};

struct IInitializeWithFile : IUnknown {
	/*0018*/ virtual HRESULT Initialize( WCHAR const * , ULONG ) = 0;
	void IInitializeWithFile( IInitializeWithFile && );
	void IInitializeWithFile( IInitializeWithFile const & );
	void IInitializeWithFile();
	IInitializeWithFile & operator=( IInitializeWithFile && );
	IInitializeWithFile & operator=( IInitializeWithFile const & );
	/*0008*/
};

struct IInitializeWithItem : IUnknown {
	/*0018*/ virtual HRESULT Initialize( IShellItem * , ULONG ) = 0;
	void IInitializeWithItem( IInitializeWithItem && );
	void IInitializeWithItem( IInitializeWithItem const & );
	void IInitializeWithItem();
	IInitializeWithItem & operator=( IInitializeWithItem && );
	IInitializeWithItem & operator=( IInitializeWithItem const & );
	/*0008*/
};

struct IInitializeWithPropertyStore : IUnknown {
	/*0018*/ virtual HRESULT Initialize( IPropertyStore * ) = 0;
	void IInitializeWithPropertyStore( IInitializeWithPropertyStore && );
	void IInitializeWithPropertyStore( IInitializeWithPropertyStore const & );
	void IInitializeWithPropertyStore();
	IInitializeWithPropertyStore & operator=( IInitializeWithPropertyStore && );
	IInitializeWithPropertyStore & operator=( IInitializeWithPropertyStore const & );
	/*0008*/
};

struct IInitializeWithStream : IUnknown {
	/*0018*/ virtual HRESULT Initialize( IStream * , ULONG ) = 0;
	void IInitializeWithStream( IInitializeWithStream && );
	void IInitializeWithStream( IInitializeWithStream const & );
	void IInitializeWithStream();
	IInitializeWithStream & operator=( IInitializeWithStream && );
	IInitializeWithStream & operator=( IInitializeWithStream const & );
	/*0008*/
};

struct IInitializeWithWindow : IUnknown {
	/*0018*/ virtual HRESULT Initialize( HWND__ * ) = 0;
	void IInitializeWithWindow( IInitializeWithWindow && );
	void IInitializeWithWindow( IInitializeWithWindow const & );
	void IInitializeWithWindow();
	IInitializeWithWindow & operator=( IInitializeWithWindow && );
	IInitializeWithWindow & operator=( IInitializeWithWindow const & );
	/*0008*/
};

struct IInputObject : IUnknown {
	/*0018*/ virtual HRESULT UIActivateIO( INT , tagMSG * ) = 0;
	/*0020*/ virtual HRESULT HasFocusIO() = 0;
	/*0028*/ virtual HRESULT TranslateAcceleratorIO( tagMSG * ) = 0;
	void IInputObject( IInputObject && );
	void IInputObject( IInputObject const & );
	void IInputObject();
	IInputObject & operator=( IInputObject && );
	IInputObject & operator=( IInputObject const & );
	/*0008*/
};

struct IInputObject2 : IInputObject {
	/*0030*/ virtual HRESULT TranslateAcceleratorGlobal( tagMSG * ) = 0;
	void IInputObject2( IInputObject2 && );
	void IInputObject2( IInputObject2 const & );
	void IInputObject2();
	IInputObject2 & operator=( IInputObject2 && );
	IInputObject2 & operator=( IInputObject2 const & );
	/*0008*/
};

struct IInputObjectSite : IUnknown {
	/*0018*/ virtual HRESULT OnFocusChangeIS( IUnknown * , INT ) = 0;
	void IInputObjectSite( IInputObjectSite && );
	void IInputObjectSite( IInputObjectSite const & );
	void IInputObjectSite();
	IInputObjectSite & operator=( IInputObjectSite && );
	IInputObjectSite & operator=( IInputObjectSite const & );
	/*0008*/
};

struct IInspectable : IUnknown {
	/*0018*/ virtual HRESULT GetIids( ULONG * , _GUID * * ) = 0;
	/*0020*/ virtual HRESULT GetRuntimeClassName( HSTRING__ * * ) = 0;
	/*0028*/ virtual HRESULT GetTrustLevel( TrustLevel * ) = 0;
	void IInspectable( IInspectable && );
	void IInspectable( IInspectable const & );
	void IInspectable();
	IInspectable & operator=( IInspectable && );
	IInspectable & operator=( IInspectable const & );
	/*0008*/
};

struct IInternalConnection : IUnknown {
	/*0018*/ virtual HRESULT AddConnection() = 0;
	/*0020*/ virtual HRESULT ReleaseConnection() = 0;
	void IInternalConnection( IInternalConnection && );
	void IInternalConnection( IInternalConnection const & );
	void IInternalConnection();
	IInternalConnection & operator=( IInternalConnection && );
	IInternalConnection & operator=( IInternalConnection const & );
	/*0008*/
};

struct IInternalUnknown : IUnknown {
	/*0018*/ virtual HRESULT QueryInternalInterface( _GUID const & , void * * ) = 0;
	void IInternalUnknown( IInternalUnknown && );
	void IInternalUnknown( IInternalUnknown const & );
	void IInternalUnknown();
	IInternalUnknown & operator=( IInternalUnknown && );
	IInternalUnknown & operator=( IInternalUnknown const & );
	/*0008*/
};

struct IInternet : IUnknown {
	void IInternet( IInternet && );
	void IInternet( IInternet const & );
	void IInternet();
	IInternet & operator=( IInternet && );
	IInternet & operator=( IInternet const & );
	/*0008*/
};

struct IInternetBindInfo : IUnknown {
	/*0018*/ virtual HRESULT GetBindInfo( ULONG * , _tagBINDINFO * ) = 0;
	/*0020*/ virtual HRESULT GetBindString( ULONG , WCHAR * * , ULONG , ULONG * ) = 0;
	void IInternetBindInfo( IInternetBindInfo && );
	void IInternetBindInfo( IInternetBindInfo const & );
	void IInternetBindInfo();
	IInternetBindInfo & operator=( IInternetBindInfo && );
	IInternetBindInfo & operator=( IInternetBindInfo const & );
	/*0008*/
};

struct IInternetBindInfoEx : IInternetBindInfo {
	/*0028*/ virtual HRESULT GetBindInfoEx( ULONG * , _tagBINDINFO * , ULONG * , ULONG * ) = 0;
	void IInternetBindInfoEx( IInternetBindInfoEx && );
	void IInternetBindInfoEx( IInternetBindInfoEx const & );
	void IInternetBindInfoEx();
	IInternetBindInfoEx & operator=( IInternetBindInfoEx && );
	IInternetBindInfoEx & operator=( IInternetBindInfoEx const & );
	/*0008*/
};

struct IInternetHostSecurityManager : IUnknown {
	/*0018*/ virtual HRESULT GetSecurityId( UCHAR * , ULONG * , ULONGLONG ) = 0;
	/*0020*/ virtual HRESULT ProcessUrlAction( ULONG , UCHAR * , ULONG , UCHAR * , ULONG , ULONG , ULONG ) = 0;
	/*0028*/ virtual HRESULT QueryCustomPolicy( _GUID const & , UCHAR * * , ULONG * , UCHAR * , ULONG , ULONG ) = 0;
	void IInternetHostSecurityManager( IInternetHostSecurityManager && );
	void IInternetHostSecurityManager( IInternetHostSecurityManager const & );
	void IInternetHostSecurityManager();
	IInternetHostSecurityManager & operator=( IInternetHostSecurityManager && );
	IInternetHostSecurityManager & operator=( IInternetHostSecurityManager const & );
	/*0008*/
};

struct IInternetPriority : IUnknown {
	/*0018*/ virtual HRESULT SetPriority( LONG ) = 0;
